[
  {
    "word": "POLY-",
    "definitions": [
      "A combining form or prefix from Gr. poly`s, many; as, polygon, a figure of many angles; polyatomic, having many atoms; polychord, polyconic."
    ]
  },
  {
    "word": "SO-SO",
    "definitions": [
      "Neither very good nor very bad; middling; passable; tolerable; indifferent. In some Irish houses, where things are so-so, One gammon of bacon hangs up for a show. Goldsmith. He [Burns] certainly wrote some so-so verses to the Tree of Liberty. Prof. Wilson."
    ]
  },
  {
    "word": "PLANI-",
    "definitions": [
      "Combining forms signifying flat, level, plane; as planifolious, planimetry, plano-concave."
    ]
  },
  {
    "word": "PUT-UP",
    "definitions": ["Arranged; plotted; -- in a bad sense; as, a put-up job. [Colloq.]"]
  },
  {
    "word": "ULTRA-",
    "definitions": [
      "A prefix from the Latin ultra beyond (see Ulterior), having in composition the signification beyond, on the other side, chiefly when joined with words expressing relations of place; as, ultramarine, ultramontane, ultramundane, ultratropical, etc. In other relations it has the sense of excessively, exceedingly, beyond what is common, natural, right, or proper; as, ultraconservative; ultrademocratic, ultradespotic, ultraliberal, ultraradical, etc."
    ]
  },
  {
    "word": "BY-PAST",
    "definitions": ["Past; gone by. \"By-past perils.\" Shak."]
  },
  {
    "word": "CONICO-",
    "definitions": [
      "A combining form, meaning somewhat resembling a cone; as, conico-cylindrical, resembling a cone and a cylinder; conico- hemispherical; conico-subulate."
    ]
  },
  {
    "word": "FAR-OFF",
    "definitions": ["Remote; as, the far-off distance. Cf. Far-off, under Far, adv."]
  },
  {
    "word": "LEAN-TO",
    "definitions": [
      "Having only one slope or pitch; -- said of a roof.  -- n.",
      "A shed or slight building placed against the wall of a larger structure and having a single-pitched roof; -- called also penthouse, and to-fall. The outer circuit was covered as a lean-to, all round this inner apartment. De Foe."
    ]
  },
  {
    "word": "RED-HOT",
    "definitions": [
      "Red with heat; heated to redness; as, red-hot iron; red-hot balls. Hence, figuratively, excited; violent; as, a red-hot radical. Shak."
    ]
  },
  {
    "word": "STEP-UP",
    "definitions": [
      "Transforming or converting a low-pressure current into one of high pressure; as, a step-up transformer.",
      "A suffix denoting the agent (originally a woman), especially a person who does something with skill or as an occupation; as in spinster (originally, a woman who spins), songster, baxter (= bakester), youngster."
    ]
  },
  {
    "word": "TWO-PLY",
    "definitions": [
      "Consisting of two thicknesses, as cloth; double.",
      "Woven double, as cloth or carpeting, by incorporating two sets of warp thread and two of weft."
    ]
  },
  {
    "word": "TWO-WAY",
    "definitions": [
      "Serving to connect at will one pipe or channel with either of two others; as, a two-way cock."
    ]
  },
  {
    "word": "UP-OVER",
    "definitions": [
      "Designating a method of shaft excavation by drifting to a point below, and then raising instead of sinking."
    ]
  },
  {
    "word": "ARM-GRET",
    "definitions": ["Great as a man's arm. [Obs.] A wreath of gold, arm-gret. Chaucer."]
  },
  {
    "word": "BRAN-NEW",
    "definitions": ["See Brand-new."]
  },
  {
    "word": "CAST-OFF",
    "definitions": ["Cast or laid aside; as, cast-off clothes."]
  },
  {
    "word": "CAT-EYED",
    "definitions": ["Having eyes like a cat; hence, able to see in the dark."]
  },
  {
    "word": "CO-UNITE",
    "definitions": ["United closely with another. [Obs.]"]
  },
  {
    "word": "DEEP-FET",
    "definitions": ["Deeply fetched or drawn. [Obs.] \"Deep-fet groans.\" Shak."]
  },
  {
    "word": "DEEP-SEA",
    "definitions": [
      "Of or pertaining to the deeper parts of the sea; as, a deep-sea line (i. e., a line to take soundings at a great depth); deep-sea lead; deep-sea soundings, explorations, etc."
    ]
  },
  {
    "word": "DIAMIDO-",
    "definitions": ["A prefix or combining form of Diamine."]
  },
  {
    "word": "DRY-EYED",
    "definitions": ["Not having tears in the eyes."]
  },
  {
    "word": "DRY-SHOD",
    "definitions": ["Without wetting the feet."]
  },
  {
    "word": "FIBU-LAR",
    "definitions": ["Pertaining to the fibula."]
  },
  {
    "word": "FIN-TOED",
    "definitions": ["Having toes connected by a membrane; palmiped; palmated; also, lobate."]
  },
  {
    "word": "FIRE-NEW",
    "definitions": [
      "Fresh from the forge; bright; quite new; brand-new. Charles reade. Your fire-new stamp of honor is scarce current. Shak."
    ]
  },
  {
    "word": "FOUR-WAY",
    "definitions": [
      "Allowing passage in either of four directions; as, a four-way cock, or valve. Francis. Four-way cock, a cock connected with four pipes or ports, and having two or more passages in the plug, by which the adjacent pipes or ports may be made to communicate; formerly used as a valve in the steam engine, and now for various other purposes. In the illustration, a leads to the upper end of a steam engine cylinder, and b to the lower end; c is the steam pipe, and d the exhaust pipe."
    ]
  },
  {
    "word": "FULL-HOT",
    "definitions": ["Very fiery. Shak."]
  },
  {
    "word": "HIGH-FED",
    "definitions": ["Pampered; fed luxuriously."]
  },
  {
    "word": "HIGH-RED",
    "definitions": ["Of a strong red color."]
  },
  {
    "word": "HORN-MAD",
    "definitions": [
      "Quite mad; -- raving crazy. Did I tell you about Mr. Garrick, that the town are horn-mad after Gray."
    ]
  },
  {
    "word": "ILL-BRED",
    "definitions": [
      "Badly educated or brought up; impolite; incivil; rude. See Note under Ill, adv."
    ]
  },
  {
    "word": "ILL-USED",
    "definitions": ["Misapplied; treated badly."]
  },
  {
    "word": "IN-GOING",
    "definitions": ["Going; entering, as upon an office or a possession; as, an in- going tenant."]
  },
  {
    "word": "KEY-COLD",
    "definitions": [
      "Cold as a metallic key; lifeless. [Formerly, a proverbial expression.] Shak. Milton."
    ]
  },
  {
    "word": "LEFT-OFF",
    "definitions": ["Laid a side; cast-off."]
  },
  {
    "word": "NEW-YEAR",
    "definitions": [
      "Of or pertaining to, or suitable for, the commencement of the year; as, New-year gifts or odes."
    ]
  },
  {
    "word": "ONE-HAND",
    "definitions": ["Employing one hand; as, the one-hand alphabet. See Dactylology."]
  },
  {
    "word": "OPEN-AIR",
    "definitions": ["Taking place in the open air; outdoor; as, an open-air game or meeting."]
  },
  {
    "word": "OVER-ARM",
    "definitions": [
      "Done (as bowling or pitching) with the arm raised above the shoulder. See Overhard. \"An over-arm with a round-arm bowler.\" R. A. Proctor."
    ]
  },
  {
    "word": "OWL-EYED",
    "definitions": ["Having eyes like an owl's."]
  },
  {
    "word": "PIG-EYED",
    "definitions": ["Having small, deep-set eyes."]
  },
  {
    "word": "PIN-EYED",
    "definitions": [
      "Having the stigma visible at the throad of a gamopetalous corolla, while the stamens are concealed in the tube; -- said of dimorphous flowers. The opposite of Ant: thrum-eyed."
    ]
  },
  {
    "word": "PIN-FIRE",
    "definitions": ["Having a firing pin to explode the cartridge; as, a pin-fire rifle."]
  },
  {
    "word": "PIXY-LED",
    "definitions": ["Led by pixies; bewildered."]
  },
  {
    "word": "POT-SURE",
    "definitions": ["Made confident by drink. [Obs.]"]
  },
  {
    "word": "RAT-TAIL",
    "definitions": [
      "Like a rat's tale in form; as, a rat-tail file, which is round, slender, and tapering. See Illust. of File."
    ]
  },
  {
    "word": "RED-HAND",
    "definitions": [
      "Having hands red with blood; in the very act, as if with red or bloody hands; -- said of a person taken in the act of homicide; hence, fresh from the commission of crime; as, he was taken red-hand or red-handed."
    ]
  },
  {
    "word": "RED-TAPE",
    "definitions": [
      "Pertaining to, or characterized by, official formality. See Red tape, under Red, a."
    ]
  },
  {
    "word": "RIM-FIRE",
    "definitions": [
      "Having the percussion fulminate in a rim surrounding the base, distinguished from center-fire; -- said of cartridges; also, using rim-fire cartridges; as, a rim-fire gun. Such cartridges are now little used."
    ]
  },
  {
    "word": "ROSE-CUT",
    "definitions": [
      "Cut flat on the reverse, and with a convex face formed of triangular facets in rows; -- said of diamonds and other precious stones. See Rose diamond, under Rose. Cf. Brilliant, n."
    ]
  },
  {
    "word": "ROSE-RED",
    "definitions": ["Red as a rose; specifically (Zoöl.), of a pure purplish red color. Chaucer."]
  },
  {
    "word": "RUMP-FED",
    "definitions": [
      "A Shakespearean word of uncertain meaning. Perhaps \"fattened in the rump, pampered.\" \"The rump-fed ronyon.\""
    ]
  },
  {
    "word": "SAND-LOT",
    "definitions": [
      "Lit., of or pert. to a lot or piece of sandy ground, -- hence, pert. to, or characteristic of, the policy or practices of the socialistic or communistic followers of the Irish agitator Denis Kearney, who delivered many of his speeches in the open sand lots about San Francisco; as, the sand-lot constitution of California, framed in 1879, under the influence of sand-lot agitation."
    ]
  },
  {
    "word": "SEA-BORN",
    "definitions": [
      "Born of the sea; produced by the sea. \"Neptune and his sea-born niece.\" Waller.",
      "Born at sea."
    ]
  },
  {
    "word": "SELF-ONE",
    "definitions": ["Secret. [Obs.] Marston."]
  },
  {
    "word": "SKY-BLUE",
    "definitions": ["Having the blue color of the sky; azure; as, a sky-blue stone. Wordsworth."]
  },
  {
    "word": "SPAN-NEW",
    "definitions": ["Quite new; brand-new; fire-new. \"A span-new archbishop's chair.\" Fuller."]
  },
  {
    "word": "START-UP",
    "definitions": ["Upstart. [R.] Walpole."]
  },
  {
    "word": "STEEP-UP",
    "definitions": ["Lofty and precipitous. [R.] Her stand she takes upon a steep-up hill. Shak."]
  },
  {
    "word": "STUCK-UP",
    "definitions": [
      "Self-important and supercilious, [Colloq.] The airs of small, stuck-up, men. A. K. H. Boyd."
    ]
  },
  {
    "word": "TETRAZO-",
    "definitions": [
      "A combining form (also used adjectively), designating any one of a series of double derivatives of the azo and diazo compounds containing four atoms of nitrogen."
    ]
  },
  {
    "word": "TWO-FOOT",
    "definitions": ["Measuring two feet; two feet long, thick, or wide; as, a two- foot rule."]
  },
  {
    "word": "TWO-HAND",
    "definitions": ["Employing two hangs; as, the two-hand alphabet. See Dactylology."]
  },
  {
    "word": "TWO-NAME",
    "definitions": [
      "Having or bearing two names; as, two-name paper, that is, negotiable paper on which at least two persons are severally liable as separate makers, or, usually, one as maker and one as indorser. [Colloq.]"
    ]
  },
  {
    "word": "TWO-PORT",
    "definitions": [
      "Having two ports; specif.: Designating a type of two-cycle internal-combustion engine in which the admission of the mixture to the crank case is through a suction valve."
    ]
  },
  {
    "word": "URANOSO-",
    "definitions": [
      "A combining form (also used adjectively) from uranium; -- used in naming certain complex compounds; as in uranoso-uranic oxide, uranoso-uranic sulphate."
    ]
  },
  {
    "word": "U-SHAPED",
    "definitions": [
      "Having the form of the letter U; specif. (Phys. Geog.),",
      "of valleys, resembling a broad U in cross profile."
    ]
  },
  {
    "word": "WASH-OFF",
    "definitions": [
      "Capable of being washed off; not permanent or durable; -- said of colors not fixed by steaming or otherwise."
    ]
  },
  {
    "word": "WAY-WISE",
    "definitions": [
      "Skillful in finding the way; well acquainted with the way or route; wise from having traveled."
    ]
  },
  {
    "word": "WEB-TOED",
    "definitions": ["Having the toes united by a web for a considerable part of their length."]
  },
  {
    "word": "WELL-SET",
    "definitions": ["Properly or firmly set.", "Well put together; having symmetry of parts."]
  },
  {
    "word": "WET-SHOD",
    "definitions": ["Having the feet, or the shoes on the feet, wet."]
  },
  {
    "word": "WILD-CAT",
    "definitions": [
      "Unsound; worthless; irresponsible; unsafe; -- said to have been originally applied to the notes of an insolvent bank in Michigan upon which there was the figure of a panther.",
      "Running without control; running along the line without a train; as, a wild-cat locomotive."
    ]
  },
  {
    "word": "WORN-OUT",
    "definitions": ["Consumed, or rendered useless, by wearing; as, worn-out garments."]
  },
  {
    "word": "WUNG-OUT",
    "definitions": ["Having the sails set in the manner called wing-and-wing. [Sailors' slang]"]
  },
  {
    "word": "AIR-BUILT",
    "definitions": [
      "Erected in the air; having no solid foundation; chimerical; as, an air-built castle."
    ]
  },
  {
    "word": "AIR-DRAWN",
    "definitions": ["Drawn in air; imaginary. This is the air-drawn dagger. Shak."]
  },
  {
    "word": "AIR-TIGHT",
    "definitions": ["So tight as to be impermeable to air; as, an air-tight cylinder."]
  },
  {
    "word": "BIRD-EYED",
    "definitions": ["Quick-sighted; catching a glance as one goes."]
  },
  {
    "word": "BLUE-EYED",
    "definitions": ["Having blue eyes."]
  },
  {
    "word": "BRAND-NEW",
    "definitions": ["Quite new; bright as if fresh from the forge."]
  },
  {
    "word": "BUCK-EYED",
    "definitions": ["Having bad or speckled eyes. \"A buck-eyed horse.\" James White."]
  },
  {
    "word": "CAST-IRON",
    "definitions": ["Made of cast iron. Hence, Fig.: like cast iron; hardy; unyielding."]
  },
  {
    "word": "CI-DEVANT",
    "definitions": ["Former; previous; of times gone by; as, a cidevant governor."]
  },
  {
    "word": "CLEAN-CUT",
    "definitions": ["See Clear-cut."]
  },
  {
    "word": "CLEAR-CUT",
    "definitions": [
      "Having a sharp, distinct outline, like that of a cameo. She has . . . a cold and clear-cut face. Tennyson.",
      "Concisely and distinctly expressed."
    ]
  },
  {
    "word": "COLD-SHUT",
    "definitions": [
      "Closed while too cold to become thoroughly welded; -- said of a forging or casting.  -- n.",
      "An imperfection caused by such insufficient welding."
    ]
  },
  {
    "word": "DEEP-LAID",
    "definitions": ["Laid deeply; formed with cunning and sagacity; as, deep-laid plans."]
  },
  {
    "word": "DEEP-READ",
    "definitions": ["Profoundly book-learned. \"Great writers and deep-read men.\" L'Estrange."]
  },
  {
    "word": "DOG-EARED",
    "definitions": [
      "Having the corners of the leaves turned down and soiled by careless or long-continued usage; -- said of a book. Statute books before unopened, not dog-eared. Ld. Mansfield."
    ]
  },
  {
    "word": "DOG-FACED",
    "definitions": [
      "Having a face resembling that of a dog. Dog-faced baboon (Zoöl.), any baboon of the genus Cynocephalus. See Drill."
    ]
  },
  {
    "word": "DOG-WEARY",
    "definitions": ["Extremely weary. Shak."]
  },
  {
    "word": "DOVE-EYED",
    "definitions": ["Having eyes like a dove; meekeyed; as, dove-eyed Peace."]
  },
  {
    "word": "DRY-BONED",
    "definitions": ["Having dry bones, or bones without flesh."]
  },
  {
    "word": "DRY-STONE",
    "definitions": ["Constructed of uncemented stone. \"Dry-stone walls.\" Sir W. Scott."]
  },
  {
    "word": "DULL-EYED",
    "definitions": ["Having eyes wanting brightness, liveliness, or vivacity. Shak."]
  },
  {
    "word": "EAR-BORED",
    "definitions": ["Having the ear perforated."]
  },
  {
    "word": "EVIL-EYED",
    "definitions": [
      "Possessed of the supposed evil eye; also, looking with envy, jealousy, or bad design; malicious. Shak."
    ]
  },
  {
    "word": "FENCI-BLE",
    "definitions": [
      "Capable of being defended, or of making or affording defense. [Obs.] No fort so fencible, nor walls so strong. Spenser."
    ]
  },
  {
    "word": "FENSI-BLE",
    "definitions": ["Fencible. [Obs.] Spenser."]
  },
  {
    "word": "FISH-TAIL",
    "definitions": [
      "Like the of a fish; acting, or producing something, like the tail of a fish. Fish-tail burner, a gas burner that gives a spreading flame shaped somewhat like the tail of a fish.  -- Fish-tail propeller (Steamship), a propeller with a single blade that oscillates like the tail of a fish when swimming."
    ]
  },
  {
    "word": "FOOL-BORN",
    "definitions": ["Begotten by a fool. Shak."]
  },
  {
    "word": "FOOT-SORE",
    "definitions": [
      "Having sore or tender feet, as by reason of much walking; as, foot-sore cattle."
    ]
  },
  {
    "word": "FREE-HAND",
    "definitions": [
      "Done by the hand, without support, or the guidance of instruments; as, free-hand drawing. See under Drawing."
    ]
  },
  {
    "word": "FREE-SOIL",
    "definitions": [
      "Pertaining to, or advocating, the non-extension of slavery; -- esp. applied to a party which was active during the period 1846-1856. [U.S.] -- Free\"soil`er, n. [U.S.] -- Free\"-soil`ism, n. [U.S.]"
    ]
  },
  {
    "word": "FRESH-NEW",
    "definitions": ["Unpracticed. [Obs.] Shak."]
  },
  {
    "word": "FROG-EYED",
    "definitions": [
      "Spotted with whitish specks due to a disease, or produced artificially by spraying; -- said of tobacco used for cigar wrappers."
    ]
  },
  {
    "word": "GILT-EDGE",
    "definitions": [
      "Having a gilt edge; as, gilt-edged paper.",
      "Of the best quality; -- said of negotiable paper, etc. [Slang, U. S.]"
    ]
  },
  {
    "word": "HALF-BRED",
    "definitions": [
      "Half-blooded. [Obs.]",
      "Imperfectly acquainted with the rules of good-breeding; not well trained. Atterbury."
    ]
  },
  {
    "word": "HALF-READ",
    "definitions": ["Informed by insufficient reading; superficial; shallow. Dryden."]
  },
  {
    "word": "HALF-TONE",
    "definitions": [
      "Having, consisting of, or pertaining to, half tones; specif. (Photo-engraving),",
      "pertaining to or designating plates, processes, or the pictures made by them, in which gradation of tone in the photograph is reproduced by a graduated system of dotted and checkered spots, usually nearly invisible to the unaided eye, produced by the interposition between the camera and the object of a screen. The name alludes to the fact that this process was the first that was practically successful in reproducing the half tones of the photograph."
    ]
  },
  {
    "word": "HAWK-EYED",
    "definitions": ["Having a keen eye; sharpsighted; discerning."]
  },
  {
    "word": "HIGH-BRED",
    "definitions": ["Bred in high life; of pure blood. Byron."]
  },
  {
    "word": "HOME-BRED",
    "definitions": [
      "Bred at home; domestic; not foreign. \" Home-bred mischief.\" Milton. Benignity and home-bred sense. Wordsworth.",
      "Not polished; rude; uncultivated. Only to me home-bred youths belong. Dryden."
    ]
  },
  {
    "word": "HOME-FELT",
    "definitions": ["Felt in one's own breast; inward; private. \"Home-felt quiet. Pope."]
  },
  {
    "word": "HOT-SHORT",
    "definitions": ["More or less brittle when heated; as, hot-short iron."]
  },
  {
    "word": "ICE-BUILT",
    "definitions": ["Composed of ice.", "Loaded with ice. \"Ice-built mountains.\" Gray."]
  },
  {
    "word": "ILL-LIVED",
    "definitions": ["Leading a wicked life. [Obs.]"]
  },
  {
    "word": "ILL-TIMED",
    "definitions": ["Done, attempted, or said, at an unsuitable or unpropitious time."]
  },
  {
    "word": "IN AND IN",
    "definitions": [
      "Applied to breeding from a male and female of the same parentage. See under Breeding."
    ]
  },
  {
    "word": "INFRA-RED",
    "definitions": [
      "Lying outside the visible spectrum at its red end; -- said of rays less refrangible than the extreme red rays."
    ]
  },
  {
    "word": "IRON-GRAY",
    "definitions": [
      "Of a gray color, somewhat resembling that of iron freshly broken.  -- n.",
      "An iron-gray color; also, a horse of this color."
    ]
  },
  {
    "word": "IRON-SICK",
    "definitions": [
      "Having the ironwork loose or corroded; -- said of a ship when her bolts and nails are so eaten with rust that she has become leaky."
    ]
  },
  {
    "word": "JET-BLACK",
    "definitions": ["Black as jet; deep black."]
  },
  {
    "word": "KNEE-DEEP",
    "definitions": [
      "Rising to the knees; knee-high; as, water or snow knee-deep. Grass knee-deep within a month. Milton.",
      "Sunk to the knees; as, men knee-deep in water. Where knee-deep the trees were standing. Longfellow."
    ]
  },
  {
    "word": "KNEE-HIGH",
    "definitions": ["Rising or reaching upward to the knees; as, the water is knee- high."]
  },
  {
    "word": "KNOCK-OFF",
    "definitions": ["That knocks off; of or pertaining to knocking off."]
  },
  {
    "word": "KNOCK-OUT",
    "definitions": [
      "That knocks out; characterized by knocking out; as, a knock-out blow; a knock-out key for knocking out a drill from a collet."
    ]
  },
  {
    "word": "LAND-POOR",
    "definitions": ["Pecuniarily embarrassed through owning much unprofitable land. [Colloq.]"]
  },
  {
    "word": "LEFT-HAND",
    "definitions": [
      "Situated on the left; nearer the left hand than the right; as, the left-hand side; the left-hand road. Left-hand rope, rope laid up and twisted over from right to left, or against the sun; -- called also water-laid rope."
    ]
  },
  {
    "word": "LET-ALONE",
    "definitions": [
      "Letting alone. The let-alone principle, doctrine, or policy. (Polit. Econ.) See Laissez faire."
    ]
  },
  {
    "word": "LIFE-SIZE",
    "definitions": ["Of full size; of the natural size."]
  },
  {
    "word": "LOVE-SICK",
    "definitions": [
      "Languishing with love or amorous desire; as, a love-sick maid. To the dear mistress of my love-sick mind. Dryden.",
      "Originating in, or expressive of, languishing love. Where nightingales their love-sick ditty sing. Dryden."
    ]
  },
  {
    "word": "LOW-LIVED",
    "definitions": [
      "Characteristic of, or like, one bred in a low and vulgar condition of life; mean dishonorable; contemptible; as, low-lived dishonesty."
    ]
  },
  {
    "word": "LYNX-EYED",
    "definitions": ["Having acute sight."]
  },
  {
    "word": "MARCH-MAD",
    "definitions": ["Extremely rash; foolhardy. See under March, the month. Sir W. Scott."]
  },
  {
    "word": "MOLE-EYED",
    "definitions": ["Having eyes like those of the mole; having imperfect sight."]
  },
  {
    "word": "MOON-EYED",
    "definitions": ["Having eyes affected by the moon; moonblind; dim-eyed; purblind."]
  },
  {
    "word": "MOPE-EYED",
    "definitions": ["Shortsighted; purblind."]
  },
  {
    "word": "NEO-LATIN",
    "definitions": ["Applied to the Romance languages, as being mostly of Latin origin."]
  },
  {
    "word": "NOT-PATED",
    "definitions": ["Same as Nott-headed. [Obs.] Shak."]
  },
  {
    "word": "NUT-BROWN",
    "definitions": ["Brown as a nut long kept and dried. \"The spicy nutbrown ale.\" Milton."]
  },
  {
    "word": "ONE-HORSE",
    "definitions": [
      "Drawn by one horse; having but a single horse; as, a one-horse carriage.",
      "Second-rate; inferior; small. [Slang, U.S.]"
    ]
  },
  {
    "word": "ONE-SIDED",
    "definitions": [
      "Having one side only, or one side prominent; hence, limited to one side; partial; unjust; unfair; as, a one-sided view or statement. \"Unguarded and one-sided language.\" T. Arnold.",
      "Growing on one side of a stem; as, one-sided flowers.  -- One`-sid\"ed-ly, adv.  -- One`-sid\"ed*ness, n."
    ]
  },
  {
    "word": "OPEN-EYED",
    "definitions": ["With eyes widely open; watchful; vigilant. Shak."]
  },
  {
    "word": "OVER-BUSY",
    "definitions": ["Too busy; officious."]
  },
  {
    "word": "PIG-JAWED",
    "definitions": [
      "Having the upper jaw projecting beyond the lower, with the upper incisors in advance of the lower; -- said of dogs."
    ]
  },
  {
    "word": "PILE-WORN",
    "definitions": ["Having the pile worn off; threadbare."]
  },
  {
    "word": "PINE-CLAD",
    "definitions": ["Clad or crowned with pine trees; as, pine-clad hills."]
  },
  {
    "word": "PINK-EYED",
    "definitions": ["Having small eyes. Holland."]
  },
  {
    "word": "POLT-FOOT",
    "definitions": ["Having a distorted foot, or a clubfoot or clubfeet. B. Jonson."]
  },
  {
    "word": "PUG-FACED",
    "definitions": ["Having a face like a monkey or a pug; monkey-faced."]
  },
  {
    "word": "RED-SHORT",
    "definitions": [
      "Hot-short; brittle when red-hot; -- said of certain kinds of iron.  -- Red\"-short`ness, n."
    ]
  },
  {
    "word": "ROSE-PINK",
    "definitions": [
      "Having a pink color like that of the rose, or like the pigment called rose pink. See Rose pink, under Rose.",
      "Disposed to clothe everything with roseate hues; hence, sentimental. \"Rose-pink piety.\" C. Kingsley."
    ]
  },
  {
    "word": "ROUND-ARM",
    "definitions": [
      "Applied to the method delivering the ball in bowling, by swinging the arm horizontally. R. A. Proctor."
    ]
  },
  {
    "word": "SCOT-FREE",
    "definitions": [
      "Free from payment of scot; untaxed; hence, unhurt; clear; safe. Do as much for this purpose, and thou shalt pass scot-free. Sir W. Scott. Then young Hay escaped scot-free to Holland. A. Lang."
    ]
  },
  {
    "word": "SEA-BUILT",
    "definitions": ["Built at, in, or by the sea."]
  },
  {
    "word": "SEA-GREEN",
    "definitions": ["Of a beautiful bluish green color, like sea water on soundings."]
  },
  {
    "word": "SELF-BORN",
    "definitions": ["Born or produced by one's self."]
  },
  {
    "word": "SELF-MADE",
    "definitions": [
      "Made by one's self. Self-made man, a man who has risen from poverty or obscurity by means of his own talentss or energies."
    ]
  },
  {
    "word": "SELF-UNED",
    "definitions": ["One with itself; separate from others. [Obs.] Sylvester."]
  },
  {
    "word": "SHARP-CUT",
    "definitions": [
      "Cut sharply or definitely, or so as to make a clear, well- defined impression, as the lines of an engraved plate, and the like; clear-cut; hence, having great distinctness; well-defined; clear."
    ]
  },
  {
    "word": "SHARP-SET",
    "definitions": [
      "Eager in appetite or desire of gratification; affected by keen hunger; ravenous; as, an eagle or a lion sharp-set. The town is sharp-set on new plays. Pope."
    ]
  },
  {
    "word": "SHOT-FREE",
    "definitions": ["Not to be injured by shot; shot-proof. [Obs.] Feltham."]
  },
  {
    "word": "SHOT-FREE",
    "definitions": ["Free from charge or expense; hence, unpunished; scot-free. [Obs.] Shak."]
  },
  {
    "word": "SIGH-BORN",
    "definitions": ["Sorrowful; mournful. [R.] \"Sigh-born thoughts.\" De Quincey."]
  },
  {
    "word": "SKIN-DEEP",
    "definitions": ["Not deeper than the skin; hence, superficial. Lowell."]
  },
  {
    "word": "SLUG-HORN",
    "definitions": ["An erroneous form of the Scotch word slughorne, or sloggorne, meaning slogan."]
  },
  {
    "word": "SNIP-SNAP",
    "definitions": ["Quick; short; sharp; smart. Shak."]
  },
  {
    "word": "SO-CALLED",
    "definitions": [
      "So named; called by such a name (but perhaps called thus with doubtful propriety)."
    ]
  },
  {
    "word": "SPAR-HUNG",
    "definitions": ["Hung with spar, as a cave."]
  },
  {
    "word": "STANNOSO-",
    "definitions": [
      "A combining form (also used adjectively) denoting relation to, or connection with, certain stannnous compounds."
    ]
  },
  {
    "word": "STEP-DOWN",
    "definitions": [
      "Transforming or converting a current of high potential or pressure into one of low pressure; as, a step-down transformer."
    ]
  },
  {
    "word": "STOP-OVER",
    "definitions": [
      "Permitting one to stop over; as, a stop-over check or ticket. See To stop over, under Stop, v. i. [Railroad Cant, U.S.]"
    ]
  },
  {
    "word": "SUN-DRIED",
    "definitions": ["Dried by the heat of the sun. \"Sun-dried brick.\" Sir T. Herbert."]
  },
  {
    "word": "THREE-PLY",
    "definitions": [
      "Consisting of three distinct webs inwrought together in weaving, as cloth or carpeting; having three strands; threefold."
    ]
  },
  {
    "word": "THREE-WAY",
    "definitions": [
      "Connected with, or serving to connect, three channels or pipes; as, a three-way cock or valve."
    ]
  },
  {
    "word": "TIDE-RODE",
    "definitions": ["Swung by the tide when at anchor; -- opposed to wind-rode."]
  },
  {
    "word": "TOP-HEAVY",
    "definitions": ["Having the top or upper part too heavy for the lower part. Sir H. Wotton."]
  },
  {
    "word": "TOP-PROUD",
    "definitions": ["Proud to the highest degree. [R.] \"This top-proud fellow.\" Shak."]
  },
  {
    "word": "TRUE-BLUE",
    "definitions": [
      "Of inflexible honesty and fidelity; -- a term derived from the true, or Coventry, blue, formerly celebrated for its unchanging color. See True blue, under Blue."
    ]
  },
  {
    "word": "TRUE-BORN",
    "definitions": [
      "Of genuine birth; having a right by birth to any title; as, a true-born Englishman."
    ]
  },
  {
    "word": "TRUE-BRED",
    "definitions": [
      "Of a genuine or right breed; as, a true-bred beast. Shak.",
      "Being of real breeding or education; as, a true-bred gentleman."
    ]
  },
  {
    "word": "TUN-GREAT",
    "definitions": ["Having the circumference of a tun. [Obs.] Chaucer."]
  },
  {
    "word": "TURN-SICK",
    "definitions": ["Giddy. [Obs.] Bacon."]
  },
  {
    "word": "TWO-CLEFT",
    "definitions": ["Divided about half way from the border to the base into two segments; bifid."]
  },
  {
    "word": "TWO-EDGED",
    "definitions": ["Having two edges, or edges on both sides; as, a two-edged sword."]
  },
  {
    "word": "TWO-PHASE",
    "definitions": ["Same as Diphase, Diphaser."]
  },
  {
    "word": "TWO-SIDED",
    "definitions": ["Having two sides only; hence, double-faced; hypocritical.", "Symmetrical."]
  },
  {
    "word": "TWO-SPEED",
    "definitions": [
      "Adapted for producing or for receiving either of two speeds; -- said of a power-transmitting device."
    ]
  },
  {
    "word": "TWO-THROW",
    "definitions": [
      "Capable of being thrown or cranked in two directions, usually opposite to one another; as, a two-throw crank; a two-throw switch.",
      "Having two crank set near together and opposite to one another; as, a two-throw crank shaft."
    ]
  },
  {
    "word": "UNDER-AGE",
    "definitions": [
      "Not having arrived at adult age, or at years of discretion; hence, raw; green; immature; boyish; childish. [Obs.] I myself have loved a lady, and pursued her with a great deal of under-age protestation. J. Webster."
    ]
  },
  {
    "word": "UNDER-ARM",
    "definitions": [
      "Done (as bowling) with the arm not raised above the elbow, that is, not swung far out from the body; underhand. Cf. Over-arm and Round-Arm."
    ]
  },
  {
    "word": "UN-MOSAIC",
    "definitions": [
      "Not according to Moses; unlike Moses or his works. By this reckoning Moses should be most un Mosaic. Milton."
    ]
  },
  {
    "word": "VINE-CLAD",
    "definitions": ["Covered with vines."]
  },
  {
    "word": "WALL-EYED",
    "definitions": ["Having an eye of a very light gray or whitish color. Booth."]
  },
  {
    "word": "WAVE-WORN",
    "definitions": ["Worn by the waves. The shore that o'er his wave-worn basis bowed. Shak."]
  },
  {
    "word": "WAY-GOING",
    "definitions": [
      "Going away; departing; of or pertaining to one who goes away. Way-going crop (Law of Leases), a crop of grain to which tenants for years are sometimes entitled by custom; grain sown in the fall to be reaped at the next harvest; a crop which will not ripen until after the termination of the lease. Burrill."
    ]
  },
  {
    "word": "WELL-BORN",
    "definitions": ["Born of a noble or respect able family; not of mean birth."]
  },
  {
    "word": "WELL-BRED",
    "definitions": [
      "Having good breeding; refined in manners; polite; cultivated. I am as well-bred as the earl's granddaughter. Thackera"
    ]
  },
  {
    "word": "WELL-READ",
    "definitions": ["Of extensive reading; deeply versed; -- often followed by in."]
  },
  {
    "word": "WELL-SEEN",
    "definitions": [
      "Having seen much; hence, accomplished; experienced. [Obs.] Beau. & Fl. Well-seen in arms and proved in many a fight. Spenser."
    ]
  },
  {
    "word": "WELL-SPED",
    "definitions": ["Having good success."]
  },
  {
    "word": "WHITE-HOT",
    "definitions": ["White with heat; heated to whiteness, or incandescence."]
  },
  {
    "word": "WIND-RODE",
    "definitions": [
      "Caused to ride or drive by the wind in opposition to the course of the tide; -- said of a vessel lying at anchor, with wind and tide opposed to each other. Totten."
    ]
  },
  {
    "word": "WISE-LIKE",
    "definitions": [
      "Resembling that which is wise or sensible; judicious. The only wise-like thing I heard anybody say. Sir W. Scott."
    ]
  },
  {
    "word": "WOOL-DYED",
    "definitions": ["Dyed before being made into cloth, in distinction from piece- dyed; ingrain."]
  },
  {
    "word": "YOKE-TOED",
    "definitions": ["Having two toes in front and two behind, as the trogons and woodpeckers."]
  },
  {
    "word": "ALL-A-MORT",
    "definitions": ["See Alamort."]
  },
  {
    "word": "ARGUS-EYED",
    "definitions": ["Extremely observant; watchful; sharp-sighted."]
  },
  {
    "word": "AWAY-GOING",
    "definitions": [
      "Sown during the last years of a tenancy, but not ripe until after its expiration; -- said of crops. Wharton."
    ]
  },
  {
    "word": "AWE-STRUCK",
    "definitions": ["Struck with awe. Milton."]
  },
  {
    "word": "AWL-SHAPED",
    "definitions": ["Shaped like an awl.", "Subulate. See Subulate. Gray."]
  },
  {
    "word": "BALD-FACED",
    "definitions": ["Having a white face or a white mark on the face, as a stag."]
  },
  {
    "word": "BANK-SIDED",
    "definitions": ["Having sides inclining inwards, as a ship; -- opposed to wall- sided."]
  },
  {
    "word": "BAT'S-WING",
    "definitions": ["Shaped like a bat's wing; as, a bat's-wing burner."]
  },
  {
    "word": "BELL-FACED",
    "definitions": ["Having the striking surface convex; -- said of hammers."]
  },
  {
    "word": "BIG-WIGGED",
    "definitions": ["characterized by pomposity of manner. [Eng.]"]
  },
  {
    "word": "BIRD'S-EYE",
    "definitions": [
      "Seen from above, as if by a flying bird; embraced at a glance; hence, generalas, a bird's-eye view.",
      "Marked with spots resembling bird's eyes; as, bird's-eye diaper; bird's-eye maple."
    ]
  },
  {
    "word": "BLACK-EYED",
    "definitions": ["Having black eyes. Dryden."]
  },
  {
    "word": "BLEAR-EYED",
    "definitions": [
      "Having sore eyes; having the eyes dim with rheum; dim-sighted. The blear-eyed Crispin. Drant.",
      "Lacking in perception or penetration; short-sighted; as, a blear- eyed bigot."
    ]
  },
  {
    "word": "BLINK-EYED",
    "definitions": ["Habitually winking. Marlowe."]
  },
  {
    "word": "BOLD-FACED",
    "definitions": [
      "Somewhat impudent; lacking modesty; as, a bold-faced woman. I have seen enough to confute all the bold-faced atheists of this age. Bramhall.",
      "Having a conspicuous or heavy face."
    ]
  },
  {
    "word": "BOW-LEGGED",
    "definitions": ["Having crooked legs, esp. with the knees bent outward. Johnson."]
  },
  {
    "word": "CANKER-BIT",
    "definitions": ["Eaten out by canker, or as by canker. [Obs.]"]
  },
  {
    "word": "CARE-TUNED",
    "definitions": ["Weary; mournful.  Shak."]
  },
  {
    "word": "CAT-RIGGED",
    "definitions": ["Rigged like a catboat."]
  },
  {
    "word": "CHOCK-FULL",
    "definitions": ["Quite full; choke-full."]
  },
  {
    "word": "CHOKE-FULL",
    "definitions": ["Full to the brim; quite full; chock-full."]
  },
  {
    "word": "CHUB-FACED",
    "definitions": ["Having a plump, short face."]
  },
  {
    "word": "COAL-BLACK",
    "definitions": ["As black as coal; jet black; very black. Dryden."]
  },
  {
    "word": "COLD-SHORT",
    "definitions": ["Brittle when cold; as, cold-short iron."]
  },
  {
    "word": "CROP-EARED",
    "definitions": ["Having the ears cropped."]
  },
  {
    "word": "CROSS-EYED",
    "definitions": ["Affected with strabismus; squint-eyed; squinting."]
  },
  {
    "word": "DAG-TAILED",
    "definitions": [
      "Daggle-tailed; having the tail clogged with daglocks. \"Dag- tailed sheep.\" Bp. Hall."
    ]
  },
  {
    "word": "DEAR-LOVED",
    "definitions": ["Greatly beloved. Shak."]
  },
  {
    "word": "DOG-HEADED",
    "definitions": ["Having a head shaped like that of a dog; -- said of certain baboons."]
  },
  {
    "word": "DOG-LEGGED",
    "definitions": [
      "Noting a flight of stairs, consisting of two or more straight portions connected by a platform (landing) or platforms, and running in opposite directions without an intervening wellhole."
    ]
  },
  {
    "word": "DO-NOTHING",
    "definitions": ["Doing nothing; inactive; idle; lazy; as, a do-nothing policy."]
  },
  {
    "word": "DRY-FISTED",
    "definitions": ["Niggardly."]
  },
  {
    "word": "EAGLE-EYED",
    "definitions": ["Sharp-sighted as an eagle. \"Inwardly eagle-eyed.\" Howell."]
  },
  {
    "word": "EAR-MINDED",
    "definitions": [
      "Thinking chiefly or most readily through, or in terms related to, the sense of hearing; specif., thinking words as spoken, as a result of familiarity with speech or of mental peculiarity; -- opposed to eye-minded."
    ]
  },
  {
    "word": "EASY-GOING",
    "definitions": ["Moving easily; hence, mild-tempered; ease-loving; inactive."]
  },
  {
    "word": "EGG-SHAPED",
    "definitions": ["Resembling an egg in form; ovoid."]
  },
  {
    "word": "EWE-NECKED",
    "definitions": [
      "Having a neck like a ewe; -- said of horses in which the arch of the neck is deficent, being somewhat hollowed out. Youwatt."
    ]
  },
  {
    "word": "EYE-MINDED",
    "definitions": [
      "Having one's mental imagery prevailingly of the visual type; having one's thoughts and memories mainly in the form of visual images. -- Eye\"-mind`ed*ness, n."
    ]
  },
  {
    "word": "FANCY-FREE",
    "definitions": ["Free from the power of love. \"In maiden meditation, fancy- free.\" Shak."]
  },
  {
    "word": "FANCY-SICK",
    "definitions": ["Love-sick. Shak."]
  },
  {
    "word": "FAN-NERVED",
    "definitions": [
      "Having the nerves or veins arranged in a radiating manner; -- said of certain leaves, and of the winfs of some insects."
    ]
  },
  {
    "word": "FAN-TAILED",
    "definitions": ["Having an expanded, or fan-shaped, tail; as, the fan-tailed pigeon."]
  },
  {
    "word": "FAT-WITTED",
    "definitions": ["Dull; stupid. Shak."]
  },
  {
    "word": "FEN-SUCKED",
    "definitions": ["Sucked out of marches. \"Fen-sucked fogs.\" Shak."]
  },
  {
    "word": "FIN-FOOTED",
    "definitions": ["Having palmate feet.", "Having lobate toes, as the coot and grebe."]
  },
  {
    "word": "FIRST-HAND",
    "definitions": [
      "Obtained directly from the first or original source; hence, without the intervention of an agent. One sphere there is . . . where the apprehension of him is first-hand and direct; and that is the sphere of our own mind. J. Martineau."
    ]
  },
  {
    "word": "FIRST-RATE",
    "definitions": [
      "Of the highest excellence; preëminent in quality, size, or estimation. Our only first-rate body of contemporary poetry is the German. M. Arnold. Hermocrates . . . a man of first-rate ability. Jowett (Thucyd)."
    ]
  },
  {
    "word": "FLAP-EARED",
    "definitions": ["Having broad, loose, dependent ears. Shak."]
  },
  {
    "word": "FLEET-FOOT",
    "definitions": ["Swift of foot. Shak."]
  },
  {
    "word": "FLY-BITTEN",
    "definitions": ["Marked by, or as if by, the bite of flies. Shak."]
  },
  {
    "word": "FOOL-HAPPY",
    "definitions": ["Lucky, without judgment or contrivance. [Obs.] Spenser."]
  },
  {
    "word": "FOOL-HASTY",
    "definitions": ["Foolishly hasty. [R.]"]
  },
  {
    "word": "FOOL-LARGE",
    "definitions": ["Foolishly liberal. [Obs.] Chaucer."]
  },
  {
    "word": "FULL-BLOWN",
    "definitions": [
      "Fully expanded, as a blossom; as, a full-bloun rose. Denham.",
      "Fully distended with wind, as a sail. Dryden."
    ]
  },
  {
    "word": "FULL-GROWN",
    "definitions": ["Having reached the limits of growth; mature. \"Full-grown wings.\" Lowell."]
  },
  {
    "word": "FULL-ORBED",
    "definitions": ["Having the orb or disk complete or fully illuminated; like the full moon."]
  },
  {
    "word": "GOLD-BOUND",
    "definitions": ["Encompassed with gold."]
  },
  {
    "word": "GREEN-EYED",
    "definitions": [
      "Having green eyes.",
      "Seeing everything through a medium which discolors or distorts. \"Green-eyed jealousy.\" Shak."
    ]
  },
  {
    "word": "GUILT-SICK",
    "definitions": [
      "Made sick by consciousness of guilt. \"A guilt-sick conscience.\" Beau. c& El."
    ]
  },
  {
    "word": "HAG-RIDDEN",
    "definitions": ["Ridden by a hag or witch; hence, afflicted with nightmare. Beattie. Cheyne."]
  },
  {
    "word": "HAIR-BROWN",
    "definitions": [
      "Of a clear tint of brown, resembling brown human hair. It is composed of equal proportions of red and green."
    ]
  },
  {
    "word": "HALF-BREED",
    "definitions": ["Half-blooded."]
  },
  {
    "word": "HALF-FACED",
    "definitions": ["Showing only part of the face; wretched looking; meager. Shak."]
  },
  {
    "word": "HALF-HEARD",
    "definitions": [
      "Imperfectly or partly heard to the end. And leave half-heard the melancholy tale. Pope."
    ]
  },
  {
    "word": "HAND-TIGHT",
    "definitions": ["As tight as can be made by the hand. Totten."]
  },
  {
    "word": "HARD-SHELL",
    "definitions": ["Unyielding; insensible to argument; uncompromising; strict. [Collog., U.S.]"]
  },
  {
    "word": "HIGH-BLOWN",
    "definitions": ["Inflated, as with conceit."]
  },
  {
    "word": "HIGH-BUILT",
    "definitions": [
      "Of lofty structure; tall. \"High-built organs.\" Tennyson. The high-built elephant his castle rears. Creech."
    ]
  },
  {
    "word": "HIGH-FLOWN",
    "definitions": [
      "Elevated; proud. \"High-flown hopes.\" Denham.",
      "Turgid; extravagant; bombastic; inflated; as, high-flown language. M. Arnold."
    ]
  },
  {
    "word": "HIGH-PROOF",
    "definitions": [
      "Highly rectified; very strongly alcoholic; as, high-proof spirits.",
      "So as to stand any test. \"We are high-proof melancholy.\" Shak."
    ]
  },
  {
    "word": "HIGH-TONED",
    "definitions": [
      "High in tone or sound.",
      "Elevated; high-principled; honorable. In whose high-toned impartial mind Degrees of mortal rank and state Seem objects of indifferent weight. Sir W. Scott."
    ]
  },
  {
    "word": "HIP-ROOFED",
    "definitions": ["Having a hip roof."]
  },
  {
    "word": "HOME-BOUND",
    "definitions": ["Kept at home."]
  },
  {
    "word": "HOOK-NOSED",
    "definitions": ["Having a hooked or aquiline nose. Shak."]
  },
  {
    "word": "HOT-HEADED",
    "definitions": ["Fiery; violent; rash; hasty; impetuous; vehement. Macaulay."]
  },
  {
    "word": "HUNGER-BIT",
    "definitions": ["Pinched or weakened by hunger. [Obs.] Milton."]
  },
  {
    "word": "IDEO-MOTOR",
    "definitions": [
      "Applied to those actions, or muscular movements, which are automatic expressions of dominant ideas, rather than the result of distinct volitional efforts, as the act of expressing the thoughts in speech, or in writing, while the mind is occupied in the composition of the sentence. Carpenter."
    ]
  },
  {
    "word": "IDLE-PATED",
    "definitions": ["Idle-headed; stupid. [Obs.]"]
  },
  {
    "word": "ILL-BODING",
    "definitions": ["Boding evil; inauspicious; ill-omened. \"Ill-boding stars.\" Shak."]
  },
  {
    "word": "ILL-JUDGED",
    "definitions": ["Not well judged; unwise."]
  },
  {
    "word": "ILL-MINDED",
    "definitions": ["Ill-disposed. Byron."]
  },
  {
    "word": "ILL-OMENED",
    "definitions": ["Having unlucky omens; inauspicious. See Note under Ill, adv."]
  },
  {
    "word": "INDO-ARYAN",
    "definitions": [
      "Pert. to the Indo-Aryans, or designating, or of, the Aryan languages of India."
    ]
  },
  {
    "word": "IRON-CASED",
    "definitions": ["Cased or covered with iron, as a vessel; ironclad."]
  },
  {
    "word": "IRON-SIDED",
    "definitions": ["Having iron sides, or very firm sides."]
  },
  {
    "word": "JAW-FALLEN",
    "definitions": ["Dejected; chopfallen."]
  },
  {
    "word": "JUDGE-MADE",
    "definitions": [
      "Created by judges or judicial decision; -- applied esp. to law applied or established by the judicial interpretation of statutes so as extend or restrict their scope, as to meet new cases, to provide new or better remedies, etc., and often used opprobriously of acts of judicial interpretation considered as doing this."
    ]
  },
  {
    "word": "LAVE-EARED",
    "definitions": ["Having large, pendent ears. [Obs.] Bp. Hall."]
  },
  {
    "word": "LEAN-FACED",
    "definitions": [
      "Having a thin face.",
      "slender or narrow; -- said of type the letters of which have thin lines, or are unusually narrow in proportion to their height. W. Savage."
    ]
  },
  {
    "word": "LIFE-WEARY",
    "definitions": ["Weary of living. Shak."]
  },
  {
    "word": "LIGHT-FOOT",
    "definitions": [
      "Having a light, springy step; nimble in running or dancing; active; as, light-foot Iris. Tennyson."
    ]
  },
  {
    "word": "LONG-ARMED",
    "definitions": ["Having long arms; as, the long-armed ape or gibbon."]
  },
  {
    "word": "LONG-DRAWN",
    "definitions": [
      "Extended to a great length. The cicadæ hushed their long-drawn, ear-splitting strains. G. W. Cable."
    ]
  },
  {
    "word": "LONG-LIVED",
    "definitions": [
      "Having a long life; having constitutional peculiarities which make long life probable; lasting long; as, a long-lived tree; they are a longlived family; long-lived prejudices."
    ]
  },
  {
    "word": "LOW-CHURCH",
    "definitions": [
      "Not placing a high estimate on ecclesiastical organizations or forms; -- applied especially to Episcopalians, and opposed to high- church. See High Church, under High."
    ]
  },
  {
    "word": "LOWER-CASE",
    "definitions": [
      "Pertaining to, or kept in, the lower case; -- used to denote the small letters, in distinction from capitals and small capitals. See the Note under 1st Case, n., 3."
    ]
  },
  {
    "word": "LOW-MINDED",
    "definitions": [
      "Inclined in mind to low or unworthy things; showing a base mind. Low-minded and immoral. Macaulay. All old religious jealousies were condemned as low-minded infirmities. Bancroft."
    ]
  },
  {
    "word": "LOW-NECKED",
    "definitions": ["Cut low in the neck; decollete; -- said of a woman's dress."]
  },
  {
    "word": "LUNG-GROWN",
    "definitions": ["Having lungs that adhere to the pleura."]
  },
  {
    "word": "MAD-HEADED",
    "definitions": ["Wild; crack-brained."]
  },
  {
    "word": "MANY-SIDED",
    "definitions": [
      "Having many sides; -- said of figures. Hence, presenting many questions or subjects for consideration; as, a many-sided topic.",
      "Interested in, and having an aptitude for, many unlike pursuits or objects of attention; versatile.  -- Ma\"ny-sid`ed*ness, n."
    ]
  },
  {
    "word": "MOON-FACED",
    "definitions": ["Having a round, full face."]
  },
  {
    "word": "MOSS-GROWN",
    "definitions": ["Overgrown with moss."]
  },
  {
    "word": "MOUTH-MADE",
    "definitions": ["Spoken without sincerity; not heartfelt. \"Mouth-made vows.\" Shak."]
  },
  {
    "word": "MUM-CHANCE",
    "definitions": ["Silent and idle. [Colloq.] Boys can't sit mum-chance always. J. H. Ewing."]
  },
  {
    "word": "NET-VEINED",
    "definitions": [
      "Having veins, or nerves, reticulated or netted; as, a net- veined wing or leaf."
    ]
  },
  {
    "word": "NIGHT-EYED",
    "definitions": [
      "Capable of seeing at night; sharp-eyed. \"Your night-eyed Tiberius.\" B. Jonson."
    ]
  },
  {
    "word": "OAR-FOOTED",
    "definitions": ["Having feet adapted for swimming."]
  },
  {
    "word": "ON-LOOKING",
    "definitions": ["Looking on or forward."]
  },
  {
    "word": "PEARL-EYED",
    "definitions": ["Having a pearly speck in the eye; afflicted with the cataract."]
  },
  {
    "word": "PIG-HEADED",
    "definitions": [
      "Having a head like a pig; hence, figuratively: stupidity obstinate; perverse; stubborn. B. Jonson.  -- Pig\"-head`ed*ness, n."
    ]
  },
  {
    "word": "PIN-TAILED",
    "definitions": ["Having a tapered tail, with the middle feathers longest; -- said of birds."]
  },
  {
    "word": "PITCH-DARK",
    "definitions": ["Dark as a pitch; pitch-black."]
  },
  {
    "word": "PLAIN-LAID",
    "definitions": [
      "Consisting of strands twisted together in the ordinary way; as, a plain-laid rope. See Illust. of Cordage."
    ]
  },
  {
    "word": "PLOT-PROOF",
    "definitions": ["Secure against harm by plots. Shak."]
  },
  {
    "word": "PRINTA-BLE",
    "definitions": ["Worthy to be published. [R.]"]
  },
  {
    "word": "RAIN-TIGHT",
    "definitions": ["So tight as to exclude rain as, a rain-tight roof."]
  },
  {
    "word": "RAPID-FIRE",
    "definitions": [
      "In the United States navy, designating such a gun using fixed ammunition or metallic cartridge cases; -- distinguished from breech- loading (abbr. B. L.), applied to all guns loading with the charge in bags, and formerly from quick-fire. Rapid-fire guns in the navy also sometimes include automatic or semiautomatic rapid-fire guns; the former being automatic guns of not less than one inch caliber, firing a shell of not less than one pound weight, the explosion of each cartridge operating the mechanism for ejecting the empty shell, loading, and firing the next shot, the latter being guns that require one operation of the hand at each discharge, to load the gun. (2)",
      "In the United States army, designating such a gun, whether using fixed or separate ammunition, designed chiefly for use in coast batteries against torpedo vessels and the lightly armored batteries or other war vessels and for the protection of defensive mine fields; -- not distinguished from quick-fire. (3)",
      "In Great Britain and Europe used, rarely, as synonymous with quick-fire."
    ]
  },
  {
    "word": "RAT-TAILED",
    "definitions": [
      "Having a long, tapering tail like that of a rat. Rat-tailed larva (Zoöl.), the larva of a fly of the genus Eristalis. See Eristalis.  -- Rat-tailed serpent (Zoöl.), the fer-de-lance.  -- Rat-tailed shrew (Zoöl.), the musk shrew."
    ]
  },
  {
    "word": "READY-MADE",
    "definitions": [
      "Made already, or beforehand, in anticipation of need; not made to order; as, ready-made clothing; ready-made jokes."
    ]
  },
  {
    "word": "RED-LETTER",
    "definitions": [
      "Of or pertaining to a red letter; marked by red letters. Red- letter day, a day that is fortunate or auspicious; -- so called in allusion to the custom of marking holy days, or saints' days, in the old calendars with red letters."
    ]
  },
  {
    "word": "RED-TAILED",
    "definitions": [
      "Having a red tail. Red-tailed hawk (Zoöl.), a large North American hawk (Buteo borealis). When adult its tail is chestnut red. Called also hen hawck, and red-tailed buzzard."
    ]
  },
  {
    "word": "RIGHT-HAND",
    "definitions": [
      "Situated or being on the right; nearer the right hand than the left; as, the right-hand side, room, or road.",
      "Chiefly relied on; almost indispensable. Mr. Alexander Truncheon, who is their right-hand man in the troop. Addison. Right-hand rope, a rope which is laid up and twisted with the sun, that is, in the same direction as plain-laid rope. See Illust. of Cordage."
    ]
  },
  {
    "word": "ROSE-WATER",
    "definitions": [
      "Having the odor of rose water; hence, affectedly nice or delicate; sentimental. \"Rose-water philantropy.\" Carlyle."
    ]
  },
  {
    "word": "RUG-GOWNED",
    "definitions": ["Wearing a coarse gown or shaggy garment made of rug. Beau. & Fl."]
  },
  {
    "word": "RUG-HEADED",
    "definitions": ["Having shaggy hair; shock-headed. [Obs.] Those rough rug-headed kerns. Shak."]
  },
  {
    "word": "SALSO-ACID",
    "definitions": ["Having a taste compounded of saltness and acidity; both salt and acid. [R.]"]
  },
  {
    "word": "SALT-GREEN",
    "definitions": ["Sea-green in color. Shak."]
  },
  {
    "word": "SAND-BLIND",
    "definitions": ["Having defective sight; dim-sighted; purblind. Shak."]
  },
  {
    "word": "SEA-ISLAND",
    "definitions": [
      "Of or pertaining to certain islands along the coast of South Carolina and Georgia; as, sea-island cotton, a superior cotton of long fiber produced on those islands."
    ]
  },
  {
    "word": "SEAL-BROWN",
    "definitions": ["Of a rich dark brown color, like the fur of the fur seal after it is dyed."]
  },
  {
    "word": "SEA-WALLED",
    "definitions": ["Surrounded, bounded, or protected by the sea, as if by a wall. Shak."]
  },
  {
    "word": "SELF-MOVED",
    "definitions": ["Moved by inherent power., without the aid of external impulse."]
  },
  {
    "word": "SEMI-ARIAN",
    "definitions": ["Of or pertaining to Semi-Arianism."]
  },
  {
    "word": "SEMI-SAXON",
    "definitions": [
      "Half Saxon; -- specifically applied to the language intermediate between Saxon and English, belonging to the period 1150- 1250."
    ]
  },
  {
    "word": "SHOCK-HEAD",
    "definitions": ["Shock-headed. Tennyson."]
  },
  {
    "word": "SHOT-PROOF",
    "definitions": ["Impenetrable by shot."]
  },
  {
    "word": "SIDE-WHEEL",
    "definitions": [
      "Having a paddle wheel on each side; -- said of steam vessels; as, a side-wheel steamer."
    ]
  },
  {
    "word": "SIMON-PURE",
    "definitions": [
      "Genuine; true; real; authentic; -- a term alluding to the comedy character Simon Pure, who is impersonated by another and is obliged to prove himself to be the \"real Simon Pure.\""
    ]
  },
  {
    "word": "SKILL-LESS",
    "definitions": ["Wanting skill. Shak."]
  },
  {
    "word": "SLAB-SIDED",
    "definitions": ["Having flat sides; hence, tall, or long and lank. [Colloq. U. S.]"]
  },
  {
    "word": "SLATE-GRAY",
    "definitions": ["Of a dark gray, like slate."]
  },
  {
    "word": "SMALT-BLUE",
    "definitions": ["Deep blue, like smalt."]
  },
  {
    "word": "SMELL-LESS",
    "definitions": [
      "Destitute of smell; having no odor. Daisies smell-less, yet most quaint. Beau & Fl."
    ]
  },
  {
    "word": "SNAIL-LIKE",
    "definitions": ["Like or suiting a snail; as, snail-like progress."]
  },
  {
    "word": "SNOW-BLIND",
    "definitions": ["Affected with blindness by the brilliancy of snow.  -- Snow\"-blind`ness, n."]
  },
  {
    "word": "SNOW-BOUND",
    "definitions": ["Enveloped in, or confined by, snow. Whittier."]
  },
  {
    "word": "SNOW-WHITE",
    "definitions": ["White as snow; very white. \"Snow-white and rose-red\" Chaucer."]
  },
  {
    "word": "SNUB-NOSED",
    "definitions": [
      "Having a short, flat nose, slightly turned up; as, the snub- nosed eel. Snub-nosed cachalot (Zoöl.), the pygmy sperm whale."
    ]
  },
  {
    "word": "SOFT-SHELL",
    "definitions": [
      "Having a soft or fragile shell. Soft-shell clam (Zoöl.), the long clam. See Mya.  -- Soft-shelled crab. (Zoöl.) See the Note under Crab, 1.  -- Soft-shelled turtle. (Zoöl.) Same as Soft tortoise, under Soft."
    ]
  },
  {
    "word": "SOI-DISANT",
    "definitions": ["Calling himself; self-styled; pretended; would-be."]
  },
  {
    "word": "STALK-EYED",
    "definitions": [
      "Having the eyes raised on a stalk, or peduncle; -- opposed to sessile-eyed. Said especially of podophthalmous crustaceans. Stalked- eyed crustaceans. (Zoöl.) See Podophthalmia."
    ]
  },
  {
    "word": "STAR-BLIND",
    "definitions": ["Half blind."]
  },
  {
    "word": "STEEP-DOWN",
    "definitions": [
      "Deep and precipitous, having steep descent. [R.] Wash me in steep-down gulfs of liquid fire. Shak."
    ]
  },
  {
    "word": "STONE-COLD",
    "definitions": ["Cold as a stone. Stone-cold without, within burnt with love's flame. Fairfax."]
  },
  {
    "word": "STONE-DEAD",
    "definitions": ["As dead as a stone."]
  },
  {
    "word": "STONE-DEAF",
    "definitions": ["As deaf as a stone; completely deaf."]
  },
  {
    "word": "STORM-BEAT",
    "definitions": ["Beaten, injured, or impaired by storms. Spenser."]
  },
  {
    "word": "SULTAN-RED",
    "definitions": ["Having a deep red color."]
  },
  {
    "word": "SUN-STRUCK",
    "definitions": ["Overcome by, or affected with, sunstroke; as, sun-struck soldiers."]
  },
  {
    "word": "THREE-COAT",
    "definitions": [
      "Having or consisting of three coats; -- applied to plastering which consists of pricking-up, floating, and a finishing coat; or, as called in the United States, a scratch coat, browning, and finishing coat."
    ]
  },
  {
    "word": "THREE-MILE",
    "definitions": [
      "Of or pertaining to three miles; as, the three-mile limit, or the limit of the marine belt (the three-mile belt or zone) of three miles included in territorial waters (which see) of a state."
    ]
  },
  {
    "word": "THREE-PORT",
    "definitions": [
      "Having three ports; specif.: Designating a type of two-cycle internal-combustion engine in which the mixture enters the crank case through a port uncovered by the piston near the end of its stroke."
    ]
  },
  {
    "word": "THRUM-EYED",
    "definitions": [
      "Having the anthers raised above the stigma, and visible at the throat of the corolla, as in long-stamened primroses; -- the reverse of pin-eyed."
    ]
  },
  {
    "word": "TOP-SHAPED",
    "definitions": [
      "Having the shape of a top; (Bot.) cone-shaped, with the apex downward; turbinate."
    ]
  },
  {
    "word": "TUBE-NOSED",
    "definitions": [
      "Having the nostrils prolonged in the form of horny tubes along the sides of the beak; -- said of certain sea birds.",
      "Belonging to the Tubinares."
    ]
  },
  {
    "word": "TWO-FORKED",
    "definitions": ["Divided into two parts, somewhat after the manner of a fork; dichotomous."]
  },
  {
    "word": "TWO-HANDED",
    "definitions": [
      "Having two hands; -- often used as an epithet equivalent to large, stout, strong, or powerful. \"Two-handed sway.\" Milton.",
      "Used with both hands; as, a two-nanded sword. That two-handed engine [the sword]. Milton.",
      "Using either hand equally well; ambidextrous."
    ]
  },
  {
    "word": "TWO-LIPPED",
    "definitions": [
      "Having two lips.",
      "Divided in such a manner as to resemble the two lips when the mouth is more or less open; bilabiate."
    ]
  },
  {
    "word": "TWO-PARTED",
    "definitions": ["Divided from the border to the base into two distinct parts; bipartite."]
  },
  {
    "word": "TWO-PARTED",
    "definitions": ["Divided from the border to the base into two distinct parts; bipartite."]
  },
  {
    "word": "TWO-RANKED",
    "definitions": [
      "Alternately disposed on exactly opposite sides of the stem so as to from two ranks; distichous."
    ]
  },
  {
    "word": "TWO-TO-ONE",
    "definitions": [
      "Designating, or pert. to, a gear for reducing or increasing a velocity ratio two to one."
    ]
  },
  {
    "word": "UNHEARD-OF",
    "definitions": ["New; unprecedented; unparalleled. Swift."]
  },
  {
    "word": "UP-TO-DATE",
    "definitions": [
      "Extending to the present time; having style, manners, knowledge, or other qualities that are abreast of the times. \"A general up-to-date style of presentment.\"  Nature."
    ]
  },
  {
    "word": "URN-SHAPED",
    "definitions": ["Having the shape of an urn; as, the urn-shaped capsules of some mosses."]
  },
  {
    "word": "VICE-REGAL",
    "definitions": ["Of or pertaining to a viceroy or viceroyalty. Macaulay."]
  },
  {
    "word": "WALL-SIDED",
    "definitions": [
      "Having sides nearly perpendicular; -- said of certain vessels to distinguish them from those having flaring sides, or sides tumbling home (see under Tumble, v. i.)."
    ]
  },
  {
    "word": "WAR-BEATEN",
    "definitions": ["Warworn."]
  },
  {
    "word": "WATER-LAID",
    "definitions": [
      "Having a left-hand twist; -- said of cordage; as, a water-laid, or left-hand, rope."
    ]
  },
  {
    "word": "WEAK-KNEED",
    "definitions": ["Having weak knees; hence, easily yielding; wanting resolution. H. James."]
  },
  {
    "word": "WEB-FOOTED",
    "definitions": ["Having webbed feet; palmiped; as, a goose or a duck is a web- footed fowl."]
  },
  {
    "word": "WEL-BEGONE",
    "definitions": [
      "Surrounded with happiness or prosperity. [Obs.] Fair and rich and young and wel-begone. Chaucer."
    ]
  },
  {
    "word": "WELL-KNOWN",
    "definitions": [
      "Fully known; generally known or acknowledged. A church well known with a well-known rite. M. Arnold."
    ]
  },
  {
    "word": "WHEEL-WORN",
    "definitions": ["Worn by the action of wheels; as, a wheel-worn road."]
  },
  {
    "word": "WHEY-FACED",
    "definitions": [
      "Having a pale or white face, as from fright. \"Whey-faced cavaliers.\" Aytoun."
    ]
  },
  {
    "word": "WIDE-ANGLE",
    "definitions": [
      "Having or covering an angle wider than the ordinary; -- applied to certain lenses of relatively short focus. Lenses for ordinary purposes have an angle of 50º or less. Wide-angle lenses may cover as much as 100º and are useful for photographing at short range, but the pictures appear distorted."
    ]
  },
  {
    "word": "WIDE-AWAKE",
    "definitions": ["Fully awake; not Dickens."]
  },
  {
    "word": "WOE-BEGONE",
    "definitions": [
      "Beset or overwhelmed with woe; immersed in grief or sorrow; woeful. Chaucer. So woe-begone was he with pains of love. Fairfax."
    ]
  },
  {
    "word": "WOOD-BOUND",
    "definitions": ["Incumbered with tall, woody hedgerows."]
  },
  {
    "word": "WORLD-WIDE",
    "definitions": ["Extended throughout the world; as, world-wide fame. Tennyson."]
  },
  {
    "word": "WORM-EATEN",
    "definitions": [
      "Eaten, or eaten into, by a worm or by worms; as, worm-eaten timber. Concave as a covered goblet, or a worm-eaten nut. Shak.",
      "Worn-out; old; worthless. [R.] Sir W. Raleigh.  -- Worm\"-eat`en*ness, n. [R.] Dr. John Smith."
    ]
  },
  {
    "word": "ABLE-BODIED",
    "definitions": [
      "Having a sound, strong body; physically competent; robust. \"Able-bodied vagrant.\" Froude.  -- A`ble-bod\"ied*ness, n.."
    ]
  },
  {
    "word": "ABLE-MINDED",
    "definitions": ["Having much intellectual power.  -- A`ble-mind\"ed*ness, n."]
  },
  {
    "word": "ABOVE-CITED",
    "definitions": ["Cited before, in the preceding part of a book or writing."]
  },
  {
    "word": "AIR-SLACKED",
    "definitions": ["Slacked, or pulverized, by exposure to the air; as, air-slacked lime."]
  },
  {
    "word": "ANGLO-SAXON",
    "definitions": ["Of or pertaining to the Anglo-Saxons or their language."]
  },
  {
    "word": "APPLE-FACED",
    "definitions": ["Having a round, broad face, like an apple. \"Apple-faced children.\" Dickens."]
  },
  {
    "word": "ASH-COLORED",
    "definitions": ["Of the color of ashes; a whitish gray or brownish gray."]
  },
  {
    "word": "BASSET HORN",
    "definitions": [
      "An instrument blown with a reed, and resembling a clarinet, but of much greater compass, embracing nearly four octaves."
    ]
  },
  {
    "word": "BELL-SHAPED",
    "definitions": ["Having the shape of a widemouthed bell; campanulate."]
  },
  {
    "word": "BIG-BELLIED",
    "definitions": ["Having a great belly; as, a big-bellied man or flagon; advanced in pregnancy."]
  },
  {
    "word": "BIRD-WITTED",
    "definitions": [
      "Flighty; passing rapidly from one subject to another; not having the faculty of attention. Bacon."
    ]
  },
  {
    "word": "BLACK-FACED",
    "definitions": ["Having a black, dark, or gloomy face or aspect."]
  },
  {
    "word": "BLUE-VEINED",
    "definitions": ["Having blue veins or blue streaks."]
  },
  {
    "word": "BLUFF-BOWED",
    "definitions": ["Built with the stem nearly straight up and down."]
  },
  {
    "word": "BOAT-SHAPED",
    "definitions": ["See Cymbiform."]
  },
  {
    "word": "BREAST-DEEP",
    "definitions": [
      "Deep as from the breast to the feet; as high as the breast. See him breast-deep in earth, and famish him. Shak."
    ]
  },
  {
    "word": "BREAST-HIGH",
    "definitions": ["High as the breast."]
  },
  {
    "word": "BULL-NECKED",
    "definitions": ["Having a short and thick neck like that of a bull. Sir W. Scott."]
  },
  {
    "word": "CLOUD-BUILT",
    "definitions": [
      "Built of, or in, the clouds; airy; unsubstantial; imaginary. Cowper. So vanished my cloud-built palace. Goldsmith."
    ]
  },
  {
    "word": "CLUB-SHAPED",
    "definitions": ["Enlarged gradually at the end, as the antennæ of certain insects."]
  },
  {
    "word": "COCK-A-HOOP",
    "definitions": ["Boastful; defiant; exulting. Also used adverbially."]
  },
  {
    "word": "COLOR-BLIND",
    "definitions": ["Affected with color blindness. See Color blindness, under Color, n."]
  },
  {
    "word": "COMB-SHAPED",
    "definitions": ["Pectinate."]
  },
  {
    "word": "COOL-HEADED",
    "definitions": [
      "Having a temper not easily excited; free from passion.  -- Cool\"-head`ed*ness, n."
    ]
  },
  {
    "word": "CREAM-FACED",
    "definitions": [
      "White or pale, as the effect of fear, or as the natural complexion. Thou cream-faced loon. Shak."
    ]
  },
  {
    "word": "CREAM-WHITE",
    "definitions": ["As white as cream."]
  },
  {
    "word": "CROP-TAILED",
    "definitions": ["Having the tail cropped."]
  },
  {
    "word": "CROSS-ARMED",
    "definitions": ["With arms crossed."]
  },
  {
    "word": "DAGGLE-TAIL",
    "definitions": [
      "Having the lower ends of garments defiled by trailing in mire or filth; draggle-tailed."
    ]
  },
  {
    "word": "DEAD-STROKE",
    "definitions": [
      "Making a stroke without recoil; deadbeat. Dead-stroke hammer (Mach.), a power hammer having a spring interposed between the driving mechanism and the hammer head, or helve, to lessen the recoil of the hammer and reduce the shock upon the mechanism."
    ]
  },
  {
    "word": "DEAR-BOUGHT",
    "definitions": ["Bought at a high price; as, dear-bought experience."]
  },
  {
    "word": "DIM-SIGHTED",
    "definitions": ["Having dim sight; lacking perception.  -- Dim\"-sight`ed*ness, n."]
  },
  {
    "word": "DOG-HEARTED",
    "definitions": ["Inhuman; cruel. Shak."]
  },
  {
    "word": "DOUBLE-DYED",
    "definitions": [
      "Dyed twice; thoroughly or intensely colored; hence; firmly fixed in opinions or habits; as, a double-dyed villain."
    ]
  },
  {
    "word": "DOUBLE-EYED",
    "definitions": [
      "Having a deceitful look. [R.] \"Deceitful meanings is double- eyed.\" Spenser."
    ]
  },
  {
    "word": "DOUBLE-HUNG",
    "definitions": ["Having both sashes hung with weights and cords; -- said of a window."]
  },
  {
    "word": "DOUGH-BAKED",
    "definitions": [
      "Imperfectly baked; hence, not brought to perfection; unfinished; also, of weak or dull understanding. [Colloq.] Halliwell."
    ]
  },
  {
    "word": "DOUGH-FACED",
    "definitions": ["Easily molded; pliable."]
  },
  {
    "word": "DUCK-BILLED",
    "definitions": ["Having a bill like that of a duck.."]
  },
  {
    "word": "DUCK-LEGGED",
    "definitions": ["Having short legs, like a waddling duck; short-legged. Dryden."]
  },
  {
    "word": "DUCK'S-BILL",
    "definitions": [
      "Having the form of a duck's bill. Duck's-bill limpet (Zoöl.), a limpet of the genus Parmaphorus; -- so named from its shape."
    ]
  },
  {
    "word": "DULL-BROWED",
    "definitions": ["Having a gloomy look."]
  },
  {
    "word": "DULL-WITTED",
    "definitions": ["Stupid."]
  },
  {
    "word": "EVIL-MINDED",
    "definitions": [
      "Having evil dispositions or intentions; disposed to mischief or sin; malicious; malignant; wicked.  -- E\"vil-mind`ed*ness, n."
    ]
  },
  {
    "word": "EX-OFFICIAL",
    "definitions": ["Proceeding from office or authority."]
  },
  {
    "word": "FAIR-HAIRED",
    "definitions": ["Having fair or light-colored hair."]
  },
  {
    "word": "FAIR-MINDED",
    "definitions": ["Unprejudiced; just; judicial; honest.  -- Fair\"*mind`ed*ness, n."]
  },
  {
    "word": "FAIR-SPOKEN",
    "definitions": [
      "Using fair speech, or uttered with fairness; bland; civil; courteous; plausible. \"A marvelous fair-spoken man.\" Hooker."
    ]
  },
  {
    "word": "FALSE-FACED",
    "definitions": ["Hypocritical. Shak."]
  },
  {
    "word": "FALSE-HEART",
    "definitions": ["False-hearted. Shak."]
  },
  {
    "word": "FAST-HANDED",
    "definitions": ["Close-handed; close-fisted; covetous; avaricious. [Obs.] Bacon."]
  },
  {
    "word": "FAT-BRAINED",
    "definitions": ["Dull of apprehension."]
  },
  {
    "word": "FEAT-BODIED",
    "definitions": ["Having a feat or trim body. [Obs.] Beau. & Fl."]
  },
  {
    "word": "FIBER-FACED",
    "definitions": [
      "Having a visible fiber embodied in the surface of; -- applied esp. to a kind of paper for checks, drafts, etc."
    ]
  },
  {
    "word": "FIRE-FANGED",
    "definitions": [
      "Injured as by fire; burned; -- said of manure which has lost its goodness and acquired an ashy hue in consequence of heat generated by decomposition."
    ]
  },
  {
    "word": "FIRST-CLASS",
    "definitions": [
      "Of the best class; of the highest rank; in the first division; of the best quality; first-rate; as, a first-class telescope. First- class car or First-class railway carriage, any passenger car of the highest regular class, and intended for passengers who pay the highest regular rate; -- distinguished from a second-class car."
    ]
  },
  {
    "word": "FIVE-LEAFED",
    "definitions": ["Having five leaflets, as the Virginia creeper."]
  },
  {
    "word": "FLAT-FOOTED",
    "definitions": [
      "Having a flat foot, with little or no arch of the instep.",
      "Firm-footed; determined. [Slang, U.S.]"
    ]
  },
  {
    "word": "FLAT-HEADED",
    "definitions": ["Having a head with a flattened top; as, a flat-headed nail."]
  },
  {
    "word": "FLEA-BITTEN",
    "definitions": [
      "Bitten by a flea; as, a flea-bitten face.",
      "White, flecked with minute dots of bay or sorrel; -- said of the color of a horse."
    ]
  },
  {
    "word": "FORK-TAILED",
    "definitions": [
      "Having the outer tail feathers longer than the median ones; swallow-tailed; -- said of many birds. Fork-tailed flycatcher (Zoöl.), a tropical American flycatcher (Milvulus tyrannus).  -- Fork-tailed gull (Zoöl.), a gull of the genus Xema, of two species, esp. X. Sabinii of the Arctic Ocean.  -- Fork-tailed kite (Zoöl.), a graceful American kite (Elanoides forficatus); -- called also swallow-tailed kite."
    ]
  },
  {
    "word": "FOUL-SPOKEN",
    "definitions": ["Using profane, scurrilous, slanderous, or obscene language. Shak."]
  },
  {
    "word": "FOX-HUNTING",
    "definitions": ["Pertaining to or engaged in the hunting of foxes; fond of hunting foxes."]
  },
  {
    "word": "FREE-HANDED",
    "definitions": ["Open-handed; liberal."]
  },
  {
    "word": "FREE-MINDED",
    "definitions": ["Not perplexed; having a mind free from care. Bacon."]
  },
  {
    "word": "FREE-SPOKEN",
    "definitions": ["Accustomed to speak without reserve. Bacon.  -- Free\"-spo`ken-ness, n."]
  },
  {
    "word": "FRESH-WATER",
    "definitions": [
      "Of, pertaining to, or living in, water not salt; as, fresh-water geological deposits; a fresh-water fish; fresh-water mussels.",
      "Accustomed to sail on fresh water only; unskilled as a seaman; as, a fresh-water sailor.",
      "Unskilled; raw. [Colloq.] \"Fresh-water soldiers.\" Knolles."
    ]
  },
  {
    "word": "FULL-FORMED",
    "definitions": [
      "Full in form or shape; rounded out with flesh. The full-formed maids of Afric. Thomson."
    ]
  },
  {
    "word": "FULL-MANNED",
    "definitions": ["Completely furnished wiith men, as a ship."]
  },
  {
    "word": "FULL-SAILED",
    "definitions": [
      "Having all its sails set,; hence, without restriction or reservation. Massinger."
    ]
  },
  {
    "word": "FULL-WINGED",
    "definitions": [
      "Having large and strong or complete wings. Shak.",
      "Beady for flight; eager. [Archaic] Beau. & Fl."
    ]
  },
  {
    "word": "GAG-TOOTHED",
    "definitions": ["Having gagteeth. [Obs.]"]
  },
  {
    "word": "GAP-TOOTHED",
    "definitions": ["Having interstices between the teeth. Dryden."]
  },
  {
    "word": "GAT-TOOTHED",
    "definitions": ["Goat-toothed; having a lickerish tooth; lustful; wanton. [Obs.]"]
  },
  {
    "word": "GIDDY-PACED",
    "definitions": ["Moving irregularly; flighty; fickle. [R.] Shak."]
  },
  {
    "word": "GLASS-FACED",
    "definitions": [
      "Mirror-faced; reflecting the sentiments of another. [R.] \"The glass-faced flatterer.\" Shak."
    ]
  },
  {
    "word": "GOD-FEARING",
    "definitions": [
      "Having a reverential and loving feeling towards God; religious. A brave good-fearing man. Tennyson."
    ]
  },
  {
    "word": "GOGGLE-EYED",
    "definitions": ["Having prominent and distorted or rolling eyes. Ascham."]
  },
  {
    "word": "GOLD-BEATEN",
    "definitions": ["Gilded. [Obs.]"]
  },
  {
    "word": "GOODY-GOODY",
    "definitions": ["Mawkishly or weakly good; exhibiting goodness with silliness. [Colloq.]"]
  },
  {
    "word": "GOR-BELLIED",
    "definitions": ["Bog-bellied. [Obs.]"]
  },
  {
    "word": "GRAND-DUCAL",
    "definitions": ["Of or pertaining to a grand duke. H. James."]
  },
  {
    "word": "GRASS-GREEN",
    "definitions": ["Green with grass.", "Of the color of grass; clear and vivid green."]
  },
  {
    "word": "GRASS-GROWN",
    "definitions": ["Overgrown with grass; as, a grass-grown road."]
  },
  {
    "word": "GRECO-ROMAN",
    "definitions": [
      "Having characteristics that are partly Greek and partly Roman; as, Greco-Roman architecture."
    ]
  },
  {
    "word": "HALF-DECKED",
    "definitions": [
      "Partially decked. The half-decked craft . . . used by the latter Vikings. Elton."
    ]
  },
  {
    "word": "HALF-HOURLY",
    "definitions": ["Done or happening at intervals of half an hour."]
  },
  {
    "word": "HALF-LENGTH",
    "definitions": ["Of half the whole or ordinary length, as a picture."]
  },
  {
    "word": "HALF-WITTED",
    "definitions": ["Weak in intellect; silly."]
  },
  {
    "word": "HALF-YEARLY",
    "definitions": ["Two in a year; semiannual.  -- adv. Twice in a year; semiannually."]
  },
  {
    "word": "HAMMER-LESS",
    "definitions": [
      "Without a visible hammer; -- said of a gun having a cock or striker concealed from sight, and out of the way of an accidental touch."
    ]
  },
  {
    "word": "HAND-WINGED",
    "definitions": [
      "Having wings that are like hands in the structure and arrangement of their bones; -- said of bats. See Cheiroptera."
    ]
  },
  {
    "word": "HARD-FISTED",
    "definitions": [
      "Having hard or strong hands; as, a hard-fisted laborer.",
      "Close-fisted; covetous; niggardly. Bp. Hall."
    ]
  },
  {
    "word": "HARD-FOUGHT",
    "definitions": ["contested; as, a hard-fought battle."]
  },
  {
    "word": "HARD-HANDED",
    "definitions": [
      "Having hard hands, as a manual laborer. Hard-handed men that work in Athens here. Shak."
    ]
  },
  {
    "word": "HARD-HEADED",
    "definitions": ["Having sound judgment; sagacious; shrewd.  -- Hard\"-head`ed*ness, n."]
  },
  {
    "word": "HAWSER-LAID",
    "definitions": ["Made in the manner of a hawser. Cf. Cable-laid, and see Illust. of Cordage."]
  },
  {
    "word": "HEAD-LUGGED",
    "definitions": ["Lugged or dragged by the head. [R.] \"The head-lugged bear.\" Shak."]
  },
  {
    "word": "HEART-WHOLE",
    "definitions": [
      "Having the heart or affections free; not in love. Shak.",
      "With unbroken courage; undismayed.",
      "Of a single and sincere heart. If he keeps heart-whole towards his Master. Bunyan."
    ]
  },
  {
    "word": "HEAVY-ARMED",
    "definitions": ["Wearing heavy or complete armor; carrying heavy arms."]
  },
  {
    "word": "HEAVY-HADED",
    "definitions": ["Clumsy; awkward."]
  },
  {
    "word": "HEN-HEARTED",
    "definitions": ["Cowardly; timid; chicken-hearted. Udall."]
  },
  {
    "word": "HIGH-CHURCH",
    "definitions": [
      "Of or pertaining to, or favoring, the party called the High Church, or their doctrines or policy. See High Church, under High, a."
    ]
  },
  {
    "word": "HIGH-HANDED",
    "definitions": ["Overbearing; oppressive; arbitrary; violent; as, a high-handed act."]
  },
  {
    "word": "HIGH-MINDED",
    "definitions": [
      "Proud; arrogant. [Obs.] Be not high-minded, but fear. Rom. xi. 20.",
      "Having, or characterized by, honorable pride; of or pertaining to elevated principles and feelings; magnanimous; -- opposed to mean. High-minded, manly recognition of those truths. A. Norton."
    ]
  },
  {
    "word": "HIGH-PALMED",
    "definitions": ["Having high antlers; bearing full-grown antlers aloft."]
  },
  {
    "word": "HIGH-RAISED",
    "definitions": [
      "Elevated; raised aloft; upreared.",
      "Elated with great ideas or hopes. Milton."
    ]
  },
  {
    "word": "HIGH-SOULED",
    "definitions": ["Having a high or noble spirit; honorable. E. Everett."]
  },
  {
    "word": "HIGH-STRUNG",
    "definitions": ["Strung to a high pitch; spirited; sensitive; as, a high-strung horse."]
  },
  {
    "word": "HOITY-TOITY",
    "definitions": [
      "Thoughtless; giddy; flighty; also, haughty; patronizing; as, to be in hoity-toity spirits, or to assume hoity-toity airs; used also as an exclamation, denoting surprise or disapprobation, with some degree of contempt. Hoity-toity! What have I to do with dreams Congreve."
    ]
  },
  {
    "word": "HOME-DRIVEN",
    "definitions": ["Driven to the end, as a nail; driven close."]
  },
  {
    "word": "HONEY-SWEET",
    "definitions": ["Sweet as honey. Chaucer."]
  },
  {
    "word": "HOOK-BILLED",
    "definitions": ["Having a strongly curved bill."]
  },
  {
    "word": "HOT-BLOODED",
    "definitions": ["Having hot blood; excitable; high-spirited; irritable; ardent; passionate."]
  },
  {
    "word": "HOT-BRAINED",
    "definitions": ["Ardent in temper; violent; rash; impetuous; as, hot-brained youth. Dryden."]
  },
  {
    "word": "HOT-LIVERED",
    "definitions": ["Of an excitable or irritable temperament; irascible. Milton."]
  },
  {
    "word": "HOT-MOUTHED",
    "definitions": ["Headstrong. That hot-mouthed beast that bears against the curb. Dryden."]
  },
  {
    "word": "ICY-PEARLED",
    "definitions": ["Spangled with ice. Mounting up in icy-pearled car. Milton."]
  },
  {
    "word": "IDLE-HEADED",
    "definitions": [
      "Foolish; stupid. [Obs.] \"The superstitious idle-headed eld.\" Shak.",
      "Delirious; infatuated. [Obs.] L'Estrange."
    ]
  },
  {
    "word": "ILL-FAVORED",
    "definitions": [
      "Wanting beauty or attractiveness; deformed; ugly; ill-looking. Ill-favored and lean-fleshed. Gen. xli. 3. -- Ill`-fa\"vored*ly, adv.  -- Ill`-fa\"vored*ness, n."
    ]
  },
  {
    "word": "ILL-LOOKING",
    "definitions": ["Having a bad look; threatening; ugly. See Note under Ill, adv."]
  },
  {
    "word": "ILL-NATURED",
    "definitions": [
      "Of habitual bad temper; peevish; fractious; cross; crabbed; surly; as, an ill-natured person.",
      "Dictated by, or indicating, ill nature; spiteful. \"The ill-natured task refuse.\" Addison.",
      "Intractable; not yielding to culture. [R.] \"Ill-natured land.\" J. Philips.  -- Ill`-na\"tured*ly, adv.  -- Ill`-na\"tured*ness, n."
    ]
  },
  {
    "word": "ILL-STARRED",
    "definitions": ["Fated to be unfortunate; unlucky; as, an ill-starred man or day."]
  },
  {
    "word": "IRON-FISTED",
    "definitions": ["Closefisted; stingy; mean."]
  },
  {
    "word": "IVY-MANTLED",
    "definitions": ["Covered with ivy."]
  },
  {
    "word": "JANUS-FACED",
    "definitions": [
      "Double-faced; deceitful. Janus-faced lock, one having duplicate faces so as to go upon a right or a left hand door, the key entering on either side indifferently. Knight."
    ]
  },
  {
    "word": "JERRY-BUILT",
    "definitions": ["Built hastily and of bad materials; as, jerry-built houses. [Colloq. Eng.]"]
  },
  {
    "word": "JURY-RIGGED",
    "definitions": ["Rigged for temporary service. See Jury, a."]
  },
  {
    "word": "KIDNEY-FORM",
    "definitions": [
      "Having the form or shape of a kidney; reniform; as, a kidney- shaped leaf. Gray."
    ]
  },
  {
    "word": "KNACK-KNEED",
    "definitions": ["See Knock-kneed."]
  },
  {
    "word": "KNOCK-KNEED",
    "definitions": [
      "Having the legs bent inward so that the knees touch in walking. [Written also knack-kneed.]"
    ]
  },
  {
    "word": "LACE-WINGED",
    "definitions": ["Having thin, transparent, reticulated wings; as, the lace- winged flies."]
  },
  {
    "word": "LAP-JOINTED",
    "definitions": ["Having a lap joint, or lap joints, as many kinds of woodwork and metal work."]
  },
  {
    "word": "LARGE-ACRED",
    "definitions": ["Possessing much land."]
  },
  {
    "word": "LATH-SHAPED",
    "definitions": [
      "Having a slender elongated form, like a lath; -- said of the feldspar of certain igneous rocks, as diabase, as seen in microscopic sections."
    ]
  },
  {
    "word": "LAW-ABIDING",
    "definitions": [
      "Abiding the law; waiting for the operation of law for the enforcement of rights; also, abiding by the law; obedient to the law; as, law-abiding people."
    ]
  },
  {
    "word": "LEAF-FOOTED",
    "definitions": [
      "Having leaflike expansions on the legs; -- said of certain insects; as, the leaf-footed bug (Leptoglossus phyllopus)."
    ]
  },
  {
    "word": "LEAN-WITTED",
    "definitions": ["Having but little sense or shrewdness."]
  },
  {
    "word": "LEFT-HANDED",
    "definitions": [
      "Having the left hand or arm stronger and more dexterous than the right; using the left hand and arm with more dexterity than the right.",
      "Clumsy; awkward; unlucky; insincere; sinister; malicious; as, a left-handed compliment. The commendations of this people are not always left-handed and detractive. Landor.",
      "Having a direction contrary to that of the hands of a watch when seen in front; -- said of a twist, a rotary motion, etc., looked at from a given direction. Left-handed marriage, a morganatic marriage. See Morganatic.  -- Left-handed screw, a screw constructed to advance away from the observer, when turned, as in a nut, with a left-handed rotation. An ordinary wood screw is right-handed."
    ]
  },
  {
    "word": "LIFE-GIVING",
    "definitions": ["Giving life or spirit; having power to give life; inspiriting; invigorating."]
  },
  {
    "word": "LIFE-SAVING",
    "definitions": [
      "That saves life, or is suited to save life, esp. from drowning; as, the life-saving service; a life-saving station."
    ]
  },
  {
    "word": "LIGHT-ARMED",
    "definitions": ["Armed with light weapons or accouterments."]
  },
  {
    "word": "LIKE-MINDED",
    "definitions": ["Having a like disposition or purpose; of the same mind. Tillotson."]
  },
  {
    "word": "LILY-HANDED",
    "definitions": ["Having white, delicate hands."]
  },
  {
    "word": "LIVER-GROWN",
    "definitions": ["Having an enlarged liver. Dunglison."]
  },
  {
    "word": "LOBE-FOOTED",
    "definitions": ["Lobiped."]
  },
  {
    "word": "LONG-HORNED",
    "definitions": [
      "Having a long horn or horns; as, a long-horned goat, or cow; having long antennæ, as certain beetles (Longicornia)."
    ]
  },
  {
    "word": "LONG-WINDED",
    "definitions": [
      "Long-breathed; hence, tediously long in speaking; consuming much time; as, a long-winded talker.  -- Long\"-wind\"ed*ness, n. A tedious, long-winded harangue. South."
    ]
  },
  {
    "word": "LOUD-VOICED",
    "definitions": ["Having a loud voice; noisy; clamorous. Byron."]
  },
  {
    "word": "LOW-STUDDED",
    "definitions": ["Furnished or built with short studs; as, a low-studded house or room."]
  },
  {
    "word": "LUTE-BACKED",
    "definitions": ["Having a curved spine."]
  },
  {
    "word": "MANY-MINDED",
    "definitions": ["Having many faculties; versatile; many-sided."]
  },
  {
    "word": "MIDDLE-AGED",
    "definitions": [
      "Being about the middle of the ordinary age of man; between 30 and 50 years old."
    ]
  },
  {
    "word": "NAIL-HEADED",
    "definitions": [
      "Having a head like that of a nail; formed so as to resemble the head of a nail. Nail-headed characters, arrowheaded or cuneiform characters. See under Arrowheaded.  -- Nail-headed molding (Arch.), an ornament consisting of a series of low four-sided pyramids resembling the heads of large nails; -- called also nail-head molding, or nail-head. It is the same as the simplest form of dogtooth. See Dogtooth."
    ]
  },
  {
    "word": "NAMBY-PAMBY",
    "definitions": [
      "Affectedly pretty; weakly sentimental; finical; insipid. Thackeray. Namby-pamby madrigals of love. W. Gifford."
    ]
  },
  {
    "word": "NEAR-LEGGED",
    "definitions": ["Having the feet so near together that they interfere in traveling. Shak."]
  },
  {
    "word": "NEO-HEBRAIC",
    "definitions": [
      "Of, pert. to, or designating, modern Hebrew, or Hebrew of later date than the Biblical."
    ]
  },
  {
    "word": "NEO-KANTIAN",
    "definitions": ["Of or pertaining to Neo-Kantianism."]
  },
  {
    "word": "NOTT-HEADED",
    "definitions": ["Having the hair cut close. [Obs.] Chapman."]
  },
  {
    "word": "OLD-MAIDISH",
    "definitions": ["Like an old maid; prim; precise; particular."]
  },
  {
    "word": "OPEN-HANDED",
    "definitions": ["Generous; liberal; munificent.  -- O\"pen-hand`ed*ness, n. J. S. Mill."]
  },
  {
    "word": "OPEN-HEADED",
    "definitions": ["Bareheaded. [Obs.]"]
  },
  {
    "word": "OUT-OF-DOOR",
    "definitions": [
      "Being out of the house; being, or done, in the open air; outdoor; as, out-of-door exercise. See Out of door, under Out, adv. Amongst out-of-door delights. G. Eliot."
    ]
  },
  {
    "word": "PEAR-SHAPED",
    "definitions": ["Of the form of a pear."]
  },
  {
    "word": "PITCH-BLACK",
    "definitions": ["Black as pitch or tar."]
  },
  {
    "word": "PITCH-FACED",
    "definitions": [
      "Having the arris defined by a line beyond which the rock is cut away, so as to give nearly true edges; -- said of squared stones that are otherwise quarry-faced."
    ]
  },
  {
    "word": "PLACE-PROUD",
    "definitions": ["Proud of rank or office. Beau. & Fl."]
  },
  {
    "word": "POCK-BROKEN",
    "definitions": ["Broken out, or marked, with smallpox; pock-fretten."]
  },
  {
    "word": "POCK-PITTED",
    "definitions": ["Pockmarked; pitted."]
  },
  {
    "word": "POINT-BLANK",
    "definitions": [
      "Directed in a line toward the object aimed at; aimed directly toward the mark.",
      "Hence, direct; plain; unqualified; -- said of language; as, a point-blank assertion. Point-blank range, the extent of the apparent right line of a ball discharged.  -- Point-blank shot, the shot of a gun pointed directly toward the object to be hit."
    ]
  },
  {
    "word": "POST-MORTEM",
    "definitions": [
      "After death; as, post-mortem rigidity. Post-mortem examination (Med.), an examination of the body made after the death of the patient; an autopsy."
    ]
  },
  {
    "word": "POT-BELLIED",
    "definitions": ["Having a protuberant belly, like the bottom of a pot."]
  },
  {
    "word": "POT-VALIANT",
    "definitions": ["Having the courage given by drink. Smollett."]
  },
  {
    "word": "PRICK-EARED",
    "definitions": [
      "Having erect, pointed ears; -- said of certain dogs. Thou prick-eared cur of Iceland. Shak."
    ]
  },
  {
    "word": "PROOF-PROOF",
    "definitions": [
      "Proof against proofs; obstinate in the wrong. \"That might have shown to any one who was not proof-proof.\" Whateley."
    ]
  },
  {
    "word": "PROTO-DORIC",
    "definitions": [
      "Pertaining to, or designating, architecture, in which the beginnings of the Doric style are supposed to be found."
    ]
  },
  {
    "word": "PUFF-LEGGED",
    "definitions": ["Having a conspicuous tuft of feathers on the legs."]
  },
  {
    "word": "PURSE-PROUD",
    "definitions": ["Affected with purse pride; puffed up with the possession of riches."]
  },
  {
    "word": "PUTTY-FACED",
    "definitions": ["White-faced; -- used contemptuously. Clarke."]
  },
  {
    "word": "RE-CREATIVE",
    "definitions": ["Creating anew; as, re-creative power."]
  },
  {
    "word": "RIGHT-LINED",
    "definitions": ["Formed by right lines; rectilineal; as, a right-lined angle."]
  },
  {
    "word": "RING-NECKED",
    "definitions": [
      "Having a well defined ring of color around the neck. Ring- necked duck (Zool.), an American scaup duck (Aythya collaris). The head, neck, and breast of the adult male are black, and a narrow, but conspicuous, red ring encircles the neck. This ring is absent in the female. Called also ring-neck, ring-necked blackhead, ringbill, tufted duck, and black jack."
    ]
  },
  {
    "word": "RING-TAILED",
    "definitions": [
      "Having the tail crossed by conspicuous bands of color. Ring- tailed cat (Zoöl.), the cacomixle.  -- Ring-tailed eagle (Zoöl.), a young golden eagle."
    ]
  },
  {
    "word": "RUBY-TAILED",
    "definitions": ["Having the tail, or lower part of the body, bright red."]
  },
  {
    "word": "SACK-WINGED",
    "definitions": [
      "Having a peculiar pouch developed near the front edge of the wing; -- said of certain bats of the genus Saccopteryx."
    ]
  },
  {
    "word": "SAW-TOOTHED",
    "definitions": ["Having a tooth or teeth like those of a saw; serrate."]
  },
  {
    "word": "SECOND-RATE",
    "definitions": [
      "Of the second size, rank, quality, or value; as, a second-rate ship; second-rate cloth; a second-rate champion. Dryden."
    ]
  },
  {
    "word": "SELF-ABASED",
    "definitions": ["Humbled by consciousness of inferiority, unworthiness, guilt, or shame."]
  },
  {
    "word": "SELF-ACTING",
    "definitions": [
      "Acting of or by one's self or by itself; -- said especially of a machine or mechanism which is made to perform of or for itself what is usually done by human agency; automatic; as, a self-acting feed apparatus; a self-acting mule; a self-acting press."
    ]
  },
  {
    "word": "SELF-ACTIVE",
    "definitions": ["Acting of one's self or of itself; acting without depending on other agents."]
  },
  {
    "word": "SELF-MOVING",
    "definitions": ["Moving by inherent power, without the aid of external impulse."]
  },
  {
    "word": "SELF-MURDER",
    "definitions": ["Suicide."]
  },
  {
    "word": "SELF-TAUGHT",
    "definitions": ["Taught by one's own efforts."]
  },
  {
    "word": "SELF-WILLED",
    "definitions": ["Governed by one's own will; not yielding to the wishes of others; obstinate."]
  },
  {
    "word": "SEMI-DIESEL",
    "definitions": [
      "Designating an internal-combustion engine of a type resembling the Diesel engine in using as fuel heavy oil which is injected in a spray just before the end of the compression stroke and is fired without electrical ignition. The fuel is sprayed into an iron box (called a hot bulb or hot pot) opening into the combustion chamber, and heated for ignition by a blast-lamp until the engine is running, when it is, ordinarily, kept red hot by the heat of combustion."
    ]
  },
  {
    "word": "SERIO-COMIC",
    "definitions": ["Having a mixture of seriousness and sport; serious and comical."]
  },
  {
    "word": "SHAG-HAIRED",
    "definitions": ["Having shaggy hair. Shak."]
  },
  {
    "word": "SHARD-BORNE",
    "definitions": ["Borne on shards or scaly wing cases. \"The shard-borne beetle.\" Shak."]
  },
  {
    "word": "SHEEP-FACED",
    "definitions": ["Over-bashful; sheepish."]
  },
  {
    "word": "SHIP-RIGGED",
    "definitions": ["Rigged like a ship, that is, having three masts, each with square sails."]
  },
  {
    "word": "SHORT-DATED",
    "definitions": ["Having little time to run from the date. \"Thy short-dated life.\" Sandys."]
  },
  {
    "word": "SHORT-LIVED",
    "definitions": [
      "Not living or lasting long; being of short continuance; as, a short-lived race of beings; short-lived pleasure; short-lived passion."
    ]
  },
  {
    "word": "SHORT-WITED",
    "definitions": ["Having little wit; not wise; having scanty intellect or judgment."]
  },
  {
    "word": "SHROUD-LAID",
    "definitions": [
      "Composed of four strands, and laid right-handed with a heart, or center; -- said of rope. See Illust. under Cordage."
    ]
  },
  {
    "word": "SILVER-GRAY",
    "definitions": ["Having a gray color with a silvery luster; as, silver-gray hair."]
  },
  {
    "word": "SLOW-WITTED",
    "definitions": ["Dull of apprehension; not possessing quick intelligence."]
  },
  {
    "word": "SMOCK-FACED",
    "definitions": ["Having a feminine countenance or complexion; smooth-faced; girlish. Fenton."]
  },
  {
    "word": "SNAIL-PACED",
    "definitions": [
      "Slow-moving, like a snail. Bid the snail-paced Ajax arm for shame. Shak.",
      "God's nails, or His nails, that is, the nails with which the Savior was fastened to the cross; -- an ancient form of oath, corresponding to 'Od's bodikins (dim. of body, i.e., God's dear body). Beau & Fl."
    ]
  },
  {
    "word": "SNOW-CAPPED",
    "definitions": ["Having the top capped or covered with snow; as, snow-capped mountains."]
  },
  {
    "word": "SOFT-FINNED",
    "definitions": [
      "Having the fin rays cartilaginous or flexible; without spines; -- said of certain fishes."
    ]
  },
  {
    "word": "SOFT-HEADED",
    "definitions": ["Weak in intellect."]
  },
  {
    "word": "SOFT-SPOKEN",
    "definitions": ["Speaking softly; having a mild or gentle voice; hence, mild; affable."]
  },
  {
    "word": "SOLID-DRAWN",
    "definitions": [
      "Drawn out from a heated solid bar, as by a process of spiral rolling which first hollows the bar and then expands the cavity by forcing the bar over a pointed mandrel fixed in front of the rolls; - - said of a weldless tube."
    ]
  },
  {
    "word": "SPUR-WINGED",
    "definitions": [
      "Having one or more spurs on the bend of the wings. Spur-winged goose (Zoöl.), any one of several species of long-legged African geese of the genus Plectropterus and allied genera, having a strong spur on the bend of the wing, as the Gambo goose (P. Gambensis) and the Egyptian, or Nile, goose (Alopochen Ægyptiaca).  -- Spur-winged plover (Zoöl.), an Old World plover (Hoplopterus spinosus) having a sharp spur on the bend of the wing. It inhabits Northern Africa and the adjacent parts of Asia and Europe."
    ]
  },
  {
    "word": "SQUINT-EYED",
    "definitions": [
      "Having eyes that quint; having eyes with axes not coincident; cross-eyed.",
      "Looking obliquely, or asquint; malignant; as, squint-eyed praise; squint-eyed jealousy."
    ]
  },
  {
    "word": "STAG-HORNED",
    "definitions": [
      "Having the mandibles large and palmate, or branched somewhat like the antlers of a stag; -- said of certain beetles."
    ]
  },
  {
    "word": "STERN-WHEEL",
    "definitions": ["Having a paddle wheel at the stern; as, a stern-wheel steamer."]
  },
  {
    "word": "STOCK-BLIND",
    "definitions": ["Blind as a stock; wholly blind."]
  },
  {
    "word": "STOCK-STILL",
    "definitions": [
      "Still as a stock, or fixed post; perfectly still. His whole work stands stock-still. Sterne."
    ]
  },
  {
    "word": "STONE-BLIND",
    "definitions": ["As blind as a stone; completely blind."]
  },
  {
    "word": "STONE-STILL",
    "definitions": ["As still as a stone. Shak."]
  },
  {
    "word": "SURE-FOOTED",
    "definitions": ["Not liable to stumble or fall; as, a sure-footed horse."]
  },
  {
    "word": "SWAY-BACKED",
    "definitions": [
      "Having the back hollow or sagged, whether naturally or as the result of injury or weakness; -- said of horses and other animals."
    ]
  },
  {
    "word": "SWIVEL-EYED",
    "definitions": ["Squint-eyed. [Prov. Eng.]"]
  },
  {
    "word": "TAILOR-MADE",
    "definitions": [
      "Made by a tailor or according to a tailor's fashion; -- said specif. of women's garments made with certain closeness of fit, simplicity of ornament, etc."
    ]
  },
  {
    "word": "TETE-A-TETE",
    "definitions": [
      "Private; confidential; familiar. She avoided tête-à-tête walks with him. C. Kingsley."
    ]
  },
  {
    "word": "THRALL-LESS",
    "definitions": ["Having no thralls.", "Not enslaved; not subject to bonds."]
  },
  {
    "word": "THRALL-LIKE",
    "definitions": [
      "Resembling a thrall, or his condition, feelings, or the like; slavish. Servile and thrall-like fear. Milton."
    ]
  },
  {
    "word": "THREE-COLOR",
    "definitions": [
      "Designating, or pert. to, a photomechanical process employing printings in three colors, as red, yellow, and blue."
    ]
  },
  {
    "word": "THREE-LOBED",
    "definitions": [
      "Having three lobes. Three-lobed leaf (Bot.), a leaf divided into three parts, the sinuses extending not more than half way to the middle, and either the parts of the sinuses being rounded."
    ]
  },
  {
    "word": "THREE-PILED",
    "definitions": [
      "Having the quality of three-pile; best; most costly. [R.] Thou art good velvet; thou 'rt three-piled piece. Shak.",
      "Fig.: Extravagant; exaggerated; high-flown. \"Three-piled hyperboles.\" Shak.",
      "Accustomed to wearing three-pile; hence, of high rank, or wealth. [Obs.] \"Three-piled people.\" Beau. & Fl."
    ]
  },
  {
    "word": "THREE-SCORE",
    "definitions": ["Thrice twenty; sixty."]
  },
  {
    "word": "THREE-SIDED",
    "definitions": [
      "Having three sides, especially three plane sides; as, a three- sided stem, leaf, petiole, peduncle, scape, or pericarp."
    ]
  },
  {
    "word": "TONGUE-TIED",
    "definitions": [
      "Destitute of the power of distinct articulation; having an impediment in the speech, esp. when caused by a short frænum.",
      "Unable to speak freely, from whatever cause. Love, therefore, and tongue-tied simplicity. Shak."
    ]
  },
  {
    "word": "TRAGI-COMIC",
    "definitions": [
      "Of or pertaining to tragi-comedy; partaking of grave and comic scenes.  -- Trag`-com\"ic*al*ly, adv. Julian felt toward him that tragi-comic sensation which makes us pity the object which excites it not the less that we are somewhat inclined to laugh amid our sympathy. Sir W. Scott."
    ]
  },
  {
    "word": "TULIP-EARED",
    "definitions": ["Having erect, pointed ears; prick-eared; -- said of certain dogs."]
  },
  {
    "word": "TUMBLE-DOWN",
    "definitions": ["Ready to fall; dilapidated; ruinous; as, a tumble-down house. [Colloq.]"]
  },
  {
    "word": "TUN-BELLIED",
    "definitions": ["Having a large, protuberant belly, or one shaped like a tun; pot-bellied."]
  },
  {
    "word": "TUT-MOUTHED",
    "definitions": ["Having a projecting under jaw; prognathous. [Obs.] Holland."]
  },
  {
    "word": "TWO-TONGUED",
    "definitions": ["Double-tongued; deceitful. Sandys."]
  },
  {
    "word": "UNHOPED-FOR",
    "definitions": ["Unhoped; unexpected."]
  },
  {
    "word": "URAL-ALTAIC",
    "definitions": [
      "Of or pertaining to the Urals and the Altai; as the Ural- Altaic, or Turanian, languages."
    ]
  },
  {
    "word": "VASE-SHAPED",
    "definitions": ["Formed like a vase, or like a common flowerpot."]
  },
  {
    "word": "WATER-BOUND",
    "definitions": ["Prevented by a flood from proceeding."]
  },
  {
    "word": "WATER-TIGHT",
    "definitions": ["So tight as to retain, or not to admit, water; not leaky."]
  },
  {
    "word": "WEAK-MINDED",
    "definitions": [
      "Having a weak mind, either naturally or by reason of disease; feebleminded; foolish; idiotic.  -- Weak\"-mind`ed*ness, n."
    ]
  },
  {
    "word": "WELL-LIKING",
    "definitions": [
      "Being in good condition. [Obs. or Archaic] They also shall bring forth more fruit in their age, and shall be fat and well-liking. Bk. of Com. Prayer (Ps. xcii.)."
    ]
  },
  {
    "word": "WELL-SPOKEN",
    "definitions": [
      "Speaking well; speaking with fitness or grace; speaking kindly. \"A knight well-spoken.\" Shak.",
      "Spoken with propriety; as, well-spoken words."
    ]
  },
  {
    "word": "WHIP-SHAPED",
    "definitions": [
      "Shaped like the lash of a whip; long, slender, round, and tapering; as, a whip-shaped root or stem."
    ]
  },
  {
    "word": "WHITE-LIMED",
    "definitions": ["Whitewashed or plastered with lime. \"White-limed walls.\" Shak."]
  },
  {
    "word": "WHITY-BROWN",
    "definitions": ["Of a color between white and brown. Pegge."]
  },
  {
    "word": "WIND-BROKEN",
    "definitions": [
      "Having the power of breathing impaired by the rupture, dilatation, or running together of air cells of the lungs, so that while the inspiration is by one effort, the expiration is by two; affected with pulmonary emphysema or with heaves; -- said of a horse. Youatt."
    ]
  },
  {
    "word": "WIND-SHAKEN",
    "definitions": [
      "Shaken by the wind; specif. (Forestry),",
      "affected by wind shake, or anemosis (which see, above)."
    ]
  },
  {
    "word": "WING-FOOTED",
    "definitions": [
      "Having wings attached to the feet; as, wing-footed Mercury; hence, swift; moving with rapidity; fleet. Drayton.",
      "Having part or all of the feet adapted for flying.",
      "Having the anterior lobes of the foot so modified as to form a pair of winglike swimming organs; -- said of the pteropod mollusks."
    ]
  },
  {
    "word": "WING-HANDED",
    "definitions": [
      "Having the anterior limbs or hands adapted for flight, as the bats and pterodactyls."
    ]
  },
  {
    "word": "WING-LEAVED",
    "definitions": ["Having pinnate or pinnately divided leaves."]
  },
  {
    "word": "WIRE-TAILED",
    "definitions": [
      "Having some or all of the tail quills terminated in a long, slender, pointed shaft, without a web or barbules."
    ]
  },
  {
    "word": "WISHY-WASHY",
    "definitions": [
      "Thin and pale; weak; without strength or substance; -- originally said of liquids. Fig., weak-minded; spiritless. A weak wishy-washy man who had hardly any mind of his own. A. Trollope."
    ]
  },
  {
    "word": "WIT-STARVED",
    "definitions": ["Barren of wit; destitute of genius. Examiner."]
  },
  {
    "word": "WIZEN-FACED",
    "definitions": ["Having a shriveled, thin, withered face."]
  },
  {
    "word": "WORKING-DAY",
    "definitions": [
      "Pertaining to, or characteristic of, working days, or workdays; everyday; hence, plodding; hard-working. O, how full of briers in this working-day world. Shak."
    ]
  },
  {
    "word": "WORM-SHAPED",
    "definitions": ["Shaped like a worm; as, a worm-shaped root."]
  },
  {
    "word": "WRONG-TIMED",
    "definitions": ["Done at an improper time; ill-timed."]
  },
  {
    "word": "YAWL-RIGGED",
    "definitions": [
      "Having two masts with fore-and-aft sails, but differing from a schooner in that the after mast is very small, and stepped as far aft as possible. See Illustration in Appendix."
    ]
  },
  {
    "word": "YELLOW-EYED",
    "definitions": ["Having yellow eyes. Yellow-eyed grass (Bot.), any plant of the genus Xyris."]
  },
  {
    "word": "ZINCO-POLAR",
    "definitions": [
      "Electrically polarized like the surface of the zinc presented to the acid in a battery, which has zincous affinity. [Obs.]"
    ]
  },
  {
    "word": "ACUTE-ANGLED",
    "definitions": [
      "Having acute angles; as, an acute-angled triangle, a triangle with every one of its angles less than a right angle."
    ]
  },
  {
    "word": "AFTER-WITTED",
    "definitions": ["Characterized by afterwit; slow-witted. Tyndale."]
  },
  {
    "word": "ALIKE-MINDED",
    "definitions": ["Like-minded. [Obs.]"]
  },
  {
    "word": "ARMOR-PLATED",
    "definitions": [
      "Covered with defensive plates of metal, as a ship of war; steel-clad. This day will be launched . . . the first armor-plated steam frigate in the possession of Great Britain. Times (Dec. 29, 1860)."
    ]
  },
  {
    "word": "AWE-STRICKEN",
    "definitions": ["Awe-struck."]
  },
  {
    "word": "BAKER-LEGGED",
    "definitions": ["Having legs that bend inward at the knees."]
  },
  {
    "word": "BANDY-LEGGED",
    "definitions": ["Having crooked legs."]
  },
  {
    "word": "BASAL-NERVED",
    "definitions": ["Having the nerves radiating from the base; -- said of leaves."]
  },
  {
    "word": "BELL-MOUTHED",
    "definitions": ["Expanding at the mouth; as, a bell-mouthed gun. Byron."]
  },
  {
    "word": "BLACK-BROWED",
    "definitions": [
      "Having black eyebrows. Hence: Gloomy; dismal; threatening; forbidding. Shak. Dryden."
    ]
  },
  {
    "word": "BLACK-LETTER",
    "definitions": [
      "Written or printed in black letter; as, a black-letter manuscript or book.",
      "Given to the study of books in black letter; that is, of old books; out of date. Kemble, a black-letter man! J. Boaden.",
      "Of or pertaining to the days in the calendar not marked with red letters as saints' days. Hence: Unlucky; inauspicious."
    ]
  },
  {
    "word": "BLUFF-HEADED",
    "definitions": ["Built with the stem nearly straight up and down."]
  },
  {
    "word": "BOOK-LEARNED",
    "definitions": [
      "Versed in books; having knowledge derived from books. [Often in a disparaging sense.] Whate'er these book-learned blockheads say, Solon's the veriest fool in all the play. Dryden."
    ]
  },
  {
    "word": "BOTTLE-NOSED",
    "definitions": ["Having the nose bottleshaped, or large at the end. Dickens."]
  },
  {
    "word": "BRAHMIN-ICAL",
    "definitions": ["Of or pertaining to the Brahmans or to their doctrines and worship."]
  },
  {
    "word": "BROAD-HORNED",
    "definitions": ["Having horns spreading widely."]
  },
  {
    "word": "BROAD-LEAVED",
    "definitions": ["Having broad, or relatively broad, leaves. Keats."]
  },
  {
    "word": "BULLET-PROOF",
    "definitions": [
      "Capable of resisting the force of a bullet. Bullet tree. See Bully tree.  -- Bullet wood, the wood of the bullet tree."
    ]
  },
  {
    "word": "BUNCH-BACKED",
    "definitions": ["Having a bunch on the back; crooked. \"Bunch-backed toad.\" Shak."]
  },
  {
    "word": "CLAY-BRAINED",
    "definitions": ["Stupid. [Obs.] Shak."]
  },
  {
    "word": "CLEAN-LIMBED",
    "definitions": [
      "With well-proportioned, unblemished limbs; as, a clean-limbed young fellow. Dickens."
    ]
  },
  {
    "word": "CLEAR-HEADED",
    "definitions": [
      "Having a clear understanding; quick of perception; intelligent. \"He was laborious and clear-headed.\" Macaulay.  -- Clear\"-head`ed*ness, n."
    ]
  },
  {
    "word": "CLEAR-SEEING",
    "definitions": ["Having a clear physical or mental vision; having a clear understanding."]
  },
  {
    "word": "CLEFT-FOOTED",
    "definitions": ["Having a cloven foot."]
  },
  {
    "word": "CLOSE-BANDED",
    "definitions": ["Closely united."]
  },
  {
    "word": "CLOSE-BARRED",
    "definitions": ["Firmly barred or closed."]
  },
  {
    "word": "CLOSE-BODIED",
    "definitions": ["Fitting the body exactly; setting close, as a garment. Ayliffe."]
  },
  {
    "word": "CLOUD-CAPPED",
    "definitions": [
      "Having clouds resting on the top or head; reaching to the clouds; as, cloud-capped mountains."
    ]
  },
  {
    "word": "COCK-BRAINED",
    "definitions": ["Giddy; rash. Milton."]
  },
  {
    "word": "COLD-BLOODED",
    "definitions": [
      "Having cold blood; -- said of fish or animals whose blood is but little warmer than the water or air about them.",
      "Deficient in sensibility or feeling; hard-hearted.",
      "Not thoroughbred; -- said of animals, as horses, which are derived from the common stock of a country."
    ]
  },
  {
    "word": "COLD-HEARTED",
    "definitions": ["Wanting passion or feeling; indifferent.  -- Cold\"-heart`ed*ness, n."]
  },
  {
    "word": "CONE-IN-CONE",
    "definitions": [
      "Consisting of a series of parallel cones, each made up of many concentric cones closely packed together; -- said of a kind of structure sometimes observed in sedimentary rocks."
    ]
  },
  {
    "word": "COPPER-FACED",
    "definitions": ["Faced or covered with copper; as, copper-faced type."]
  },
  {
    "word": "COUNTER-PALY",
    "definitions": [
      "Paly, and then divided fesswise, so that each vertical piece is cut into two, having the colors used alternately or counterchanged. Thus the escutcheon in the illustration may also be blazoned paly of six per fess counterchanged argent and azure."
    ]
  },
  {
    "word": "CROSS-BANDED",
    "definitions": [
      "A term used when a narrow ribbon of veneer is inserted into the surfase of any piece of furniture, wainscoting, etc., so that the grain of it is contrary to the general surface."
    ]
  },
  {
    "word": "CROW-TRODDEN",
    "definitions": [
      "Marked with crow's-feet, or wrinkles, about the eyes. [Poetic] Do I look as if I were crow-trodden Beau. & FL."
    ]
  },
  {
    "word": "DECKLE-EDGED",
    "definitions": ["Having a deckle edge; as, deckle-edged paper; a deckle-edged book."]
  },
  {
    "word": "DEEP-MOUTHED",
    "definitions": ["Having a loud and sonorous voice. \"Deep-mouthed dogs.\" Dryden."]
  },
  {
    "word": "DEEP-WAISTED",
    "definitions": [
      "Having a deep waist, as when, in a ship, the poop and forecastle are much elevated above the deck."
    ]
  },
  {
    "word": "DOUBLE-FACED",
    "definitions": [
      "Having two faces designed for use; as, a double-faced hammer.",
      "Deceitful; hypocritical; treacherous. Milton."
    ]
  },
  {
    "word": "DOUBLE-QUICK",
    "definitions": [
      "Of, or performed in, the fastest time or step in marching, next to the run; as, a double-quick step or march."
    ]
  },
  {
    "word": "DREAD-BOLTED",
    "definitions": ["Armed with dreaded bolts. \"Dread-bolted thunder.\" [Poetic] Shak."]
  },
  {
    "word": "DULL-BRAINED",
    "definitions": ["Stupid; doltish. Shak."]
  },
  {
    "word": "DULL-SIGHTED",
    "definitions": ["Having poor eyesight."]
  },
  {
    "word": "EAGLE-WINGED",
    "definitions": ["Having the wings of an eagle; swift, or soaring high, like an eagle. Shak."]
  },
  {
    "word": "EAST-INSULAR",
    "definitions": ["Relating to the Eastern Islands; East Indian. [R.] Ogilvie."]
  },
  {
    "word": "ELECTRO-GILT",
    "definitions": ["Gilded by means of voltaic electricity."]
  },
  {
    "word": "ENGINE-SIZED",
    "definitions": ["Sized by a machine, and not while in the pulp; -- said of paper. Knight."]
  },
  {
    "word": "ENTIRE-WHEAT",
    "definitions": [
      "Designating, made of, or relating to, flour including a considerable part of the bran."
    ]
  },
  {
    "word": "EVIL-FAVORED",
    "definitions": [
      "Having a bad countenance or appearance; ill-favored; blemished; deformed. Bacon. -- E\"vil-fa`vored*ness, n. Deut. xvi. 1."
    ]
  },
  {
    "word": "EXCITO-MOTOR",
    "definitions": ["Excitomotory; as, excito-motor power or causes."]
  },
  {
    "word": "EXTRA-OCULAR",
    "definitions": ["Inserted exterior to the eyes; -- said of the antennæ of certain insects."]
  },
  {
    "word": "FAIR-NATURED",
    "definitions": ["Well-disposed. \"A fair-natured prince.\" Ford."]
  },
  {
    "word": "FAIR-WEATHER",
    "definitions": [
      "Made or done in pleasant weather, or in circumstances involving but little exposure or sacrifice; as, a fair-weather voyage. Pope.",
      "Appearing only when times or circumstances are prosperous; as, a fair-weather friend. Fair-weather sailor, a make-believe or inexperienced sailor; -- the nautical equivalent of carpet knight."
    ]
  },
  {
    "word": "FAT-KIDNEYED",
    "definitions": ["Gross; lubberly. Peace, ye fat-kidneyed rascal ! Shak."]
  },
  {
    "word": "FAWN-COLORED",
    "definitions": ["Of the color of a fawn; light yellowish brown."]
  },
  {
    "word": "FISH-BELLIED",
    "definitions": ["Bellying or swelling out on the under side; as, a fish-bellied rail. Knight."]
  },
  {
    "word": "FLAP-MOUTHED",
    "definitions": ["Having broad, hangling lips. [R.] Shak."]
  },
  {
    "word": "FLY-CATCHING",
    "definitions": ["Having the habit of catching insects on the wing."]
  },
  {
    "word": "FOUL-MOUTHED",
    "definitions": [
      "Using language scurrilous, opprobrious, obscene, or profane; abusive. So foul-mouthed a witness never appeared in any cause. Addison."
    ]
  },
  {
    "word": "FOUR-IN-HAND",
    "definitions": [
      "Consisting of four horses controlled by one person; as, a four- in-hand team; drawn by four horses driven by one person; as, a four- in-hand coach.  -- n.",
      "A team of four horses driven by one person; also, a vehicle drawn by such a team. As quaint a four-in-hand As you shall see. Tennyson."
    ]
  },
  {
    "word": "FOUR-WHEELED",
    "definitions": ["Having four wheels."]
  },
  {
    "word": "FREE-HEARTED",
    "definitions": [
      "Open; frank; unreserved; liberal; generous; as, free-hearted mirth.  -- Free\"-heart`ed*ly, adv.  -- Free\"-heart`ed*ness, n."
    ]
  },
  {
    "word": "FREE-MILLING",
    "definitions": [
      "Yielding free gold or silver; -- said of certain ores which can be reduced by crushing and amalgamation, without roasting or other chemical treatment. Raymond."
    ]
  },
  {
    "word": "FREE-TONGUED",
    "definitions": ["Speaking without reserve. Bp. Hall."]
  },
  {
    "word": "FULL-BLOODED",
    "definitions": [
      "Having a full supply of blood.",
      "Of pure blood; thoroughbred; as, a full-blooded horse."
    ]
  },
  {
    "word": "FULL-BLOOMED",
    "definitions": ["Like a perfect blossom. \"Full-bloomed lips.\" Crashaw."]
  },
  {
    "word": "FULL-HEARTED",
    "definitions": ["Full of courage or confidence. Shak."]
  },
  {
    "word": "GIDDY-HEADED",
    "definitions": ["Thoughtless; unsteady."]
  },
  {
    "word": "GLASS-GAZING",
    "definitions": ["Given to viewing one's self in a glass or mirror; finical. [Poetic] Shak."]
  },
  {
    "word": "GLOBE-SHAPED",
    "definitions": ["Shaped like a globe."]
  },
  {
    "word": "GOOD-HUMORED",
    "definitions": ["Having a cheerful spirit and demeanor; good-tempered. See Good- natured."]
  },
  {
    "word": "GOOD-LOOKING",
    "definitions": ["Handsome."]
  },
  {
    "word": "GOOD-NATURED",
    "synonyms": [
      "good-natured, good-tempered, good-humored. good-natured denotes a disposition to please and be pleased. good-tempered denotes a habit of mind which is not easily ruffied by provocations or other disturbing influences. good-humored is applied to a spirit full of ease and cheerfulness, as displayed in one's outward deportment and in social intercourse. a good-natured man recommends himself to all by the spirit which governs him. a good-humored man recommends himself particularly as a companion. a good-tempered man is rarely betrayed into anything which can disturb the serenity of the social circle."
    ],
    "definitions": ["Naturally mild in temper; not easily provoked."]
  },
  {
    "word": "GOOSE-RUMPED",
    "definitions": [
      "Having the tail set low and buttocks that fall away sharply from the croup; -- said of certain horses."
    ]
  },
  {
    "word": "GROSS-HEADED",
    "definitions": ["Thick-skulled; stupid."]
  },
  {
    "word": "HALF-BLOODED",
    "definitions": [
      "Proceeding from a male and female of different breeds or races; having only one parent of good stock; as, a half-blooded sheep.",
      "Degenerate; mean."
    ]
  },
  {
    "word": "HALF-CLAMMED",
    "definitions": ["Half-filled. [Obs.] Lions' half-clammed entrails roar food. Marston."]
  },
  {
    "word": "HALF-CRACKED",
    "definitions": ["Half-demented; half-witted. [Colloq.]"]
  },
  {
    "word": "HALF-HATCHED",
    "definitions": ["Imperfectly hatched; as, half-hatched eggs. Gay."]
  },
  {
    "word": "HALF-HEARTED",
    "definitions": [
      "Wanting in heart or spirit; ungenerous; unkind. B. Jonson.",
      "Lacking zeal or courage; lukewarm. H. James."
    ]
  },
  {
    "word": "HALF-LEARNED",
    "definitions": ["Imperfectly learned."]
  },
  {
    "word": "HALF-SIGHTED",
    "definitions": ["Seeing imperfectly; having weak discernment. Bacon."]
  },
  {
    "word": "HARD-FAVORED",
    "definitions": ["Hard-featured; ill-looking; as, Vulcan was hard-favored. Dryden."]
  },
  {
    "word": "HARD-HEARTED",
    "definitions": ["Unsympathetic; inexorable; cruel; pitiless.  -- Hard\"-heart`ed*ness, n."]
  },
  {
    "word": "HARD-LABORED",
    "definitions": ["Wrought with severe labor; elaborate; studied. Swift."]
  },
  {
    "word": "HARD-MOUTHED",
    "definitions": ["Not sensible to the bit; not easily governed; as, a hard- mouthed horse."]
  },
  {
    "word": "HARD-VISAGED",
    "definitions": ["Of a harsh or stern countenance; hard-featured. Burke."]
  },
  {
    "word": "HARE-HEARTED",
    "definitions": ["Timorous; timid; easily frightened. Ainsworth."]
  },
  {
    "word": "HARUM-SCARUM",
    "definitions": [
      "Wild; giddy; flighty; rash; thoughtless. [Colloq.] They had a quarrel with Sir Thomas Newcome's own son, a harum-scarum lad. Thackeray."
    ]
  },
  {
    "word": "HEART-EATING",
    "definitions": ["Preying on the heart."]
  },
  {
    "word": "HEAVY-HEADED",
    "definitions": ["Dull; stupid. \"Gross heavy-headed fellows.\" Beau. & Fl."]
  },
  {
    "word": "HELL-HAUNTED",
    "definitions": ["Haunted by devils; hellish. Dryden."]
  },
  {
    "word": "HIGH-COLORED",
    "definitions": [
      "Having a strong, deep, or glaring color; flushed. Shak.",
      "Vivid; strong or forcible in representation; hence, exaggerated; as, high-colored description."
    ]
  },
  {
    "word": "HIGH-EMBOWED",
    "definitions": ["Having lofty arches. \"The high-embowed roof.\" Milton."]
  },
  {
    "word": "HIGH-FLUSHED",
    "definitions": ["Elated. Young."]
  },
  {
    "word": "HIGH-HEARTED",
    "definitions": ["Full of courage or nobleness; high-souled.  -- High\"-heart`ed*ness, n."]
  },
  {
    "word": "HIGH-METTLED",
    "definitions": ["Having abundance of mettle; ardent; full of fire; as, a high- mettled steed."]
  },
  {
    "word": "HIGH-SIGHTED",
    "definitions": ["Looking upward; supercilious. Shak."]
  },
  {
    "word": "HIGH-WROUGHT",
    "definitions": [
      "Wrought with fine art or skill; elaborate. [Obs.] Pope.",
      "Worked up, or swollen, to a high degree; as, a highwrought passion. \"A high-wrought flood.\" Shak."
    ]
  },
  {
    "word": "HOME-KEEPING",
    "definitions": ["Staying at home; not gadding. Home-keeping youth have ever homely wits. Shak."]
  },
  {
    "word": "HORNY-HANDED",
    "definitions": ["Having the hands horny and callous from labor."]
  },
  {
    "word": "HOT-SPIRITED",
    "definitions": ["Having a fierly spirit; hot-headed."]
  },
  {
    "word": "ILL-MANNERED",
    "definitions": ["Impolite; rude."]
  },
  {
    "word": "ILL-NURTURED",
    "definitions": ["Ill-bred. Shak."]
  },
  {
    "word": "ILL-TEMPERED",
    "definitions": [
      "Of bad temper; morose; crabbed; sour; peevish; fretful; quarrelsome.",
      "Unhealthy; ill-conditioned. [Obs.] So ill-tempered I am grown, that I am afraid I shall catch cold, while all the world is afraid to melt away. Pepys."
    ]
  },
  {
    "word": "INCITO-MOTOR",
    "definitions": [
      "Inciting to motion; -- applied to that action which, in the case of muscular motion, commences in the nerve centers, and excites the muscles to contraction. Opposed to excito-motor."
    ]
  },
  {
    "word": "INDO-CHINESE",
    "definitions": [
      "Of or pertaining to Indo-China (i. e., Farther India, or India beyond the Ganges)."
    ]
  },
  {
    "word": "INDO-ENGLISH",
    "definitions": ["Of or relating to the English who are born or reside in India; Anglo-Indian."]
  },
  {
    "word": "IRON-HEARTED",
    "definitions": ["Hard-hearted; unfeeling; cruel; as, an iron-hearted master. Cowper."]
  },
  {
    "word": "JANUS-HEADED",
    "definitions": ["Double-headed."]
  },
  {
    "word": "KIND-HEARTED",
    "definitions": [
      "Having kindness of nature; sympathetic; characterized by a humane disposition; as, a kind-hearted landlord. To thy self at least kind-hearted prove. Shak."
    ]
  },
  {
    "word": "LABOR-SAVING",
    "definitions": [
      "Saving labor; adapted to supersede or diminish the labor of men; as, laborsaving machinery."
    ]
  },
  {
    "word": "LARGE-HANDED",
    "definitions": [
      "Having large hands, Fig.: Taking, or giving, in large quantities; rapacious or bountiful."
    ]
  },
  {
    "word": "LARK-COLORED",
    "definitions": ["Having the sandy brown color of the European larks."]
  },
  {
    "word": "LIGHT-HANDED",
    "definitions": ["Not having a full complement of men; as, a vessel light-handed."]
  },
  {
    "word": "LIGHT-HEADED",
    "definitions": [
      "Disordered in the head; dilirious. Walpole.",
      "Thoughtless; heedless; volatile; unsteady; fickle; loose. \"Light- headed, weak men.\" Clarendon.  -- Light\"-head`ed*ness, n."
    ]
  },
  {
    "word": "LIGHT-HEELED",
    "definitions": ["Lively in walking or running; brisk; light-footed."]
  },
  {
    "word": "LIGHT-LEGGED",
    "definitions": ["Nimble; swift of foot. Sir P. Sidney."]
  },
  {
    "word": "LIGHT-MINDED",
    "definitions": ["Unsettled; unsteady; volatile; not considerate.  -- Light\"-mind`ed*ness, n."]
  },
  {
    "word": "LIGHT-WINGED",
    "definitions": ["Having light and active wings; volatile; fleeting. Shak."]
  },
  {
    "word": "LILY-LIVERED",
    "definitions": ["White-livered; cowardly."]
  },
  {
    "word": "LIME-TWIGGED",
    "definitions": ["Beset with snares; insnared, as with birdlime. L. Addison."]
  },
  {
    "word": "LION-HEARTED",
    "definitions": ["Very brave; brave and magnanimous. Sir W. Scott."]
  },
  {
    "word": "LONG-SIGHTED",
    "definitions": [
      "Able to see objects at a great distance; hence, having great foresight; sagacious; farseeing.",
      "Able to see objects distinctly at a distance, but not close at hand; hypermetropic."
    ]
  },
  {
    "word": "LONG-TONGUED",
    "definitions": ["Having a long tongue.", "Talkative; babbling; loquacious. Shak."]
  },
  {
    "word": "LONG-WAISTED",
    "definitions": [
      "Having a long waist; long from the armpits to the armpits to the bottom of the waist; -- said of persons.",
      "Long from the part about the neck or shoulder, or from the armpits, to the bottom of the weist, or to the skirt; -- said of garments; as, a long-waisted coat."
    ]
  },
  {
    "word": "LOUD-MOUTHED",
    "definitions": ["Having a loud voice; talking or sounding noisily; noisily impudent."]
  },
  {
    "word": "LOW-PRESSURE",
    "definitions": [
      "Having, employing, or exerting, a low degree of pressure. Low- pressure steam engine, a steam engine in which low steam is used; often applied to a condensing engine even when steam at high pressure is used. See Steam engine."
    ]
  },
  {
    "word": "LOW-SPIRITED",
    "definitions": [
      "Deficient in animation and courage; dejected; depressed; not sprightly.  -- Low\"-spir`it*ed*ness, n."
    ]
  },
  {
    "word": "MAKE-BELIEVE",
    "definitions": ["Feigned; insincere. \"Make-believe reverence.\" G. Eliot."]
  },
  {
    "word": "MARBLE-EDGED",
    "definitions": [
      "Having the edge veined or spotted with different colors like marble, as a book."
    ]
  },
  {
    "word": "MEAL-MOUTHED",
    "definitions": ["See Mealy-mouthed."]
  },
  {
    "word": "MEDICO-LEGAL",
    "definitions": ["Of or pertaining to law as affected by medical facts."]
  },
  {
    "word": "MEDIUM-SIZED",
    "definitions": ["Having a medium size; as, a medium-sized man."]
  },
  {
    "word": "MILK-LIVERED",
    "definitions": ["White-livered; cowardly; timorous."]
  },
  {
    "word": "MONEY-MAKING",
    "definitions": [
      "Affording profitable returns; lucrative; as, a money-making business.",
      "Sussessful in gaining money, and devoted to that aim; as, a money- making man."
    ]
  },
  {
    "word": "MOTHER-NAKED",
    "definitions": ["Naked as when born."]
  },
  {
    "word": "MOTOR-DRIVEN",
    "definitions": [
      "Driven or actuated by a motor, esp. by an individual electric motor. An electric motor forms an integral part of many machine tools in numerous modern machine shops."
    ]
  },
  {
    "word": "MOUTH-FOOTED",
    "definitions": ["Having the basal joints of the legs converted into jaws."]
  },
  {
    "word": "MUDDY-HEADED",
    "definitions": ["Dull; stupid."]
  },
  {
    "word": "NEO-HEGELIAN",
    "definitions": ["Of or pertaining to Neo-Hegelianism."]
  },
  {
    "word": "NERVE-SHAKEN",
    "definitions": [
      "Affected by a tremor, or by a nervous disease; weakened; overcome by some violent influence or sensation; shoked."
    ]
  },
  {
    "word": "NIGHT-FARING",
    "definitions": ["Going or traveling in the night. Gay."]
  },
  {
    "word": "NOBLE-MINDED",
    "definitions": ["Having a noble mind; honorable; magnanimous.  -- No\"ble-mind`ed*ness, n."]
  },
  {
    "word": "NOOK-SHOTTEN",
    "definitions": [
      "Full of nooks, angles, or corners. [Obs. or Prov. Eng.] That nook-shotten isle of Albion. Shak."
    ]
  },
  {
    "word": "OBLONG-OVATE",
    "definitions": ["Between oblong and ovate, but inclined to the latter."]
  },
  {
    "word": "OLD-WOMANISH",
    "definitions": ["Like an old woman; anile.  -- Old`-wom\"an*ish*ness, n."]
  },
  {
    "word": "OPEN-HEARTED",
    "definitions": [
      "Candid; frank; generous. Dryden.  -- O\"pen-heart`ed*ly, adv.  -- O\"pen-heart`ed*ness, n. Walton."
    ]
  },
  {
    "word": "OPEN-MOUTHED",
    "definitions": ["Having the mouth open; gaping; hence, greedy; clamorous. L'Estrange."]
  },
  {
    "word": "OVATE-OBLONG",
    "definitions": ["Oblong. with one end narrower than the other; ovato-oblong."]
  },
  {
    "word": "OVATO-OBLONG",
    "definitions": ["Same as Ovate-oblong."]
  },
  {
    "word": "PAN-AMERICAN",
    "definitions": ["Of or pertaining to both North and South America."]
  },
  {
    "word": "PAN-ANGLICAN",
    "definitions": [
      "Belonging to, or representing, the whole Church of England; used less strictly, to include the Protestant Episcopal Church of the United States; as, the Pan-Anglican Conference at Lambeth, in 1888."
    ]
  },
  {
    "word": "PARTY-COATED",
    "definitions": ["Having a motley coat, or coat of divers colors. Shak."]
  },
  {
    "word": "PINK-STERNED",
    "definitions": ["Having a very narrow stern; -- said of a vessel."]
  },
  {
    "word": "PLAIN-SPOKEN",
    "definitions": [
      "Speaking with plain, unreserved sincerity; also, spoken sincerely; as, plain-spoken words. Dryden."
    ]
  },
  {
    "word": "PLANO-CONVEX",
    "definitions": [
      "Plane or flat on one side, and convex on the other; as, a plano-convex lens. See Convex, and Lens."
    ]
  },
  {
    "word": "PLANT-EATING",
    "definitions": ["Eating, or subsisting on, plants; as, a plant-eating beetle."]
  },
  {
    "word": "PLATE-GILLED",
    "definitions": ["Having flat, or leaflike, gills, as the bivalve mollusks."]
  },
  {
    "word": "POCK-FRETTEN",
    "definitions": ["See Pockmarked."]
  },
  {
    "word": "POINT-DEVICE",
    "definitions": [
      "Uncommonly nice and exact; precise; particular. You are rather point-devise in your accouterments. Shak. Thus he grew up, in logic point-devise, Perfect in grammar, and in rhetoric nice. Longfellow."
    ]
  },
  {
    "word": "PREHENSI-BLE",
    "definitions": ["Capable of being seized."]
  },
  {
    "word": "PSYCHO-MOTOR",
    "definitions": ["Of or pertaining to movement produced by action of the mind or will."]
  },
  {
    "word": "QUARRY-FACED",
    "definitions": [
      "Having a face left as it comes from the quarry and not smoothed with the chisel or point; -- said of stones."
    ]
  },
  {
    "word": "QUICK-WITTED",
    "definitions": ["Having ready wit Shak."]
  },
  {
    "word": "RADIO-ACTIVE",
    "definitions": [
      "Capable of luminescence under the action of cathode rays, X rays, or any of the allied forms of radiation. -- Ra`di*o- ac*tiv\"i*ty, n."
    ]
  },
  {
    "word": "RATTLE-PATED",
    "definitions": ["Rattle-headed. \"A noisy, rattle-pated fellow.\" W. Irving."]
  },
  {
    "word": "RAZOR-BACKED",
    "definitions": ["Having a sharp, lean, or thin back; as, a razor-backed hog, perch, etc."]
  },
  {
    "word": "READY-WITTED",
    "definitions": ["Having ready wit."]
  },
  {
    "word": "RENAL-PORTAL",
    "definitions": ["Both renal and portal. See Portal."]
  },
  {
    "word": "RIGHT-ANGLED",
    "definitions": ["Containing a right angle or right angles; as, a right-angled triangle."]
  },
  {
    "word": "RIGHT-HANDED",
    "definitions": [
      "Using the right hand habitually, or more easily than the left.",
      "Having the same direction or course as the movement of the hands of a watch seen in front; -- said of the motion of a revolving object looked at from a given direction.",
      "Having the whorls rising from left to right; dextral; -- said of spiral shells. See Illust. of Scalaria. Right-handed screw, a screw, the threads of which, like those of a common wood screw, wind spirally in such a direction that screw advances away from the observer when turned with a right-handed movement in a fixed nut."
    ]
  },
  {
    "word": "RIGHT-MINDED",
    "definitions": ["Having a right or honest mind.  -- Right\"-mind`ed*ness, n."]
  },
  {
    "word": "ROACH-BACKED",
    "definitions": [
      "Having a back like that of roach; -- said of a horse whose back a convex instead of a concave curve."
    ]
  },
  {
    "word": "ROSE-COLORED",
    "definitions": [
      "Having the color of a pink rose; rose-pink; of a delicate pink color.",
      "Uncommonly beautiful; hence, extravagantly fine or pleasing; alluring; as, rose-colored anticipations."
    ]
  },
  {
    "word": "ROUGH-FOOTED",
    "definitions": ["Feather-footed; as, a rough-footed dove. [R.] Sherwood."]
  },
  {
    "word": "ROUGH-LEGGED",
    "definitions": [
      "Having the legs covered with feathers; -- said of a bird. rough-legged hawk. (Zoöl.) See Roughleg."
    ]
  },
  {
    "word": "ROUND-BACKED",
    "definitions": ["Having a round back or shoulders; round-shouldered."]
  },
  {
    "word": "SCALE-WINGED",
    "definitions": [
      "Having the wings covered with small scalelike structures, as the lepidoptera; scaly-winged."
    ]
  },
  {
    "word": "SCALY-WINGED",
    "definitions": ["Scale-winged."]
  },
  {
    "word": "SCRAG-NECKED",
    "definitions": ["Having a scraggy neck."]
  },
  {
    "word": "SECOND-CLASS",
    "definitions": [
      "Of the rank or degree below the best highest; inferior; second- rate; as, a second-class house; a second-class passage."
    ]
  },
  {
    "word": "SELF-ABASING",
    "definitions": ["Lowering or humbling one's self."]
  },
  {
    "word": "SELF-ACCUSED",
    "definitions": ["Accused by one's self or by one's conscience. \"Die self- accused.\" Cowper."]
  },
  {
    "word": "SELF-ASSUMED",
    "definitions": ["Assumed by one's own act, or without authority."]
  },
  {
    "word": "SELF-ASSURED",
    "definitions": ["Assured by or of one's self; self-reliant; complacent."]
  },
  {
    "word": "SELF-COLORED",
    "definitions": ["Being of a single color; -- applied to flowers, animals, and textile fabrics."]
  },
  {
    "word": "SELF-CREATED",
    "definitions": ["Created by one's self; not formed or constituted by another."]
  },
  {
    "word": "SELF-DENYING",
    "definitions": [
      "Refusing to gratify one's self; self-sacrificing.  -- Self`-de*ny\"ing*ly, adv."
    ]
  },
  {
    "word": "SELF-DEVISED",
    "definitions": ["Devised by one's self."]
  },
  {
    "word": "SELF-DEVOTED",
    "definitions": ["Devoted in person, or by one's own will. Hawthorne."]
  },
  {
    "word": "SELF-EVIDENT",
    "definitions": [
      "Evident without proof or reasoning; producing certainty or conviction upon a bare presentation to the mind; as, a self-evident proposition or truth.  -- Self`-ev\"i*dent*ly, adv."
    ]
  },
  {
    "word": "SELF-HEALING",
    "definitions": ["Having the power or property of healing itself."]
  },
  {
    "word": "SELF-IMPOSED",
    "definitions": ["Voluntarily taken on one's self; as, self-imposed tasks."]
  },
  {
    "word": "SELF-KINDLED",
    "definitions": ["Kindled of itself, or without extraneous aid or power. Dryden."]
  },
  {
    "word": "SELF-KNOWING",
    "definitions": [
      "Knowing one's self, or one's own character, powers, and limitations.",
      "Knowing of itself, without help from another."
    ]
  },
  {
    "word": "SELF-POSITED",
    "definitions": [
      "Disposed or arranged by an action originating in one's self or in itself. These molecular blocks of salt are self-posited. Tyndall."
    ]
  },
  {
    "word": "SELF-RELIANT",
    "definitions": ["Reliant upon one's self; trusting to one's own powers or judgment."]
  },
  {
    "word": "SELF-SEEKING",
    "definitions": ["Seeking one's own interest or happiness; selfish. Arbuthnot."]
  },
  {
    "word": "SESSILE-EYED",
    "definitions": [
      "Having eyes which are not elevated on a stalk; -- opposed to stalk-eyed. Sessile-eyed Crustacea, the Arthrostraca."
    ]
  },
  {
    "word": "SET-STITCHED",
    "definitions": [
      "Stitched according to a formal pattern. \"An old set-stiched chair, valanced, and fringed with party-colored worsted bobs.\" Sterne."
    ]
  },
  {
    "word": "SHARP-WITTED",
    "definitions": ["Having an acute or nicely discerning mind."]
  },
  {
    "word": "SHEEP-HEADED",
    "definitions": ["Silly; simple-minded; stupid. Taylor (1630)"]
  },
  {
    "word": "SHOCK-HEADED",
    "definitions": ["Having a thick and bushy head of hair."]
  },
  {
    "word": "SHORT-HANDED",
    "definitions": ["Short of, or lacking the regular number of, servants or helpers."]
  },
  {
    "word": "SHORT-SPOKEN",
    "definitions": ["Speaking in a quick or short manner; hence, gruff; curt. [Colloq.]"]
  },
  {
    "word": "SHORT-WINDED",
    "definitions": [
      "Affected with shortness of breath; having a quick, difficult respiration, as dyspnoic and asthmatic persons. May."
    ]
  },
  {
    "word": "SHOVEL-NOSED",
    "definitions": ["Having a broad, flat nose; as, the shovel-nosed duck, or shoveler."]
  },
  {
    "word": "SICK-BRAINED",
    "definitions": ["Disordered in the brain."]
  },
  {
    "word": "SIGHT-SEEING",
    "definitions": ["Engaged in, or given to, seeing sights; eager for novelties or curiosities."]
  },
  {
    "word": "SINEW-SHRUNK",
    "definitions": ["Having the sinews under the belly shrunk by excessive fatigue."]
  },
  {
    "word": "SIXTY-FOURTH",
    "definitions": [
      "Constituting or being one of sixty-four equal parts into which a thing is divided. Sixty-fourth note (Mus.), the sixty-fourth part of a whole note; a hemi-demi-semiquaver."
    ]
  },
  {
    "word": "SOBER-MINDED",
    "definitions": ["Having a disposition or temper habitually sober.  -- So\"ber-mind`ed*ness, n."]
  },
  {
    "word": "SOFT-HEARTED",
    "definitions": [
      "Having softness or tenderness of heart; susceptible of pity or other kindly affection; gentle; meek.  -- Soft\"-heart`ed*ness, n."
    ]
  },
  {
    "word": "SPINE-FINNED",
    "definitions": ["Having fine supported by spinous fin rays; -- said of certain fishes."]
  },
  {
    "word": "SPINE-TAILED",
    "definitions": [
      "Having the tail quills ending in sharp, naked tips. Spine- tailed swift. (Zoöl.) See Spinetail (a)."
    ]
  },
  {
    "word": "SPOON-BILLED",
    "definitions": ["Having the bill expanded and spatulate at the end."]
  },
  {
    "word": "SPREAD-EAGLE",
    "definitions": [
      "Characterized by a pretentious, boastful, exaggerated style; defiantly or extravagantly bombastic; as, a spread-eagle orator; a spread-eagle speech. [Colloq.& Humorous]"
    ]
  },
  {
    "word": "STAGE-STRUCK",
    "definitions": ["Fascinated by the stage; seized by a passionate desire to become an actor."]
  },
  {
    "word": "STAR-CROSSED",
    "definitions": [
      "Not favored by the stars; ill-fated. [Poetic] Shak. Such in my star-crossed destiny. Massinger."
    ]
  },
  {
    "word": "STEM-WINDING",
    "definitions": ["Wound by mechanism connected with the stem; as, a stem-winding watch."]
  },
  {
    "word": "STIFF-BACKED",
    "definitions": ["Obstinate. J. H. Newman."]
  },
  {
    "word": "STIFF-NECKED",
    "definitions": [
      "Stubborn; inflexibly obstinate; contumacious; as, stiff-necked pride; a stiff-necked people. Ex. xxxii. 9."
    ]
  },
  {
    "word": "STIFF-TAILED",
    "definitions": ["Having the quill feathers of the tail somewhat rigid."]
  },
  {
    "word": "STORK-BILLED",
    "definitions": ["Having a bill like that of the stork."]
  },
  {
    "word": "STRAIGHT-OUT",
    "definitions": [
      "Acting without concealment, obliquity, or compromise; hence, unqualified; thoroughgoing. [Colloq. U.S.] Straight-out and generous indignation. Mrs. Stowe."
    ]
  },
  {
    "word": "STRAIT-LACED",
    "definitions": [
      "Bound with stays. Let nature have scope to fashion the body as she thinks best; we have few well-shaped that are strait-laced. Locke.",
      "Restricted; stiff; constrained. [R.] Fuller.",
      "Rigid in opinion; strict in manners or morals."
    ]
  },
  {
    "word": "STRAP-SHAPED",
    "definitions": ["Shaped like a strap; ligulate; as, a strap-shaped corolla."]
  },
  {
    "word": "STUMP-TAILED",
    "definitions": [
      "Having a short, thick tail. Stump-tailed lizard (Zoöl.), a singular Australian scincoid lizard (Trachydosaurus rugosus) having a short, thick tail resembling its head in form; -- called also sleeping lizard."
    ]
  },
  {
    "word": "SWAG-BELLIED",
    "definitions": ["Having a prominent, overhanging belly. Shak."]
  },
  {
    "word": "SWORD-SHAPED",
    "definitions": [
      "Shaped like a sword; ensiform, as the long, flat leaves of the Iris, cattail, and the like."
    ]
  },
  {
    "word": "TALLOW-FACED",
    "definitions": ["Having a sickly complexion; pale. Burton."]
  },
  {
    "word": "TEAR-FALLING",
    "definitions": ["Shedding tears; tender. [Poetic] \"Tear-falling pity.\" Shak."]
  },
  {
    "word": "THICK-HEADED",
    "definitions": ["Having a thick skull; stupid."]
  },
  {
    "word": "THICK-WINDED",
    "definitions": ["Affected with thick wind."]
  },
  {
    "word": "THIN-SKINNED",
    "definitions": ["Having a thin skin; hence, sensitive; irritable."]
  },
  {
    "word": "THORN-HEADED",
    "definitions": [
      "Having a head armed with thorns or spines. Thorn-headed worm (Zoöl.), any worm of the order Acanthocephala; -- called also thornhead."
    ]
  },
  {
    "word": "THREE-HANDED",
    "definitions": [
      "Said of games or contests where three persons play against each other, or two against one; as, a three-handed game of cards."
    ]
  },
  {
    "word": "THREE-LEAFED",
    "definitions": [
      "Producing three leaves; as, three-leaved nightshade.",
      "Consisting of three distinct leaflets; having the leaflets arranged in threes. Three-leaved nightshade. See Trillium."
    ]
  },
  {
    "word": "THREE-NERVED",
    "definitions": [
      "Having three nerves. Three-nerved leaf (Bot.), a leaf having three distinct and prominent ribs, or nerves, extending from the base."
    ]
  },
  {
    "word": "THREE-PARTED",
    "definitions": [
      "Divided into, or consisting of, three parts; tripartite. Three- parted leaf (Bot.), a leaf divided into three parts down to the base, but not entirely separate."
    ]
  },
  {
    "word": "THREE-SQUARE",
    "definitions": [
      "Having a cross section in the form of an equilateral triangle; -- said especially of a kind of file."
    ]
  },
  {
    "word": "THREE-VALVED",
    "definitions": [
      "Consisting of, or having, three valves; opening with three valves; as, a three-valved pericarp."
    ]
  },
  {
    "word": "TIGER-FOOTED",
    "definitions": ["Hastening to devour; furious."]
  },
  {
    "word": "TIME-HONORED",
    "definitions": [
      "Honored for a long time; venerable, and worthy of honor, by reason of antiquity, or long continuance."
    ]
  },
  {
    "word": "TRUE-HEARTED",
    "definitions": [
      "Of a faithful heart; honest; sincere; not faithless or deceitful; as, a truhearted friend.  -- True\"-heart`ed*ness, n."
    ]
  },
  {
    "word": "TWO-CAPSULED",
    "definitions": ["Having two distinct capsules; bicapsular."]
  },
  {
    "word": "UNCALLED-FOR",
    "definitions": ["Not called for; not required or needed; improper; gratuitous; wanton."]
  },
  {
    "word": "UNLOOKED-FOR",
    "definitions": ["Not looked for; unexpected; as, an unlooked-for event."]
  },
  {
    "word": "UN-ROMANIZED",
    "definitions": [
      "Not subjected to Roman arms or customs. J. Whitaker.",
      "Not subjected to the principles or usages of the Roman Catholic Church."
    ]
  },
  {
    "word": "WAGON-HEADED",
    "definitions": [
      "Having a top, or head, shaped like the top of a covered wagon, or resembling in section or outline an inverted U, thus as, a wagonheaded ceiling."
    ]
  },
  {
    "word": "WAGON-ROOFED",
    "definitions": ["Having a roof, or top, shaped like an inverted U; wagon-headed."]
  },
  {
    "word": "WARM-BLOODED",
    "definitions": [
      "Having warm blood; -- applied especially to those animals, as birds and mammals, which have warm blood, or, more properly, the power of maintaining a nearly uniform temperature whatever the temperature of the surrounding air. See Homoiothermal."
    ]
  },
  {
    "word": "WARM-HEARTED",
    "definitions": [
      "Having strong affection; cordial; sincere; hearty; sympathetic.  -- Warm\"-heart`ed*ness, n."
    ]
  },
  {
    "word": "WATER-LOGGED",
    "definitions": [
      "Filled or saturated with water so as to be heavy, unmanageable, or loglike; -- said of a vessel, when, by receiving a great quantity of water into her hold, she has become so heavy as not to be manageable by the helm."
    ]
  },
  {
    "word": "WEAK-HEARTED",
    "definitions": [
      "Having little courage; of feeble spirit; dispirited; faint- hearted. \"Weak-hearted enemies.\" Shak."
    ]
  },
  {
    "word": "WEASEL-FACED",
    "definitions": ["Having a thin, sharp face, like a weasel."]
  },
  {
    "word": "WEB-FINGERED",
    "definitions": ["Having the fingers united by a web for a considerable part of their length."]
  },
  {
    "word": "WEDGE-FORMED",
    "definitions": [
      "Having the form of a wedge; cuneiform. Wedge-formed characters. See Arrow-headed characters, under Arrowheaded."
    ]
  },
  {
    "word": "WEDGE-SHAPED",
    "definitions": [
      "Having the shape of a wedge; cuneiform.",
      "Broad and truncate at the summit, and tapering down to the base; as, a wedge-shaped leaf."
    ]
  },
  {
    "word": "WEDGE-TAILED",
    "definitions": [
      "Having a tail which has the middle pair of feathers longest, the rest successively and decidedly shorter, and all more or less attenuate; -- said of certain birds. See Illust. of Wood hoopoe, under Wood. Wedge-tailed eagle, an Australian eagle (Aquila audax) which feeds on various small species of kangaroos, and on lambs; -- called also mountain eagle, bold eagle, and eagle hawk.  -- Wedge-tailed gull, an arctic gull (Rhodostethia rosea) in which the plumage is tinged with rose; -- called also Ross's gull."
    ]
  },
  {
    "word": "WEEPING-RIPE",
    "definitions": ["Ripe for weeping; ready to weep. [Obs.] Shak."]
  },
  {
    "word": "WELL-FAVORED",
    "definitions": [
      "Handsome; wellformed; beautiful; pleasing to the eye. Rachel was beautiful and well-favored. Gen. xxix. 17."
    ]
  },
  {
    "word": "WELL-MEANING",
    "definitions": ["Having a good intention."]
  },
  {
    "word": "WELL-NATURED",
    "definitions": ["Good-natured; kind. Well-natured, temperate, and wise. Denham."]
  },
  {
    "word": "WHEEL-SHAPED",
    "definitions": [
      "Shaped like a wheel.",
      "Expanding into a flat, circular border at top, with scarcely any tube; as, a wheel-shaped corolla."
    ]
  },
  {
    "word": "WHOLE-HOOFED",
    "definitions": ["Having an undivided hoof, as the horse."]
  },
  {
    "word": "WHOLE-LENGTH",
    "definitions": [
      "Representing the whole figure; -- said of a picture or statue.  -- n.",
      "A portrait or statue representing the whole figure."
    ]
  },
  {
    "word": "WHOLE-SOULED",
    "definitions": ["Thoroughly imbued with a right spirit; noble-minded; devoted."]
  },
  {
    "word": "WINTER-PROUD",
    "definitions": [
      "Having too rank or forward a growth for winter. When either corn is winter-proud, or other plants put forth and bud too early. Holland."
    ]
  },
  {
    "word": "WISE-HEARTED",
    "definitions": ["Wise; knowing; skillful; sapient; erudite; prudent. Ex. xxviii. 3."]
  },
  {
    "word": "WITHER-WRUNG",
    "definitions": ["Injured or hurt in the withers, as a horse."]
  },
  {
    "word": "WITHOUT-DOOR",
    "definitions": ["Outdoor; exterior. [Obs.] \"Her without-door form.\" Shak."]
  },
  {
    "word": "YEAST-BITTEN",
    "definitions": [
      "A term used of beer when the froth of the yeast has reëntered the body of the beer."
    ]
  },
  {
    "word": "ABSENT-MINDED",
    "definitions": [
      "Absent in mind; abstracted; preoccupied.  -- Ab`sent-mind\"ed*ness, n.  -- Ab`sent-mind\"ed*ly, adv."
    ]
  },
  {
    "word": "ADDLE-BRAINED",
    "definitions": [
      "Dull-witted; stupid. \"The addle-brained Oberstein.\" Motley. Dull and addle-pated. Dryden."
    ]
  },
  {
    "word": "ALDER-LIEFEST",
    "definitions": ["Most beloved. [Obs.] Shak."]
  },
  {
    "word": "ALL-POSSESSED",
    "definitions": ["Controlled by an evil spirit or by evil passions; wild. [Colloq.]"]
  },
  {
    "word": "ANOTHER-GATES",
    "definitions": ["Of another sort. [Obs.] \"Another-gates adventure.\" Hudibras."]
  },
  {
    "word": "ANOTHER-GUESS",
    "definitions": ["Of another sort. [Archaic] It used to go in another-guess manner. Arbuthnot."]
  },
  {
    "word": "ANTI-AMERICAN",
    "definitions": [
      "Opposed to the Americans, their aims, or interests, or to the genius of American institutions. Marshall."
    ]
  },
  {
    "word": "ANTI-GALLICAN",
    "definitions": ["Opposed to what is Gallic or French."]
  },
  {
    "word": "BADGER-LEGGED",
    "definitions": ["Having legs of unequal length, as the badger was thought to have. Shak."]
  },
  {
    "word": "BEETLE-BROWED",
    "definitions": ["Having prominent, overhanging brows; hence, lowering or sullen."]
  },
  {
    "word": "BEETLE-HEADED",
    "definitions": ["Dull; stupid. Shak."]
  },
  {
    "word": "BELLY-PINCHED",
    "definitions": ["Pinched with hunger; starved. \"The belly-pinched wolf.\" Shak."]
  },
  {
    "word": "BLACK-A-VISED",
    "definitions": ["Dark-visaged; swart."]
  },
  {
    "word": "BLACK-HEARTED",
    "definitions": ["Having a wicked, malignant disposition; morally bad."]
  },
  {
    "word": "BLACK-MOUTHED",
    "definitions": ["Using foul or scurrilous language; slanderous."]
  },
  {
    "word": "BLOOD-SHOTTEN",
    "definitions": ["Bloodshot. [Obs.]"]
  },
  {
    "word": "BLOODY-MINDED",
    "definitions": ["Having a cruel, ferocious disposition; bloodthirsty. Dryden."]
  },
  {
    "word": "BRASS-VISAGED",
    "definitions": ["Impudent; bold."]
  },
  {
    "word": "BRAZEN-BROWED",
    "definitions": ["Shamelessly impudent. Sir T. Browne."]
  },
  {
    "word": "BROAD-BRIMMED",
    "definitions": ["Having a broad brim. A broad-brimmed flat silver plate. Tatler."]
  },
  {
    "word": "BROKEN-BACKED",
    "definitions": [
      "Having a broken back; as, a broken-backed chair.",
      "Hogged; so weakened in the frame as to droop at each end; -- said of a ship. Totten."
    ]
  },
  {
    "word": "BROKEN-WINDED",
    "definitions": ["Having short breath or disordered respiration, as a horse."]
  },
  {
    "word": "BUFFLE-HEADED",
    "definitions": [
      "Having a large head, like a buffalo; dull; stupid; blundering. [Obs.] So fell this buffle-headed giant. Gayton."
    ]
  },
  {
    "word": "CARNAL-MINDED",
    "definitions": ["Worldly-minded."]
  },
  {
    "word": "CLEAR-SHINING",
    "definitions": ["Shining brightly. Shak."]
  },
  {
    "word": "CLEAR-SIGHTED",
    "definitions": ["Seeing with clearness; discerning; as, clear-sighted reason"]
  },
  {
    "word": "CLINKER-BUILT",
    "definitions": [
      "Having the side planks (af a boat) so arranged that the lower edge of each overlaps the upper edge of the plank next below it like clapboards on a house. See Lapstreak."
    ]
  },
  {
    "word": "CLOSE-TONGUED",
    "definitions": ["Closemouthed; silent. \"Close-tongued treason.\" Shak."]
  },
  {
    "word": "CLOVEN-FOOTED",
    "definitions": ["Having the foot or hoof divided into two parts, as the ox."]
  },
  {
    "word": "CONVEXO-PLANE",
    "definitions": ["Convex on one side, and flat on the other; plano-convex."]
  },
  {
    "word": "COSTAL-NERVED",
    "definitions": ["Having the nerves spring from the midrib."]
  },
  {
    "word": "CRACK-BRAINED",
    "definitions": ["Having an impaired intellect; whimsical; crazy. Pope."]
  },
  {
    "word": "CREAM-COLORED",
    "definitions": ["Of the color of cream; light yellow. \"Cream-colored horses.\" Hazlitt."]
  },
  {
    "word": "DIRECT-ACTING",
    "definitions": [
      "Acting directly, as one part upon another, without the intervention of other working parts. Direct-acting steam engine, one in which motion is transmitted to the crank without the intervention of a beam or lever; -- also called direct-action steam engine.  -- Direct-acting steam pump, one in which the steam piston rod is directly connected with the pump rod; -- also called direct-action steam pump."
    ]
  },
  {
    "word": "DOUBLE-ACTING",
    "definitions": [
      "Acting or operating in two directions or with both motions; producing a twofold result; as, a double-acting engine or pump."
    ]
  },
  {
    "word": "DOUBLE-BANKED",
    "definitions": [
      "Applied to a kind of rowing in which the rowers sit side by side in twos, a pair of oars being worked from each bank or thwart."
    ]
  },
  {
    "word": "DOUBLE-HANDED",
    "definitions": ["Having two hands.", "Deceitful; deceptive. Glanvill."]
  },
  {
    "word": "DOUBLE-HEADED",
    "definitions": [
      "Having two heads; bicipital. Double-headed rail (Railroad), a rail whose flanges are duplicates, so that when one is worn the other may be turned uppermost."
    ]
  },
  {
    "word": "DOUBLE-MILLED",
    "definitions": [
      "Twice milled or fulled, to render more compact or fine; -- said of cloth; as, double-milled kerseymere."
    ]
  },
  {
    "word": "DOUGH-KNEADED",
    "definitions": [
      "Like dough; soft. He demeans himself . . . like a dough-kneaded thing. Milton."
    ]
  },
  {
    "word": "DUNDER-HEADED",
    "definitions": ["Thick-headed; stupid."]
  },
  {
    "word": "EAGLE-SIGHTED",
    "definitions": ["Farsighted and strong-sighted; sharp-sighted. Shak."]
  },
  {
    "word": "EAR-SPLITTING",
    "definitions": ["Deafening; disagreeably loud or shrill; as, ear-splitting strains."]
  },
  {
    "word": "ELECTRO-POLAR",
    "definitions": [
      "Possessing electrical polarity; positively electrified at one end, or on one surface, and negatively at the other; -- said of a conductor."
    ]
  },
  {
    "word": "ELECTRO-VITAL",
    "definitions": [
      "Derived from, or dependent upon, vital processes; -- said of certain electric currents supposed by some physiologists to circulate in the nerves of animals."
    ]
  },
  {
    "word": "ERECTO-PATENT",
    "definitions": [
      "Having a position intermediate between erect and patent, or spreading.",
      "Standing partially spread and erect; -- said of the wings of certain insects."
    ]
  },
  {
    "word": "EXCITO-MOTORY",
    "definitions": [
      "Exciting motion; -- said of that portion of the nervous system concerned in reflex action, by which impressions are transmitted to a nerve center and then reflected back so as to produce muscular contraction without sensation or volition."
    ]
  },
  {
    "word": "EXTRA-UTERINE",
    "definitions": [
      "Outside of the uterus, or womb. Extra-uterine pregnancy (Med.), a condition of pregnancy in which the fetus is not in the uterus, but in the Fallopian tube or in the abdominal cavity."
    ]
  },
  {
    "word": "FALSE-HEARTED",
    "definitions": [
      "Hollow or unsound at the core; treacherous; deceitful; perfidious. Bacon.  -- False\"*heart`ed*ness, n. Bp. Stillingfleet."
    ]
  },
  {
    "word": "FAR-STRETCHED",
    "definitions": ["Stretched beyond ordinary limits."]
  },
  {
    "word": "FAR-STRETCHED",
    "definitions": ["Stretched beyond ordinary limits."]
  },
  {
    "word": "FEATHER-EDGED",
    "definitions": [
      "Having a feather-edge; also, having one edge thinner than the other, as a board; -- in the United States, said only of stuff one edge of which is made as thin as practicable."
    ]
  },
  {
    "word": "FEATHER-PATED",
    "definitions": ["Feather-headed; frivolous. [Colloq.] Sir W. Scott."]
  },
  {
    "word": "FEEBLE-MINDED",
    "definitions": [
      "Weak in intellectual power; wanting firmness or constancy; irresolute; vacilating; imbecile. \"comfort the feeble-minded.\" 1 Thess. v. 14.  -- Fee\"ble-mind\"ed*ness, n."
    ]
  },
  {
    "word": "FIDDLE-SHAPED",
    "definitions": ["Inversely ovate, with a deep hollow on each side. Gray."]
  },
  {
    "word": "FLAME-COLORED",
    "definitions": ["Of the color of flame; of a bright orange yellow color. Shak."]
  },
  {
    "word": "FLAT-BOTTOMED",
    "definitions": ["Having an even lower surface or bottom; as, a flat-bottomed boat."]
  },
  {
    "word": "FLINT-HEARTED",
    "definitions": ["Hard-hearted. Shak."]
  },
  {
    "word": "FLUVIO-MARINE",
    "definitions": [
      "Formed by the joint action of a river and the sea, as deposits at the mouths of rivers."
    ]
  },
  {
    "word": "FOUR-CORNERED",
    "definitions": ["Having four corners or angles."]
  },
  {
    "word": "FREE-SWIMMING",
    "definitions": ["Swimming in the open sea; -- said of certain marine animals."]
  },
  {
    "word": "FRIGATE-BUILT",
    "definitions": ["Built like a frigate with a raised quarter-deck and forecastle."]
  },
  {
    "word": "FULL-BOTTOMED",
    "definitions": [
      "Full and large at the bottom, as wigs worn by certain civil officers in Great Britain.",
      "Of great capacity below the water line."
    ]
  },
  {
    "word": "GOOD-TEMPERED",
    "definitions": ["Having a good temper; not easily vexed. See Good-natured."]
  },
  {
    "word": "GREAT-BELLIED",
    "definitions": ["Having a great belly, bigbellied; pregnant; teeming. Shak."]
  },
  {
    "word": "GREAT-HEARTED",
    "definitions": ["High-spirited; fearless. [Obs.] Clarendon.", "Generous; magnanimous; noble."]
  },
  {
    "word": "HALF-STRAINED",
    "definitions": ["Half-bred; imperfect. [R.] \"A half-strained villain.\" Dryden."]
  },
  {
    "word": "HALF-TIMBERED",
    "definitions": [
      "Constructed of a timber frame, having the spaces filled in with masonry; -- said of buildings."
    ]
  },
  {
    "word": "HEART-ROBBING",
    "definitions": [
      "Depriving of thought; ecstatic. \"Heart-robbing gladness.\" Spenser.",
      "Stealing the heart or affections; winning."
    ]
  },
  {
    "word": "HEART-WOUNDED",
    "definitions": ["Wounded to the heart with love or grief. Pope."]
  },
  {
    "word": "HELMET-SHAPED",
    "definitions": ["Shaped like a helmet; galeate. See Illust. of Galeate."]
  },
  {
    "word": "HIGH-FINISHED",
    "definitions": ["Finished with great care; polished."]
  },
  {
    "word": "HIGH-PRESSURE",
    "definitions": [
      "Having or involving a pressure greatly exceeding that of the atmosphere; -- said of steam, air, water, etc., and of steam, air, or hydraulic engines, water wheels, etc.",
      "Fig.: Urgent; intense; as, a high-pressure business or social life. High-pressure engine, an engine in which steam at high pressure is used. It may be either a condensing or a noncondensing engine. Formerly the term was used only of the latter. See Steam engine."
    ]
  },
  {
    "word": "HIGH-REACHING",
    "definitions": ["Reaching high or upward; hence, ambitious; aspiring. Shak."]
  },
  {
    "word": "HIGH-SEASONED",
    "definitions": ["Enriched with spice and condiments; hence, exciting; piquant."]
  },
  {
    "word": "HIGH-SOUNDING",
    "definitions": ["Pompous; noisy; ostentatious; as, high-sounding words or titles."]
  },
  {
    "word": "HIGH-SPIRITED",
    "definitions": [
      "Full of spirit or natural fire; haughty; courageous; impetuous; not brooking restraint or opposition."
    ]
  },
  {
    "word": "HIGH-SWELLING",
    "definitions": ["Inflated; boastful."]
  },
  {
    "word": "HIGHTY-TIGHTY",
    "definitions": ["Hoity-toity."]
  },
  {
    "word": "HOLLOW-HORNED",
    "definitions": ["Having permanent horns with a bony core, as cattle."]
  },
  {
    "word": "HOME-DWELLING",
    "definitions": ["Keeping at home."]
  },
  {
    "word": "HONEY-MOUTHED",
    "definitions": ["Soft to sweet in speech; persuasive. Shak."]
  },
  {
    "word": "HONEY-TONGUED",
    "definitions": ["Sweet speaking; persuasive; seductive. Shak."]
  },
  {
    "word": "HORROR-STRUCK",
    "definitions": ["Horror-stricken; horrified. M. Arnold."]
  },
  {
    "word": "HUCKLE-BACKED",
    "definitions": ["Round-shoulded."]
  },
  {
    "word": "HUGGER-MUGGER",
    "definitions": [
      "Secret; clandestine; sly.",
      "Confused; disorderly; slovenly; mean; as, hugger-mugger doings."
    ]
  },
  {
    "word": "HYDRA-TAINTED",
    "definitions": ["Dipped in the gall of the fabulous hydra; poisonous; deadly. Cowper."]
  },
  {
    "word": "INCITO-MOTORY",
    "definitions": ["Incitomotor."]
  },
  {
    "word": "INDO-EUROPEAN",
    "definitions": [
      "Aryan; -- applied to the languages of India and Europe which are derived from the prehistoric Aryan language; also, pertaining to the people or nations who speak these languages; as, the Indo- European or Aryan family. The common origin of the Indo-European nations. Tylor."
    ]
  },
  {
    "word": "INDO-GERMANIC",
    "definitions": [
      "Same as Aryan, and Indo-European.",
      "Pertaining to or denoting the Teutonic family of languages as related to the Sanskrit, or derived from the ancient Aryan language."
    ]
  },
  {
    "word": "JOURNEY-BATED",
    "definitions": ["Worn out with journeying. [Obs.] Shak."]
  },
  {
    "word": "JUDAS-COLORED",
    "definitions": [
      "Red; -- from a tradition that Judas Iscariot had red hair and beard. There's treachery in that Judas-colored beard. Dryden."
    ]
  },
  {
    "word": "KICKSY-WICKSY",
    "definitions": ["Fantastic; restless; as, kicksy-wicksy flames. Nares."]
  },
  {
    "word": "KNEE-CROOKING",
    "definitions": ["Obsequious; fawning; cringing. \"Knee-crooking knave.\" Shak."]
  },
  {
    "word": "LANTERN-JAWED",
    "definitions": ["Having lantern jaws or long, thin jaws; as, a lantern-jawed person."]
  },
  {
    "word": "LARGE-HEARTED",
    "definitions": [
      "Having a large or generous heart or disposition; noble; liberal.  -- Large\"-heart`ed*ness, n."
    ]
  },
  {
    "word": "LEG-OF-MUTTON",
    "definitions": [
      "Having the general shape or outline of a leg of mutton; as, a leg-of-mutton, or shoulder-of-mutton, sail."
    ]
  },
  {
    "word": "LEGO-LITERARY",
    "definitions": ["Pertaining to the literature of law."]
  },
  {
    "word": "LIGHT-HEARTED",
    "definitions": [
      "Free from grief or anxiety; gay; cheerful; merry.  -- Light\"-heart`ed*ly, adv.  -- Light\"-heart\"ed*ness, n."
    ]
  },
  {
    "word": "LINEAR-SHAPED",
    "definitions": ["Of a linear shape."]
  },
  {
    "word": "LIVER-COLORED",
    "definitions": ["Having a color like liver; dark reddish brown."]
  },
  {
    "word": "LONG-BREATHED",
    "definitions": ["Having the power of retaining the breath for a long time; long- winded."]
  },
  {
    "word": "LOW-THOUGHTED",
    "definitions": ["Having one's thoughts directed toward mean or insignificant subjects."]
  },
  {
    "word": "MALE-SPIRITED",
    "definitions": ["Having the spirit of a male; vigorous; courageous. [R.] B. Jonson."]
  },
  {
    "word": "MEALY-MOUTHED",
    "definitions": [
      "Using soft words; plausible; affectedly or timidly delicate of speech; unwilling to tell the truth in plain language. \"Mealy-mouthed philanthropies.\" Tennyson. She was a fool to be mealy-mouthed where nature speaks so plain. L'Estrange. -- Meal\"y-mouth`ness, n."
    ]
  },
  {
    "word": "MEAN-SPIRITED",
    "definitions": ["Of a mean spirit; base; groveling.  -- Mean\"-spir`it*ed*ness, n."]
  },
  {
    "word": "MEZZO-SOPRANO",
    "definitions": [
      "Having a medium compass between the soprano and contralto; -- said of the voice of a female singer.  -- n.",
      "A mezzo-soprano voice.",
      "A person having such a voice."
    ]
  },
  {
    "word": "MOTLEY-MINDED",
    "definitions": ["Having a mind of a jester; foolish. Shak."]
  },
  {
    "word": "MUDDY-METTLED",
    "definitions": ["Dull-spirited. Shak."]
  },
  {
    "word": "NARROW-MINDED",
    "definitions": ["Of narrow mental scope; illiberal; mean.  -- Nar\"row-mind`ed*ness, n."]
  },
  {
    "word": "NEURO-CENTRAL",
    "definitions": [
      "Between the neural arch and the centrum of a vertebra; as, the neurocentral suture. Huxley."
    ]
  },
  {
    "word": "NON-EPISCOPAL",
    "definitions": ["Not Episcopal; not pertaining to the Episcopal church or system."]
  },
  {
    "word": "OBTUSE-ANGLED",
    "definitions": ["Having an obtuse angle; as, an obtuse-angled triangle."]
  },
  {
    "word": "OLD-FASHIONED",
    "definitions": [
      "Formed according to old or obsolete fashion or pattern; adhering to old customs or ideas; as, an old-fashioned dress, girl. \"Old-fashioned men of wit.\" Addison. This old-fashioned, quaint abode. Longfellow."
    ]
  },
  {
    "word": "PARTY-COLORED",
    "definitions": [
      "Colored with different tints; variegated; as, a party-colored flower. \"Parti-colored lambs.\" Shak."
    ]
  },
  {
    "word": "PEACH-COLORED",
    "definitions": ["Of the color of a peach blossom. \"Peach-colored satin.\" Shak."]
  },
  {
    "word": "PLAIN-DEALING",
    "definitions": ["Practicing plain dealing; artless. See Plain dealing, under Dealing. Shak."]
  },
  {
    "word": "PLAIN-HEARTED",
    "definitions": ["Frank; sincere; artless. Milton.  -- Plain\"-heart`ed*ness, n."]
  },
  {
    "word": "PLANO-CONCAVE",
    "definitions": [
      "Plane or flat on one side, and concave on the other; as, a plano-concave lens. See Lens."
    ]
  },
  {
    "word": "PLANO-CONICAL",
    "definitions": ["Plane or flat on one side, and conical on the other. Grew."]
  },
  {
    "word": "PLATTER-FACED",
    "definitions": ["Having a broad, flat face."]
  },
  {
    "word": "POOR-SPIRITED",
    "definitions": ["Of a mean spirit; cowardly; base.  -- Poor\"-spir`it*ed*ness, n."]
  },
  {
    "word": "POST-TEMPORAL",
    "definitions": [
      "Situated back of the temporal bone or the temporal region of the skull; -- applied especially to a bone which usually connects the supraclavicle with the skull in the pectoral arch of fishes.  -- n.",
      "A post-temporal bone."
    ]
  },
  {
    "word": "POST-TYMPANIC",
    "definitions": ["Situated behind the tympanum, or in the skull, behind the auditory meatus."]
  },
  {
    "word": "POUCH-MOUTHED",
    "definitions": ["Having a pouch mouth; blobber-lipped."]
  },
  {
    "word": "POWDER-POSTED",
    "definitions": ["Affected with dry rot; reduced to dust by rot. See Dry rot, under Dry. [U.S.]"]
  },
  {
    "word": "PRETTY-SPOKEN",
    "definitions": ["Spoken or speaking prettily. [Colloq.]"]
  },
  {
    "word": "PRIEST-RIDDEN",
    "definitions": ["Controlled or oppressed by priests; as, a priest-ridden people. Swift."]
  },
  {
    "word": "PROBE-POINTED",
    "definitions": ["Having a blunt or button-shaped extremity; -- said of cutting instruments."]
  },
  {
    "word": "PUBLIC-MINDED",
    "definitions": ["Public-spirited.  -- Pub\"lic-mind`ed*ness, n."]
  },
  {
    "word": "PUZZLE-HEADED",
    "definitions": ["Having the head full of confused notions. Johnson."]
  },
  {
    "word": "QUICK-SCENTED",
    "definitions": ["Acute of smell."]
  },
  {
    "word": "QUICK-SIGHTED",
    "definitions": [
      "Having quick sight or acute discernment; quick to see or to discern. Locke. --Quick\"-sight`ed*ness, n."
    ]
  },
  {
    "word": "RACKET-TAILED",
    "definitions": ["Having long and spatulate, or racket-shaped, tail feathers."]
  },
  {
    "word": "RATTLE-HEADED",
    "definitions": ["Noisy; giddy; unsteady."]
  },
  {
    "word": "RECTO-UTERINE",
    "definitions": ["Of or pertaining to both the rectum and the uterus."]
  },
  {
    "word": "RECTO-VESICAL",
    "definitions": ["Of or pertaining to both the rectum and the bladder."]
  },
  {
    "word": "RIGHT-HEARTED",
    "definitions": ["Having a right heart or disposition.  -- Right\"-heart`ed*ness, n."]
  },
  {
    "word": "RIGHT-RUNNING",
    "definitions": ["Straight; direct."]
  },
  {
    "word": "RING-STREAKED",
    "definitions": ["Having circular streaks or lines on the body; as, ring-streaked goats."]
  },
  {
    "word": "RIPPLE-MARKED",
    "definitions": ["HAving ripple marks."]
  },
  {
    "word": "ROUGH-GRAINED",
    "definitions": [
      "Having a rough grain or fiber; hence, figuratively, having coarse traits of character; not polished; brisque."
    ]
  },
  {
    "word": "SADDLE-BACKED",
    "definitions": [
      "Having the outline of the upper part concave like the seat of a saddle.",
      "Having a low back and high neck, as a horse."
    ]
  },
  {
    "word": "SADDLE-SHAPED",
    "definitions": ["Shaped like a saddle. Specifically:"]
  },
  {
    "word": "SALVER-SHAPED",
    "definitions": ["Tubular, with a speading border. See Hypocraterimorphous."]
  },
  {
    "word": "SANS-CULOTTIC",
    "definitions": [
      "pertaining to, or involving, sans-culottism; radical; revolutionary; Jacobinical. Carlyle."
    ]
  },
  {
    "word": "SCREW-CUTTING",
    "definitions": ["Adapted for forming a screw by cutting; as, a screw-cutting lathe."]
  },
  {
    "word": "SEA-BORDERING",
    "definitions": ["Bordering on the sea; situated beside the sea. Drayton."]
  },
  {
    "word": "SELF-APPLYING",
    "definitions": ["Applying to or by one's self."]
  },
  {
    "word": "SELF-BANISHED",
    "definitions": ["Exiled voluntarily."]
  },
  {
    "word": "SELF-BEGOTTEN",
    "definitions": ["Begotten by one's self, or one's own powers."]
  },
  {
    "word": "SELF-CENTERED",
    "definitions": [
      "Centered in itself, or in one's self. There hangs the ball of earth and water mixt, Self-centered and unmoved. Dryden."
    ]
  },
  {
    "word": "SELF-DECEIVED",
    "definitions": ["Deceived or misled respecting one's self by one's own mistake or error."]
  },
  {
    "word": "SELF-DEPRAVED",
    "definitions": ["Corrupted or depraved by one's self. Milton."]
  },
  {
    "word": "SELF-EDUCATED",
    "definitions": [
      "Educated by one's own efforts, without instruction, or without pecuniary assistance from others."
    ]
  },
  {
    "word": "SELF-ELECTIVE",
    "definitions": [
      "Having the right of electing one's self, or, as a body, of electing its own members."
    ]
  },
  {
    "word": "SELF-EXISTENT",
    "definitions": [
      "Existing of or by himself,independent of any other being or cause; -- as, God is the only self-existent being."
    ]
  },
  {
    "word": "SELF-GLORIOUS",
    "definitions": ["Springing from vainglory or vanity; vain; boastful. Dryden."]
  },
  {
    "word": "SELF-IGNORANT",
    "definitions": ["Ignorant of one's self."]
  },
  {
    "word": "SELF-LUMINOUS",
    "definitions": ["Possessing in itself the property of emitting light. Sir D. Brewster."]
  },
  {
    "word": "SELF-POSITING",
    "definitions": [
      "The act of disposing or arranging one's self or itself. The self-positing of the molecules. R. Watts."
    ]
  },
  {
    "word": "SELF-REPROVED",
    "definitions": ["Reproved by one's own conscience or one's own sense of guilt."]
  },
  {
    "word": "SEMI-PELAGIAN",
    "definitions": ["Of or pertaining to the Semi-Pelagians, or their tenets."]
  },
  {
    "word": "SHALLOW-PATED",
    "definitions": ["Shallow-brained."]
  },
  {
    "word": "SHARP-SIGHTED",
    "definitions": [
      "Having quick or acute sight; -- used literally and figuratively.  -- Sharp`-sight`ed*ness, n."
    ]
  },
  {
    "word": "SHEATH-WINGED",
    "definitions": ["Having elytra, or wing cases, as a beetle."]
  },
  {
    "word": "SHORT-JOINTED",
    "definitions": [
      "Having short intervals between the joints; -- said of a plant or an animal, especially of a horse whose pastern is too short."
    ]
  },
  {
    "word": "SHORT-WAISTED",
    "definitions": ["Having a short waist."]
  },
  {
    "word": "SHRILL-GORGED",
    "definitions": ["Having a throat which produces a shrill note. [R.] Shak."]
  },
  {
    "word": "SILK-STOCKING",
    "definitions": [
      "Wearing silk stockings (which among men were formerly worn chiefly by the luxurious or aristocratic); hence, elegantly dressed; aristocratic; luxurious; -- chiefly applied to men, often by way of reproach."
    ]
  },
  {
    "word": "SIMPLE-MINDED",
    "definitions": [
      "Artless; guileless; simple-hearted; undesigning; unsuspecting; devoid of duplicity. Blackstone.  -- Sim\"ple-mind`ed*ness, n."
    ]
  },
  {
    "word": "SINGLE-ACTING",
    "definitions": [
      "Having simplicity of action; especially (Mach.), acting or exerting force during strokes in one direction only; -- said of a reciprocating engine, pump, etc."
    ]
  },
  {
    "word": "SINGLE-HANDED",
    "definitions": ["Having but one hand, or one workman; also, alone; unassisted."]
  },
  {
    "word": "SINGLE-MINDED",
    "definitions": ["Having a single purpose; hence, artless; guileless; single- hearted."]
  },
  {
    "word": "SLEEP-CHARGED",
    "definitions": ["Heavy with sleep."]
  },
  {
    "word": "SMOOTH-SPOKEN",
    "definitions": ["Speaking smoothly; plausible; flattering; smooth-tongued."]
  },
  {
    "word": "SODDEN-WITTED",
    "definitions": ["Heavy; dull. Shak."]
  },
  {
    "word": "SPLIT-TONGUED",
    "definitions": ["Having a forked tongue, as that of snakes and some lizards."]
  },
  {
    "word": "SQUARE-RIGGED",
    "definitions": [
      "Having the sails extended upon yards suspended horizontally by the middle, as distinguished from fore-and-aft sails; thus, a ship and a brig are square-rigged vessels."
    ]
  },
  {
    "word": "STANDARD-BRED",
    "definitions": [
      "Bred in conformity to a standard. Specif., applied to a registered trotting horse which comes up to the standard adopted by the National Association of Trotting-horse Breeders. [U. S.]"
    ]
  },
  {
    "word": "STAR-SPANGLED",
    "definitions": [
      "Spangled or studded with stars. Star-spangled banner, the popular name for the national ensign of the United States. F. S. Key."
    ]
  },
  {
    "word": "STEM-CLASPING",
    "definitions": ["Embracing the stem with its base; amplexicaul; as a leaf or petiole."]
  },
  {
    "word": "STEREO-CHEMIC",
    "definitions": [
      "Pertaining to, or illustrating, the hypothetical space relations of atoms in the molecule; as, a stereo-chemic formula."
    ]
  },
  {
    "word": "STIFF-HEARTED",
    "definitions": ["Obstinate; stubborn; contumacious. Ezek. ii. 4."]
  },
  {
    "word": "STILL-CLOSING",
    "definitions": ["Ever closing. [Obs.] \"Still-clothing waters.\" Shak."]
  },
  {
    "word": "STONE-HEARTED",
    "definitions": ["Hard-hearted; cruel; pitiless; unfeeling."]
  },
  {
    "word": "STORY-TELLING",
    "definitions": [
      "Being accustomed to tell stories.  -- n.",
      "The act or practice of telling stories."
    ]
  },
  {
    "word": "STOUT-HEARTED",
    "definitions": ["Having a brave heart; courageous.  -- Stout\"-heart\"ed*ness, n."]
  },
  {
    "word": "STRAIT-HANDED",
    "definitions": ["Parsimonious; sparing; niggardly. [R.] -- Strait\"-hand`ed*ness, n. [R.]"]
  },
  {
    "word": "STRAW-COLORED",
    "definitions": ["Being of a straw color. See Straw color, under Straw, n."]
  },
  {
    "word": "STRONG-MINDED",
    "definitions": [
      "Having a vigorous mind; esp., having or affecting masculine qualities of mind; -- said of women.  -- Strong\"-mind`ed*ness, n."
    ]
  },
  {
    "word": "SUPRA-ANGULAR",
    "definitions": ["See Surangular."]
  },
  {
    "word": "SUPRA-ETHMOID",
    "definitions": ["Above, or on the dorsal side of, the ethmoid bone or cartilage."]
  },
  {
    "word": "SWEET-SCENTED",
    "definitions": [
      "Having a sweet scent or smell; fragrant. Sweet-scented shrub (Bot.), a shrub of the genus Calycanthus, the flowers of which, when crushed, have a fragrance resembling that of strawberries."
    ]
  },
  {
    "word": "TENDER-HEFTED",
    "definitions": ["Having great tenderness; easily moved. [Obs.] Shak."]
  },
  {
    "word": "THICK-SKINNED",
    "definitions": ["Having a thick skin; hence, not sensitive; dull; obtuse. Holland."]
  },
  {
    "word": "THICK-SKULLED",
    "definitions": ["Having a thick skull; hence, dull; heavy; stupid; slow to learn."]
  },
  {
    "word": "THIRTY-SECOND",
    "definitions": [
      "Being one of thirty-two equal parts into which anything is divided. Thirty-second note (Mus.), the thirty-second part of a whole note; a demi-semiquaver."
    ]
  },
  {
    "word": "THREAD-SHAPED",
    "definitions": ["Having the form of a thread; filiform."]
  },
  {
    "word": "THREE-POINTED",
    "definitions": ["Having three acute or setigerous points; tricuspidate."]
  },
  {
    "word": "THREE-QUARTER",
    "definitions": [
      "Measuring thirty inches by twenty-five; -- said of portraitures. Three-quarter length, a portrait showing the figure to the hips only."
    ]
  },
  {
    "word": "TICKLE-FOOTED",
    "definitions": ["Uncertain; inconstant; slippery. [Obs. & R.] Beau. & Fl."]
  },
  {
    "word": "TONGUE-SHAPED",
    "definitions": [
      "Shaped like a tongue; specifically (Bot.), linear or oblong, and fleshy, blunt at the end, and convex beneath; as, a tongue-shaped leaf."
    ]
  },
  {
    "word": "TRIPLE-HEADED",
    "definitions": ["Having three heads; three-headed; as, the triple-headed dog Cerberus."]
  },
  {
    "word": "TROUT-COLORED",
    "definitions": ["White, with spots of black, bay, or sorrel; as, a trout-colored horse."]
  },
  {
    "word": "TURKO-IRANIAN",
    "definitions": [
      "Designating, or pert. to, a mixed racial type including the Afghans, and characterized chiefly by stature above mean, fair complexion, dark, or sometimes gray, eyes, brachycephaly, and very long, prominent, and moderately narrow nose."
    ]
  },
  {
    "word": "TURTLE-FOOTED",
    "definitions": ["Slow-footed. [R.] \"Turtle-footed Peace.\" Ford."]
  },
  {
    "word": "TWENTY-FOURMO",
    "definitions": [
      "Having twenty-four leaves to a sheet; as, a twenty-fourmo form, book, leaf, size, etc.  -- n.",
      "A book composed of sheets, each of which is folded into twenty- four leaves; hence, indicating more or less definitely a size of book whose sheets are so folded; -- usually written 24mo, or 24º."
    ]
  },
  {
    "word": "VEGETO-ANIMAL",
    "definitions": [
      "Partaking of the nature both of vegetable and animal matter; -- a term sometimes applied to vegetable albumen and gluten, from their resemblance to similar animal products."
    ]
  },
  {
    "word": "VULVO-UTERINE",
    "definitions": ["Pertaining both to the vulva and the uterus."]
  },
  {
    "word": "WEAL-BALANCED",
    "definitions": ["Balanced or considered with reference to public weal. [Obs.] Shak."]
  },
  {
    "word": "WEATHER-BOUND",
    "definitions": [
      "Kept in port or at anchor by storms; delayed by bad weather; as, a weather-bound vessel."
    ]
  },
  {
    "word": "WELL-INFORMED",
    "definitions": [
      "Correctly informed; provided with information; well furnished with authentic knowledge; intelligent."
    ]
  },
  {
    "word": "WELL-MANNERED",
    "definitions": ["Polite; well-bred; complaisant; courteous. Dryden."]
  },
  {
    "word": "WELL-PLIGHTED",
    "definitions": ["Being well folded. [Obs.] \"Her well-plighted frock.\" Spenser."]
  },
  {
    "word": "WHITE-FRONTED",
    "definitions": [
      "Having a white front; as, the white-fronted lemur. White- fronted goose (Zoöl.), the white brant, or snow goose. See Snow goose, under Snow."
    ]
  },
  {
    "word": "WHITE-LIVERED",
    "definitions": [
      "Having a pale look; feeble; hence, cowardly; pusillanimous; dastardly. They must not be milksops, nor white-livered knights. Latimer."
    ]
  },
  {
    "word": "WINTER-BEATEN",
    "definitions": ["Beaten or harassed by the severe weather of winter. Spenser."]
  },
  {
    "word": "ANGLO-CATHOLIC",
    "definitions": [
      "Of or pertaining to a church modeled on the English Reformation; Anglican; -- sometimes restricted to the ritualistic or High Church section of the Church of England."
    ]
  },
  {
    "word": "ANGULO-DENTATE",
    "definitions": ["Angularly toothed, as certain leaves."]
  },
  {
    "word": "ANOTHER-GAINES",
    "definitions": ["Of another kind. [Obs.] Sir P. Sidney."]
  },
  {
    "word": "BLOBBER-LIPPED",
    "definitions": ["Having thick lips. \"A blobber-lipped shell.\" Grew."]
  },
  {
    "word": "BLOOD-BOLTERED",
    "definitions": [
      "Having the hair matted with clotted blood. [Obs. & R.] The blood-boltered Banquo smiles upon me. Shak."
    ]
  },
  {
    "word": "BREECH-LOADING",
    "definitions": ["Receiving the charge at the breech instead of at the muzzle."]
  },
  {
    "word": "BRISTLE-SHAPED",
    "definitions": ["Resembling a bristle in form; as, a bristle-shaped leaf."]
  },
  {
    "word": "BROKEN-BELLIED",
    "definitions": ["Having a ruptured belly. [R.]"]
  },
  {
    "word": "BROKEN-HEARTED",
    "synonyms": ["disconsolable", "heart-broken", "inconsolable", "comfortless", "woe- begone"],
    "definitions": [
      "Having the spirits depressed or crushed by grief or despair. She left her husband almost broken-hearted. Macaulay."
    ]
  },
  {
    "word": "BUCKLER-HEADED",
    "definitions": ["Having a head like a buckler."]
  },
  {
    "word": "CATER-CORNERED",
    "definitions": ["Diagonal. [Colloq.]"]
  },
  {
    "word": "CEREBRO-SPINAL",
    "definitions": [
      "Of or pertaining to the central nervous system consisting of the brain and spinal cord. Cerebro-spinal fluid (Physiol.), a serous fluid secreted by the membranes covering the brain and spinal cord.  -- Cerebro-spinal meningitis, Cerebro-spinal fever (Med.), a dangerous epidemic, and endemic, febrile disease, characterized by inflammation of the membranes of the brain and spinal cord, giving rise to severe headaches, tenderness of the back of the neck, paralysis of the ocular muscles, etc. It is sometimes marked by a cutaneous eruption, when it is often called spotted fever. It is not contagious."
    ]
  },
  {
    "word": "CINQUE-SPOTTED",
    "definitions": ["Five-spotted. [R.] Shak."]
  },
  {
    "word": "CLEAN-TIMBERED",
    "definitions": ["Well-propotioned; symmetrical. [Poetic] Shak."]
  },
  {
    "word": "CLINCHER-BUILT",
    "definitions": ["See Clinker-built."]
  },
  {
    "word": "COARSE-GRAINED",
    "definitions": ["Having a coarse grain or texture, as wood; hence, wanting in refinement."]
  },
  {
    "word": "CONCAVO-CONVEX",
    "definitions": [
      "Concave on one side and convex on the other, as an eggshell or a crescent.",
      "Specifically, having such a combination of concave and convex sides as makes the focal axis the shortest line between them. See Illust. under Lens."
    ]
  },
  {
    "word": "CONVEXO-CONVEX",
    "definitions": ["Convex on botConvex, a."]
  },
  {
    "word": "DIAMOND-SHAPED",
    "definitions": ["Shaped like a diamond or rhombus."]
  },
  {
    "word": "DIRECT-COUPLED",
    "definitions": ["Coupled without intermediate connections, as an engine and a dynamo."]
  },
  {
    "word": "DOUBLE-TONGUED",
    "definitions": [
      "Making contrary declarations on the same subject; deceitful. Likewise must the deacons be grave, not double-tongued. 1 Tim. iii. 8."
    ]
  },
  {
    "word": "DRAGGLE-TAILED",
    "definitions": ["Untidy; sluttish; slatternly. W. Irving."]
  },
  {
    "word": "EARTHLY-MINDED",
    "definitions": [
      "Having a mind devoted to earthly things; worldly-minded; -- opposed to spiritual-minded.  -- Earth\"ly-mind`ed*ness, n."
    ]
  },
  {
    "word": "ELECTRO-METRIC",
    "definitions": [
      "Pertaining to electrometry; made by means of electrometer; as, an electrometrical experiment."
    ]
  },
  {
    "word": "ELECTRO-MOTIVE",
    "definitions": [
      "Producing electro-motion; producing, or tending to produce, electricity or an electric current; causing electrical action or effects. Electro-motive force (Physics), the force which produces, or tends to produce, electricity, or an electric current; sometimes used to express the degree of electrification as equivalent to potential, or more properly difference of potential."
    ]
  },
  {
    "word": "EXTRA-OFFICIAL",
    "definitions": ["Not prescribed by official duty."]
  },
  {
    "word": "FEATHER-HEADED",
    "definitions": ["Giddy; frivolous; foolish. [Colloq.] G. Eliot."]
  },
  {
    "word": "FEATHER-HEELED",
    "definitions": ["Light-heeled; gay; frisky; frolicsome. [Colloq.]"]
  },
  {
    "word": "FEATHER-VEINED",
    "definitions": ["Having the veins (of a leaf) diverging from the two sides of a midrib."]
  },
  {
    "word": "GEMELLIPA-ROUS",
    "definitions": ["Producing twins. [R.] Bailey."]
  },
  {
    "word": "GENTLE-HEARTED",
    "definitions": ["Having a kind or gentle disposition. Shak.  -- Gen\"tle-heart`ed*ness, n."]
  },
  {
    "word": "HALBERD-SHAPED",
    "definitions": ["Hastate."]
  },
  {
    "word": "HAMMER-DRESSED",
    "definitions": [
      "Having the surface roughly shaped or faced with the stonecutter's hammer; -- said of building stone."
    ]
  },
  {
    "word": "HIGH-STOMACHED",
    "definitions": ["Having a lofty spirit; haughty. [Obs.] Shak."]
  },
  {
    "word": "HOLLOW-HEARTED",
    "synonyms": ["faithless", "dishonest", "false", "treacherous."],
    "definitions": [
      "Insincere; deceitful; not sound and true; having a cavity or decayed spot within."
    ]
  },
  {
    "word": "HORROR-STICKEN",
    "definitions": ["Struck with horror; horrified. Blank and horror-stricken faces. C. Kingsley."]
  },
  {
    "word": "HYDRO-ELECTRIC",
    "definitions": [
      "Pertaining to, employed in, or produced by, the evolution of electricity by means of a battery in which water or steam is used. Hydro-electric machine (Physics), an apparatus invented by Sir William Armstrong of England for generating electricity by the escape of high-pressure steam from a series of jets connected with a strong boiler, in which the steam is produced."
    ]
  },
  {
    "word": "INFRA-AXILLARY",
    "definitions": ["Situated below the axil, as a bud."]
  },
  {
    "word": "LIGHT-FINGERED",
    "definitions": [
      "Dexterous in taking and conveying away; thievish; pilfering; addicted to petty thefts. Fuller."
    ]
  },
  {
    "word": "LINSEY-WOOLSEY",
    "definitions": [
      "Made of linen and wool; hence, of different and unsuitable parts; mean. Johnson."
    ]
  },
  {
    "word": "MATTER-OF-FACT",
    "definitions": [
      "Adhering to facts; not turning aside from absolute realities; not fanciful or imaginative; commonplace; dry."
    ]
  },
  {
    "word": "MICRO-CHEMICAL",
    "definitions": ["Of or pertaining to micro-chemistry; as, a micro-chemical test."]
  },
  {
    "word": "MULBERRY-FACED",
    "definitions": ["Having a face of a mulberry color, or blotched as if with mulberry stains."]
  },
  {
    "word": "MUZZLE-LOADING",
    "definitions": ["Receiving its charge through the muzzle; as, a muzzle-loading rifle."]
  },
  {
    "word": "NEEDLE-POINTED",
    "definitions": ["Pointed as needles."]
  },
  {
    "word": "NEO-MALTHUSIAN",
    "definitions": [
      "Designating, or pertaining to, a group of modern economists who hold to the Malthusianism doctrine that permanent betterment of the general standard of living is impossible without decrease of competition by limitation of the number of births. -- Ne`o- Mal*thu\"sian, Ne`o-Mal*thu\"sian*ism, n."
    ]
  },
  {
    "word": "NEO-SCHOLASTIC",
    "definitions": ["Of or pert. to Neo-Scholasticism."]
  },
  {
    "word": "NIGHT-BLOOMING",
    "definitions": ["Blooming in the night. Night-blooming cereus. (Bot.) See Note under Cereus."]
  },
  {
    "word": "OBLIQUE-ANGLED",
    "definitions": ["Having oblique angles; as, an oblique-angled triangle."]
  },
  {
    "word": "OUT-OF-THE-WAY",
    "definitions": ["See under Out, adv."]
  },
  {
    "word": "OVATE-SUBULATE",
    "definitions": ["Having an ovate form, but with a subulate tip or extremity."]
  },
  {
    "word": "PANIC-STRICKEN",
    "definitions": ["Struck with a panic, or sudden fear. Burke."]
  },
  {
    "word": "PHOTO-ELECTRIC",
    "definitions": [
      "Acting by the operation of both light and electricity; -- said of apparatus for producing pictures by electric light."
    ]
  },
  {
    "word": "PHOTO-ELECTRIC",
    "definitions": ["Pert. to, or capable of developing, photo-electricity."]
  },
  {
    "word": "PIGEON-HEARTED",
    "definitions": ["Timid; easily frightened; chicken-hearted. Beau. & Fl."]
  },
  {
    "word": "PIGEON-LIVERED",
    "definitions": ["Pigeon-hearted."]
  },
  {
    "word": "PLANE-PARALLEL",
    "definitions": ["Having opposite surfaces exactly plane and parallel, as a piece of glass."]
  },
  {
    "word": "PLANO-SUBULATE",
    "definitions": ["Smooth and awl-shaped. See Subulate."]
  },
  {
    "word": "PUBLIC-HEARTED",
    "definitions": ["Public-spirited. [R.]"]
  },
  {
    "word": "PUDDING-HEADED",
    "definitions": ["Stupid. [Colloq.]"]
  },
  {
    "word": "RADIATE-VEINED",
    "definitions": [
      "Having the principal veins radiating, or diverging, from the apex of the petiole; -- said of such leaves as those of the grapevine, most maples, and the castor-oil plant."
    ]
  },
  {
    "word": "RATTLE-BRAINED",
    "definitions": ["Giddy; rattle-headed."]
  },
  {
    "word": "RHOMBOID-OVATE",
    "definitions": ["Between rhomboid and ovate, or oval, in shape."]
  },
  {
    "word": "SECOND-SIGHTED",
    "definitions": ["Having the power of second-sight. Addison."]
  },
  {
    "word": "SECRETO-MOTORY",
    "definitions": [
      "Causing secretion; -- said of nerves which go to glands and influence secretion."
    ]
  },
  {
    "word": "SELF-ADJUSTING",
    "definitions": [
      "Capable of assuming a desired position or condition with relation to other parts, under varying circumstances, without requiring to be adjusted by hand; -- said of a piece in machinery. Self-adjusting bearing (Shafting), a bearing which is supported in such a manner that it may tip to accomodate flexure or displacement of the shaft."
    ]
  },
  {
    "word": "SELF-APPROVING",
    "definitions": [
      "Approving one's own action or character by one's own judgment. One self-approving hour whole years outweighs Of stupid starers and of loud huzzas. Pope."
    ]
  },
  {
    "word": "SELF-ASSERTING",
    "definitions": [
      "asserting one's self, or one's own rights or claims; hence, putting one's self forward in a confident or assuming manner."
    ]
  },
  {
    "word": "SELF-ASSERTIVE",
    "definitions": ["Disposed to self-assertion; self-asserting."]
  },
  {
    "word": "SELF-CENTERING",
    "definitions": ["Centering in one's self."]
  },
  {
    "word": "SELF-CONCEITED",
    "definitions": [
      "Having an overweening opinion of one's own powers, attainments; vain; conceited.  -- Self`-con*ceit\"ed*ness, n."
    ]
  },
  {
    "word": "SELF-CONFIDENT",
    "definitions": [
      "Confident of one's own strength or powers; relying on one's judgment or ability; self-reliant.  -- Self`-con\"fi*dent*ly, adv."
    ]
  },
  {
    "word": "SELF-CONJUGATE",
    "definitions": [
      "Having the two things that are conjugate parts of the same figure; as, self-conjugate triangles."
    ]
  },
  {
    "word": "SELF-CONSCIOUS",
    "definitions": [
      "Conscious of one's acts or state as belonging to, or originating in, one's self. \"My self-conscious worth.\" Dryden.",
      "Conscious of one's self as an object of the observation of others; as, the speaker was too self-conscious."
    ]
  },
  {
    "word": "SELF-CONSUMING",
    "definitions": ["Consuming one's self or itself."]
  },
  {
    "word": "SELF-CONTAINED",
    "definitions": [
      "Having self-control; reserved; uncommunicative; wholly engrossed in one's self.",
      "Having all the essential working parts connected by a bedplate or framework, or contained in a case, etc., so that mutual relations of the parts do not depend upon fastening outside of the machine itself. Self-contained steam engine. (a) A steam engine having both bearings for the crank shaft attached to the frame of the engine. (b) A steam engine and boiler combined and fastened together; a portable steam engine."
    ]
  },
  {
    "word": "SELF-CONVICTED",
    "definitions": ["Convicted by one's own consciousness, knowledge, avowal, or acts."]
  },
  {
    "word": "SELF-DEFENSIVE",
    "definitions": ["Defending, or tending to defend, one's own person, property, or reputation."]
  },
  {
    "word": "SELF-DEPENDENT",
    "definitions": ["Dependent on one's self; self-depending; self-reliant."]
  },
  {
    "word": "SELF-DEPENDING",
    "definitions": ["Depending on one's self."]
  },
  {
    "word": "SELF-DEVOURING",
    "definitions": ["Devouring one's self or itself. Danham."]
  },
  {
    "word": "SELF-DIFFUSIVE",
    "definitions": ["Having power to diffuse itself; diffusing itself. Norris."]
  },
  {
    "word": "SELF-HARDENING",
    "definitions": [
      "Designating, or pert. to, any of various steels that harden when heated to above a red heat and cooled in air, usually in a blast of cold air with moderate rapidity, without quenching. Such steels are alloys of iron and carbon with manganese, tungsten and manganese, chromium, molybdenum and manganese, etc. They are chiefly used as high-speed steels. -- Self`-hard\"en*ed, a."
    ]
  },
  {
    "word": "SELF-IMPARTING",
    "definitions": ["Imparting by one's own, or by its own, powers and will. Norris."]
  },
  {
    "word": "SELF-IMPORTANT",
    "definitions": ["Having or manifesting an exaggerated idea of one's own importance or merit."]
  },
  {
    "word": "SELF-INDULGENT",
    "definitions": ["Indulging one's appetites, desires, etc., freely."]
  },
  {
    "word": "SELF-OPINIONED",
    "definitions": ["Having a high opinion of one's self; opinionated; conceited. South."]
  },
  {
    "word": "SELF-PERPLEXED",
    "definitions": ["Perplexed by doubts originating in one's own mind."]
  },
  {
    "word": "SELF-POSSESSED",
    "definitions": ["Composed or tranquill in mind, manner, etc.; undisturbed."]
  },
  {
    "word": "SELF-REGULATED",
    "definitions": ["Regulated by one's self or by itself."]
  },
  {
    "word": "SELF-REPELLING",
    "definitions": [
      "Made up of parts, as molecules or atoms, which mutually repel each other; as, gases are self-repelling."
    ]
  },
  {
    "word": "SELF-REPROVING",
    "definitions": ["Reproving one's self; reproving by consciousness of guilt."]
  },
  {
    "word": "SELF-REPUGNANT",
    "definitions": ["Self-contradictory; inconsistent. Brougham."]
  },
  {
    "word": "SELF-REPULSIVE",
    "definitions": ["Self-repelling."]
  },
  {
    "word": "SELF-RIGHTEOUS",
    "definitions": ["Righteous in one's own esteem; pharisaic."]
  },
  {
    "word": "SELF-SATISFIED",
    "definitions": ["Satisfied with one's self or one's actions; self-complacent."]
  },
  {
    "word": "SELF-SUFFICING",
    "definitions": [
      "Sufficing for one's self or for itself, without needing external aid; self-sufficient.  -- Self`-suf*fi\"cing*ness, n. J. C. Shairp."
    ]
  },
  {
    "word": "SELF-SUSPENDED",
    "definitions": ["Suspended by one's self or by itself; balanced. Southey."]
  },
  {
    "word": "SHALLOW-BODIED",
    "definitions": ["Having a moderate depth of hold; -- said of a vessel."]
  },
  {
    "word": "SHORT-BREATHED",
    "definitions": ["Having short-breath, or quick respiration.", "Having short life."]
  },
  {
    "word": "SHRILL-TONGUED",
    "definitions": ["Having a shrill voice. \"When shrill-tongued Fulvia scolds.\" Shak."]
  },
  {
    "word": "SIMPLE-HEARTED",
    "definitions": ["Sincere; inguenuous; guileless. Sir W. Scott."]
  },
  {
    "word": "SINGLE-HEARTED",
    "definitions": ["Having an honest heart; free from duplicity.  -- Sin\"gle-heart\"ed*ly, adv."]
  },
  {
    "word": "SMOOTH-CHINNED",
    "definitions": ["Having a smooth chin; beardless. Drayton."]
  },
  {
    "word": "SMOOTH-TONGUED",
    "definitions": ["Having a smooth tongue; plausible; flattering."]
  },
  {
    "word": "SPINDLE-LEGGED",
    "definitions": ["Having long, slender legs."]
  },
  {
    "word": "SPINDLE-SHAPED",
    "definitions": [
      "Having the shape of a spindle.",
      "Thickest in the middle, and tapering to both ends; fusiform; -- applied chiefly to roots."
    ]
  },
  {
    "word": "STRAIGHT-JOINT",
    "definitions": [
      "Having straight joints. Specifically:",
      "Applied to a floor the boards of which are so laid that the joints form a continued line transverse to the length of the boards themselves. Brandle & C.",
      "In the United States, applied to planking or flooring put together without the tongue and groove, the pieces being laid edge to edge."
    ]
  },
  {
    "word": "STRAIGHT-LINED",
    "definitions": ["Having straight lines."]
  },
  {
    "word": "STRAIGHT-PIGHT",
    "definitions": ["Straight in form or upright in position; erect. [Obs.] Shak."]
  },
  {
    "word": "SUPPLE-CHAPPED",
    "definitions": ["Having a limber tongue. [R.] \"A supple-chapped flatterer.\" Marston."]
  },
  {
    "word": "SUPRA-ACROMIAL",
    "definitions": ["Situated above the acromial process of the scapula."]
  },
  {
    "word": "SUPRA-AXILLARY",
    "definitions": [
      "Growing above the axil; inserted above the axil, as a peduncle. See Suprafoliaceous."
    ]
  },
  {
    "word": "SWALLOW-TAILED",
    "definitions": [
      "Having a tail like that of a swallow; hence, like a swallow's tail in form; having narrow and tapering or pointed skirts; as, a swallow- tailed coat.",
      "United by dovetailing; dovetailed. Swallow-tailed duck (Zoöl.), the old squaw.  -- Swallow-tailed gull (Zoöl.), an Arctic gull (Xema furcata), which has a deeply forked tail.  -- Swallow-tailed hawk or kite (Zoöl.), the fork-tailed kite.  -- Swallow-tailed moth (Zoöl.), a European moth (Urapteryx sambucaria) having tail-like lobes on the hind wings."
    ]
  },
  {
    "word": "SWEET-BREASTED",
    "definitions": ["Having a sweet, musical voice, as the nightingale. Cf. Breast, n., 6. [Obs.]"]
  },
  {
    "word": "TENDER-HEARTED",
    "definitions": [
      "Having great sensibility; susceptible of impressions or influence; affectionate; pitying; sensitive.  -- Ten\"der-heart`ed*ly, adv.  -- Ten\"der-heart`ed*ness, n. Rehoboam was young and tender-hearted, and could not withstand them. 2 Chron. xiii. 7. Be ye kind one to another, tender-hearted. Eph. iv. 32."
    ]
  },
  {
    "word": "THREE-CORNERED",
    "definitions": [
      "Having three corners, or angles; as, a three-cornered hat.",
      "Having three prominent longitudinal angles; as, a three- cornered stem."
    ]
  },
  {
    "word": "THREE-FLOWERED",
    "definitions": ["Bearing three flowers together, or only three flowers."]
  },
  {
    "word": "TRAVEL-TAINTED",
    "definitions": ["Harassed; fatigued with travel. [Obs.] Shak."]
  },
  {
    "word": "TRIPLE-CROWNED",
    "definitions": ["Having three crowns; wearing the triple crown, as the pope."]
  },
  {
    "word": "TRUMPET-SHAPED",
    "definitions": ["Tubular with one end dilated, as the flower of the trumpet creeper."]
  },
  {
    "word": "VERTEBRO-ILIAC",
    "definitions": ["Iliolumbar."]
  },
  {
    "word": "VITREO-ELECTIC",
    "definitions": ["Containing or exhibiting positive, or vitreous, electricity."]
  },
  {
    "word": "VOLTA-ELECTRIC",
    "definitions": ["Of or pertaining to voltaic electricity, or voltaism."]
  },
  {
    "word": "WAMBLE-CROPPED",
    "definitions": ["Sick at the stomach; also, crestfallen; dejected. [Slang]"]
  },
  {
    "word": "WATER-STANDING",
    "definitions": ["Tear-filled. [R.] \"Many an orphan's water-standing eye.\" Shak."]
  },
  {
    "word": "WEATHER-BEATEN",
    "definitions": [
      "Beaten or harassed by the weather; worn by exposure to the weather, especially to severe weather. Shak."
    ]
  },
  {
    "word": "WEATHER-BITTEN",
    "definitions": ["Eaten into, defaced, or worn, by exposure to the weather. Coleridge."]
  },
  {
    "word": "WEATHER-DRIVEN",
    "definitions": ["Driven by winds or storms; forced by stress of weather. Carew."]
  },
  {
    "word": "WONDER-WORKING",
    "definitions": ["Doing wonders or surprising things."]
  },
  {
    "word": "WORLDLY-MINDED",
    "definitions": [
      "Devoted to worldly interests; mindful of the affairs of the present life, and forgetful of those of the future; loving and pursuing this world's goods, to the exclusion of piety and attention to spiritual concerns.  -- World\"ly*mind`ed*ness, n."
    ]
  },
  {
    "word": "YELLOW-COVERED",
    "definitions": [
      "Covered or bound in yellow paper. Yellow-covered literature, cheap sensational novels and trashy magazines; -- formerly so called from the usual color of their covers. [Colloq. U. S.] Bartlett."
    ]
  },
  {
    "word": "ABOVE-MENTIONED",
    "definitions": ["Mentioned or named before; aforesaid."]
  },
  {
    "word": "AFTER-MENTIONED",
    "definitions": ["Mentioned afterwards; as, persons after-mentioned (in a writing)."]
  },
  {
    "word": "BRISTLE-POINTED",
    "definitions": ["Terminating in a very fine, sharp point, as some leaves."]
  },
  {
    "word": "BUTTER-FINGERED",
    "definitions": ["Apt to let things fall, or to let them slip away; slippery; careless."]
  },
  {
    "word": "CHICKEN-HEARTED",
    "definitions": ["Timid; fearful; cowardly. Bunyan."]
  },
  {
    "word": "CONCAVO-CONCAVE",
    "definitions": ["Concave or hollow on both sides; double concave."]
  },
  {
    "word": "CONVEXO-CONCAVE",
    "definitions": [
      "Convex on one side, and concave on the other. The curves of the convex and concave sides may be alike or may be different. See Meniscus."
    ]
  },
  {
    "word": "COPPER-BOTTOMED",
    "definitions": [
      "Having a bottom made of copper, as a tin boiler or other vessel, or sheathed with copper, as a ship."
    ]
  },
  {
    "word": "COPPER-FASTENED",
    "definitions": [
      "Fastened with copper bolts, as the planks of ships, etc.; as, a copper-fastened ship."
    ]
  },
  {
    "word": "COUNTER-COMPONY",
    "definitions": ["See Compony."]
  },
  {
    "word": "COUNTER-COURANT",
    "definitions": ["Running in opposite directions; -- said of animals borne in a coast of arms."]
  },
  {
    "word": "COUNTER-SALIENT",
    "definitions": ["Leaping from each other; -- said of two figures on a coast of arms."]
  },
  {
    "word": "CUBO-OCTAHEDRAL",
    "definitions": ["Presenting a combination of a cube and an octahedron."]
  },
  {
    "word": "DENTATE-CILIATE",
    "definitions": ["Having the margin dentate and also ciliate or fringed with hairs."]
  },
  {
    "word": "DENTATE-SINUATE",
    "definitions": ["Having a form intermediate between dentate and sinuate."]
  },
  {
    "word": "DOUBLE-BARRELED",
    "definitions": ["Having two barrels; -- applied to a gun."]
  },
  {
    "word": "DOUBLE-BREASTED",
    "definitions": [
      "Folding or lapping over on the breast, with a row of buttons and buttonholes on each side; as, a double-breasted coat."
    ]
  },
  {
    "word": "DOUBLE-SURFACED",
    "definitions": [
      "Having two surfaces; -- said specif. of aëroplane wings or aërocurves which are covered on both sides with fabric, etc., thus completely inclosing their frames."
    ]
  },
  {
    "word": "DYNAMO-ELECTRIC",
    "definitions": [
      "Pertaining to the development of electricity, especially electrical currents, by power; producing electricity or electrical currents by mechanical power."
    ]
  },
  {
    "word": "EARTHEN-HEARTED",
    "definitions": ["Hard-hearted; sordid; gross. [Poetic] Lowell."]
  },
  {
    "word": "ELECTRO-DYNAMIC",
    "definitions": [
      "Pertaining to the movements or force of electric or galvanic currents; dependent on electric force."
    ]
  },
  {
    "word": "ELECTRO-KINETIC",
    "definitions": ["Of or pertaining to electro-kinetics."]
  },
  {
    "word": "EMETO-CATHARTIC",
    "definitions": ["Producing vomiting and purging at the same time."]
  },
  {
    "word": "FEATHER-BRAINED",
    "definitions": ["Giddy; frivolous; feather-headed. [Colloq.]"]
  },
  {
    "word": "FLOWERY-KIRTLED",
    "definitions": ["Dressed with garlands of flowers. [Poetic & Rare] Milton."]
  },
  {
    "word": "FORCIBLE-FEEBLE",
    "definitions": [
      "Seemingly vigorous, but really weak or insipid. He [Prof. Ayton] would purge his book of much offensive matter, if he struck out epithets which are in the bad taste of the forcible-feeble school. N. Brit. Review."
    ]
  },
  {
    "word": "FORE-TOPGALLANT",
    "definitions": [
      "Designating the mast, sail, yard, etc., above the topmast; as, the fore-topgallant sail. See Sail."
    ]
  },
  {
    "word": "HIGH-PRINCIPLED",
    "definitions": ["Possessed of noble or honorable principles."]
  },
  {
    "word": "HUMP-SHOULDERED",
    "definitions": ["Having high, hunched shoulders. Hawthorne."]
  },
  {
    "word": "KNIGHT-ER-RATIC",
    "definitions": ["Pertaining to a knight-errant or to knight-errantry. [R.] Quart. Rev."]
  },
  {
    "word": "MISCHIEF-MAKING",
    "definitions": [
      "Causing harm; exciting enmity or quarrels. Rowe.  -- n.",
      "The act or practice of making mischief, inciting quarrels, etc."
    ]
  },
  {
    "word": "MUSHROOM-HEADED",
    "definitions": [
      "Having a cylindrical body with a convex head of larger diameter; having a head like that of a mushroom."
    ]
  },
  {
    "word": "NEURO-EPIDERMAL",
    "definitions": [
      "Pertaining to, or giving rise to, the central nervous system and epiderms; as, the neuroepidermal, or epiblastic, layer of the blastoderm."
    ]
  },
  {
    "word": "OEIL-DE-PERDRIX",
    "definitions": [" Having a brownish red color; -- used esp. of light-colored red wine."]
  },
  {
    "word": "OLD-GENTLEMANLY",
    "definitions": ["Pertaining to an old gentleman, or like one. Byron."]
  },
  {
    "word": "OVATE-ACUMINATE",
    "definitions": ["Having an ovate form, but narrowed at the end into a slender point."]
  },
  {
    "word": "OVATE-ROTUNDATE",
    "definitions": [
      "Having a form intermediate between that of an egg and a sphere; roundly ovate."
    ]
  },
  {
    "word": "OVATO-ACUMINATE",
    "definitions": ["Same as Ovate-acuminate."]
  },
  {
    "word": "OVATO-ROTUNDATE",
    "definitions": ["Same as Ovate-rotundate."]
  },
  {
    "word": "PATENT-HAMMERED",
    "definitions": [
      "Having a surface dressed by cutting with a hammer the head of which consists of broad thin chisels clamped together."
    ]
  },
  {
    "word": "PIGEON-BREASTED",
    "definitions": [
      "Having a breast like a pigeon, -- the sternum being so prominent as to constitute a deformity; chicken-breasted."
    ]
  },
  {
    "word": "PLANET-STRICKEN",
    "definitions": [
      "Affected by the influence of planets; blasted. Milton. Like planet-stricken men of yore He trembles, smitten to the core By strong compunction and remorse. Wordsworth."
    ]
  },
  {
    "word": "PLANO-ORBICULAR",
    "definitions": ["Plane or flat on one side, and spherical on the other."]
  },
  {
    "word": "PSEUDO-DIPTERAL",
    "definitions": [
      "Falsely or imperfectly dipteral, as a temple with the inner range of columns surrounding the cella omitted, so that the space between the cella wall and the columns is very great, being equal to two intercolumns and one column.  -- n.",
      "A pseudo-dipteral temple."
    ]
  },
  {
    "word": "PSEUDO-METALLIC",
    "definitions": ["Falsely or imperfectly metallic; -- said of a kind of luster, as in minerals."]
  },
  {
    "word": "PSEUDO-ROMANTIC",
    "definitions": ["Falsely romantic. The false taste, the pseudo-romantic rage. De Quincey."]
  },
  {
    "word": "PUBLIC-SPIRITED",
    "definitions": [
      "Having, or exercising, a disposition to advance the interest of the community or public; as, public-spirited men.",
      "Dictated by a regard to public good; as, a public-spirited project or measure. Addison.  -- Pub\"lic-spir`it*ed*ly, adv.  -- Pub\"lic-spir`it*ed*ness, n."
    ]
  },
  {
    "word": "RESINO-ELECTRIC",
    "definitions": ["Containing or exhibiting resinous electricity."]
  },
  {
    "word": "SCATTER-BRAINED",
    "definitions": ["Giddy; thoughtless."]
  },
  {
    "word": "SCISSORS-TAILED",
    "definitions": [
      "Having the outer feathers much the longest, the others decreasing regularly to the median ones."
    ]
  },
  {
    "word": "SELF-AFFRIGHTED",
    "definitions": ["Frightened at or by one's self. Shak."]
  },
  {
    "word": "SELF-COMPLACENT",
    "definitions": ["Satisfied with one's own character, capacity, and doings; self- satisfied."]
  },
  {
    "word": "SELF-CONSISTENT",
    "definitions": [
      "Consistent with one's self or with itself; not deviation from the ordinary standard by which the conduct is guided; logically consistent throughout; having each part consistent with the rest."
    ]
  },
  {
    "word": "SELF-EXPLAINING",
    "definitions": ["Explaining itself; capable of being understood without explanation."]
  },
  {
    "word": "SELF-FERTILIZED",
    "definitions": ["Fertilized by pollen from the same flower."]
  },
  {
    "word": "SELF-INTERESTED",
    "definitions": ["Particularly concerned for one's own interest or happiness."]
  },
  {
    "word": "SELF-REGULATIVE",
    "definitions": ["Tending or serving to regulate one's self or itself. Whewell."]
  },
  {
    "word": "SELF-REPROACHED",
    "definitions": ["Reproached by one's own conscience or judgment."]
  },
  {
    "word": "SELF-RESTRAINED",
    "definitions": ["Restrained by one's self or itself; restrained by one's own power or will."]
  },
  {
    "word": "SELF-SATISFYING",
    "definitions": ["Giving satisfaction to one's self."]
  },
  {
    "word": "SELF-SUFFICIENT",
    "definitions": [
      "Sufficient for one's self without external aid or coöperation. Neglect of friends can never be proved rational till we prove the person using it omnipotent and self-sufficient, and such as can never need any mortal assistance. South.",
      "Having an overweening confidence in one's own abilities or worth; hence, haughty; overbearing. \"A rash and self-sufficient manner.\" I. Watts."
    ]
  },
  {
    "word": "SELF-SUSPICIOUS",
    "definitions": ["Suspicious or distrustful of one's self. Baxter."]
  },
  {
    "word": "SERPENT-TONGUED",
    "definitions": ["Having a forked tongue, like a serpent."]
  },
  {
    "word": "SHALLOW-BRAINED",
    "definitions": ["Weak in intellect; foolish; empty-headed. South."]
  },
  {
    "word": "SHALLOW-HEARTED",
    "definitions": ["Incapable of deep feeling. Tennyson."]
  },
  {
    "word": "SHALLOW-WAISTED",
    "definitions": [
      "Having a flush deck, or with only a moderate depression amidships; -- said of a vessel."
    ]
  },
  {
    "word": "SHATTER-BRAINED",
    "definitions": ["Disordered or wandering in intellect; hence, heedless; wild. J. Goodman."]
  },
  {
    "word": "SINGLE-BREASTED",
    "definitions": [
      "Lapping over the breast only far enough to permit of buttoning, and having buttons on one edge only; as, a single-breasted coast."
    ]
  },
  {
    "word": "SINGLE-SURFACED",
    "definitions": [
      "Having one surface; -- said specif. of aëroplanes or aërocurves that are covered with fabric, etc., on only one side."
    ]
  },
  {
    "word": "SINISTER-HANDED",
    "definitions": ["Left-handed; hence, unlucky. [Obs.] Lovelace."]
  },
  {
    "word": "SKIMBLE-SCAMBLE",
    "definitions": [
      "Rambling; disorderly; unconnected. [Colloq.] Such a deal of skimble-scamble stuff. Shak."
    ]
  },
  {
    "word": "SPINDLE-SHANKED",
    "definitions": ["Having long, slender legs. Addison."]
  },
  {
    "word": "SPINI-SPIRULATE",
    "definitions": ["Having spines arranged spirally. See Spicule."]
  },
  {
    "word": "STEEPLE-CROWNED",
    "definitions": [
      "Bearing a steeple; as, a steeple-crowned building.",
      "Having a crown shaped like a steeple; as, a steeple-crowned hat; also, wearing a hat with such a crown. This grave, beared, sable-cloaked, and steeple-crowned progenitor. Hawthorne."
    ]
  },
  {
    "word": "STRAIGHT-SPOKEN",
    "definitions": ["Speaking with directness; plain-spoken. [Colloq. U.S.] Lowell."]
  },
  {
    "word": "SUPRA-AURICULAR",
    "definitions": [
      "Situated above the ear coverts, or auriculars; -- said of certain feathers of birds.  -- n.",
      "A supra-auricular feather."
    ]
  },
  {
    "word": "SUPRA-ESOPHAGAL",
    "definitions": [
      "Situated above, or on the dorsal side of, the esophagus; as, the supra-esophageal ganglion of Crustacea. [Written also supra- oesophagal, and supra-oesophageal.]"
    ]
  },
  {
    "word": "TRUMPET-TONGUED",
    "definitions": ["Having a powerful, far-reaching voice or speech."]
  },
  {
    "word": "VASO-INHIBITORY",
    "definitions": ["See Vasodilator."]
  },
  {
    "word": "VENTRO-INGUINAL",
    "definitions": [
      "Pertaining both to the abdomen and groin, or to the abdomen and inguinal canal; as, ventro-inguinal hernia."
    ]
  },
  {
    "word": "VIGESIMO-QUARTO",
    "definitions": [
      "Having twenty-four leaves to a sheet; as, a vigesimo-quarto form, book, leaf, size, etc."
    ]
  },
  {
    "word": "WIND-FERTILIZED",
    "definitions": ["Anemophilous; fertilized by pollen borne by the wind."]
  },
  {
    "word": "AUSTRO-HUNGARIAN",
    "definitions": ["Of or pertaining to the monarchy composed of Austria and Hungary."]
  },
  {
    "word": "BRIGHT-HARNESSED",
    "definitions": ["Having glittering armor. [Poetic] Milton."]
  },
  {
    "word": "CHICKEN-BREASTED",
    "definitions": [
      "Having a narrow, projecting chest, caused by forward curvature of the vertebral column."
    ]
  },
  {
    "word": "COUNTER-COUCHANT",
    "definitions": [
      "Lying down, with their heads in opposite directions; -- said of animals borne in a coat of arms."
    ]
  },
  {
    "word": "ELECTRO-CHEMICAL",
    "definitions": ["Of or pertaining to electro-chemistry. Ure."]
  },
  {
    "word": "ELECTRO-MAGNETIC",
    "definitions": [
      "Of, Pertaining to, or produced by, magnetism which is developed by the passage of an electric current. Electro-magnetic engine, an engine in which the motive force is electro-magnetism.  -- Electro-magnetic theory of light (Physics), a theory of light which makes it consist in the rapid alternation of transient electric currents moving transversely to the direction of the ray."
    ]
  },
  {
    "word": "ELECTRO-MUSCULAR",
    "definitions": [
      "Pertaining the reaction (contraction) of the muscles under electricity, or their sensibility to it."
    ]
  },
  {
    "word": "ELECTRO-NEGATIVE",
    "definitions": [
      "Having the property of being attracted by an electro-positive body, or a tendency to pass to the positive pole in electrolysis, by the law that opposite electricities attract each other.",
      "Negative; nonmetallic; acid; -- opposed to positive, metallic, or basic."
    ]
  },
  {
    "word": "ELECTRO-POSITIVE",
    "definitions": [
      "Of such a nature relatively to some other associated body or bodies, as to tend to the negative pole of a voltaic battery, in electrolysis, while the associated body tends to the positive pole; - - the converse or correlative of electro-negative.",
      "Hence: Positive; metallic; basic; -- distinguished from negative, nonmetallic, or acid."
    ]
  },
  {
    "word": "EXCITO-SECRETORY",
    "definitions": [
      "Exciting secretion; -- said of the influence exerted by reflex action on the function of secretion, by which the various glands are excited to action."
    ]
  },
  {
    "word": "INHIBITORY-MOTOR",
    "definitions": [
      "A term applied to certain nerve centers which govern or restrain subsidiary centers, from which motor impressions issue. McKendrick."
    ]
  },
  {
    "word": "LIENO-INTESTINAL",
    "definitions": [
      "Of or pertaining to the spleen and intestine; as, the lieno- intestinal vein of the frog."
    ]
  },
  {
    "word": "MAGNETO-ELECTRIC",
    "definitions": [
      "Pertaining to, or characterized by, electricity by the action of magnets; as, magneto-electric induction. Magneto-electric machine, a form of dynamo-electric machine in which the field is maintained by permanent steel magnets instead of electro-magnets."
    ]
  },
  {
    "word": "MAXILLO-PALATINE",
    "definitions": [
      "Pertaining to the maxillary and palatine regions of the skull; as, the maxillo-palatine process of the maxilla. Also used as n."
    ]
  },
  {
    "word": "MICRO-GEOLOGICAL",
    "definitions": ["Of or pertaining to micro-geology."]
  },
  {
    "word": "MOON-CULMINATING",
    "definitions": [
      "Culminating, or coming to the meredian, at or about the same time with the moon; -- said of a star or stars, esp. of certain stars selected beforehand, and named in an ephemeris (as the Nautical Almanac), as suitable to be observed in connection with the moon at culmination, for determining terrestrial longitude."
    ]
  },
  {
    "word": "OVATE-LANCEOLATE",
    "definitions": ["Having a form intermediate between ovate and lanceolate."]
  },
  {
    "word": "PLANO-HORIZONTAL",
    "definitions": ["Having a level horizontal surface or position. Lee."]
  },
  {
    "word": "PLEASANT-TONGUED",
    "definitions": ["Of pleasing speech."]
  },
  {
    "word": "PSEUDO-SYMMETRIC",
    "definitions": ["Exhibiting pseudo-symmetry."]
  },
  {
    "word": "QUINTUPLE-NERVED",
    "definitions": ["The same as Quinquenerved."]
  },
  {
    "word": "ROUND-SHOULDERED",
    "definitions": ["Having the shoulders stooping or projecting; round-backed."]
  },
  {
    "word": "SACCULO-COCHLEAR",
    "definitions": ["pertaining to the sacculus and cochlea of the ear."]
  },
  {
    "word": "SELF-ANNIHILATED",
    "definitions": ["Annihilated by one's self."]
  },
  {
    "word": "SELF-CONSIDERING",
    "definitions": ["Considering in one's own mind; deliberating. Pope."]
  },
  {
    "word": "SELF-DESTRUCTIVE",
    "definitions": ["Destroying, or tending to destroy, one's self or itself; rucidal."]
  },
  {
    "word": "SELF-DETERMINING",
    "definitions": ["Capable of self-determination; as, the self-determining power of will."]
  },
  {
    "word": "SELF-ORIGINATING",
    "definitions": ["Beginning wwith, or springing from, one's self."]
  },
  {
    "word": "SELF-PROPAGATING",
    "definitions": ["Propagating by one's self or by itself."]
  },
  {
    "word": "SELF-REGISTERING",
    "definitions": [
      "Registering itself; -- said of any instrument so contrived as to record its own indications of phenomena, whether continuously or at stated times, as at the maxima and minima of variations; as, a self-registering anemometer or barometer."
    ]
  },
  {
    "word": "SELF-REPROACHING",
    "definitions": ["Reproaching one's self.  -- Self`-re*proach\"ing*ly, adv."]
  },
  {
    "word": "SELF-SACRIFICING",
    "definitions": ["Yielding up one's own interest, ffeelings, etc; sacrificing one's self."]
  },
  {
    "word": "SEMI CRUSTACEOUS",
    "definitions": ["Half crustaceous; partially crustaceous."]
  },
  {
    "word": "SHOULDER-SHOTTEN",
    "definitions": ["Sprained in the shoulder, as a horse. Shak."]
  },
  {
    "word": "SPIRITUAL-MINDED",
    "definitions": [
      "Having the mind set on spiritual things, or filled with holy desires and affections.  -- Spir\"it*u*al-mind`ed*ness, n."
    ]
  },
  {
    "word": "SUPRA-OESOPHAGAL",
    "definitions": ["See Supra-esophagal."]
  },
  {
    "word": "THOROUGH-LIGHTED",
    "definitions": [
      "Provided with thorough lights or windows at opposite sides, as a room or building. Gwilt."
    ]
  },
  {
    "word": "WELL-INTENTIONED",
    "definitions": [
      "Having upright intentions or honorable purposes. Dutchmen who had sold themselves to France, as the wellintentioned party. Macaulay."
    ]
  },
  {
    "word": "ELECTRO-BALLISTIC",
    "definitions": ["Pertaining to electro-ballistics."]
  },
  {
    "word": "ELECTRO-CAPILLARY",
    "definitions": ["Pert. to, or caused by, electro-capillarity."]
  },
  {
    "word": "FASHION-MONGERING",
    "definitions": ["Behaving like a fashion-monger. [R.] Shak."]
  },
  {
    "word": "PSEUDO-PERIPTERAL",
    "definitions": [
      "Falsely or imperfectly peripteral, as a temple having the columns at the sides attached to the walls, and an ambulatory only at the ends or only at one end.  -- n.",
      "A pseudo-peripteral temple. Oxf. Gloss."
    ]
  },
  {
    "word": "PSEUDO-PERIPTERAL",
    "definitions": [
      "Falsely or imperfectly peripteral, as a temple having the columns at the sides attached to the walls, and an ambulatory only at the ends or only at one end. -- n.",
      "A pseudo-peripteral temple.  Oxf. Gloss."
    ]
  },
  {
    "word": "QUINQUE FOLIOLATE",
    "definitions": ["Having five leaflets. Gray."]
  },
  {
    "word": "SACCULO-UTRICULAR",
    "definitions": ["Pertaining to the sacculus and utriculus of the ear."]
  },
  {
    "word": "SQUARROSO-DENTATE",
    "definitions": ["Having the teeth bent out of the plane of the lamina; -- said of a leaf."]
  },
  {
    "word": "TEMPORO-AURICULAR",
    "definitions": [
      "Of or pertaining to both the temple and the ear; as, the temporo-auricular nerve."
    ]
  },
  {
    "word": "TRIGESIMO-SECUNDO",
    "definitions": [
      "Having thirty-two leaves to a sheet; as, a trigesimo-secundo form, book, leaf, size, etc."
    ]
  },
  {
    "word": "ARGILLO-CALCAREOUS",
    "definitions": ["Consisting of, or containing, clay and calcareous earth."]
  },
  {
    "word": "CALCAREO-SILICEOUS",
    "definitions": ["Consisting of, or containing calcareous and siliceous earths."]
  },
  {
    "word": "CONNATE-PERFOLIATE",
    "definitions": [
      "Connate or coalescent at the base so as to produce a broad foliaceous body through the center of which the stem passes; -- applied to leaves, as the leaves of the boneset."
    ]
  },
  {
    "word": "ELEUTHERO-PETALOUS",
    "definitions": [
      "Having the petals free, that is, entirely separate from each other; -- said of both plant and flower."
    ]
  },
  {
    "word": "MAXILLO-MANDIBULAR",
    "definitions": ["Pertaining to the maxilla and mandible; as, the maxillo- mandibular nerve."]
  },
  {
    "word": "MECHANICO-CHEMICAL",
    "definitions": [
      "Pertaining to, connected with, or dependent upon, both mechanics and chemistry; -- said especially of those sciences which treat of such phenomena as seem to depend on the laws both of mechanics and chemistry, as electricity and magnetism."
    ]
  },
  {
    "word": "MICACEO-CALCAREOUS",
    "definitions": [
      "Partaking of the nature of, or consisting of, mica and lime; -- applied to a mica schist containing carbonate of lime."
    ]
  },
  {
    "word": "SELF-COMMUNICATIVE",
    "definitions": ["Imparting or communicating by its own powers."]
  },
  {
    "word": "SELF-CONTRADICTORY",
    "definitions": ["Contradicting one's self or itself."]
  },
  {
    "word": "SEMI-CHRISTIANIZED",
    "definitions": ["Half Christianized."]
  },
  {
    "word": "SENSORI-VOLITIONAL",
    "definitions": [
      "Concerned both in sensation and volition; -- applied to those nerve fibers which pass to and from the cerebro-spinal axis, and are respectively concerned in sensation and volition. Dunglison."
    ]
  },
  {
    "word": "TRIPLICATE-TERNATE",
    "definitions": ["Triternate."]
  },
  {
    "word": "ARGILLO-AREENACEOUS",
    "definitions": ["Consisting of, or containing, clay and sand, as a soil."]
  },
  {
    "word": "ARGILLO-FERRUGINOUS",
    "definitions": ["Containing clay and iron."]
  },
  {
    "word": "CALCAREO-BITUMINOUS",
    "definitions": ["Consisting of, or containing, lime and bitumen. Lyell."]
  },
  {
    "word": "ELECTRO-TELEGRAPHIC",
    "definitions": ["Pertaining to the electric telegraph, or by means of it."]
  },
  {
    "word": "ELLIPTIC-LANCEOLATE",
    "definitions": ["Having a form intermediate between elliptic and lanceolate."]
  },
  {
    "word": "INTERNAL-COMBUSTION",
    "definitions": [
      "Designating, or pertaining to, any engine (called an Internal- combustion engine) in which the heat or pressure energy necessary to produce motion is developed in the engine cylinder, as by the explosion of a gas, and not in a separate chamber, as in a steam- engine boiler. The gas used may be a fixed gas, or one derived from alcohol, ether, gasoline (petrol), naphtha, oil (petroleum), etc. There are three main classes: (1) gas engines proper, using fixed gases, as coal, blast-furnace, or producer gas; (2) engines using the vapor of a volatile fluid, as the typical gasoline (petrol) engine;",
      "oil engines, using either an atomized spray or the vapor (produced by heat) of a comparatively heavy oil, as petroleum or kerosene. In all of these the gas is mixed with a definite amount of air, the charge is composed in the cylinder and is then exploded either by a flame of gas (flame ignition -- now little used), by a hot tube (tube ignition) or the like, by an electric spark (electric ignition, the usual method is gasoline engines, or by the heat of compression, as in the Diesel engine. Gas and oil engines are chiefly of the stationary type. Gasoline engines are largely used for automobile vehicles, boats, etc. Most internal-combustion engines use the Otto (four-stroke) cycle, though many use the two-stroke cycle. They are almost universally trunk engines and single-acting. Because of the intense heat produced by the frequent explosions, the cylinders must be cooled by a water jacket (water-cooled) or by air currents (air cooled) to give the maximum thermodynamic efficiency and to avoid excessive friction or seizing."
    ]
  },
  {
    "word": "OVATE-CYLINDRACEOUS",
    "definitions": ["Having a form intermediate between ovate and cylindraceous."]
  },
  {
    "word": "OVATO-CYLINDRACEOUS",
    "definitions": ["Same as Ovate-cylindraceous."]
  },
  {
    "word": "PSEUDO-HYPERTHOPHIC",
    "definitions": [
      "Falsely hypertrophic; as, pseudo-hypertrophic paralysis, a variety of paralysis in which the muscles are apparently enlarged, but are really degenerated and replaced by fat."
    ]
  },
  {
    "word": "TRAGI-COMI-PASTORAL",
    "definitions": [
      "Partaking of the nature of, or combining, tragedy, comedy, and pastoral poetry. [R.] Gay."
    ]
  },
  {
    "word": "CALCAREO-ARGILLACEOUS",
    "definitions": ["consisting of, or containing, calcareous and argillaceous earths."]
  },
  {
    "word": "ELECTRO-CHRONOGRAPHIC",
    "definitions": ["Belonging to the electro-chronograph, or recorded by the aid of it."]
  },
  {
    "word": "ELECTRO-PHYSIOLOGICAL",
    "definitions": [
      "Pertaining to electrical results produced through physiological agencies, or by change of action in a living organism."
    ]
  },
  {
    "word": "PERNICKETY PERNICKETTY",
    "definitions": ["Finical or fussy; full of petty details. [Colloq.]"]
  },
  {
    "word": "PSEUDO-MONOCOTYLEDONOUS",
    "definitions": ["Having two coalescent cotyledons, as the live oak and the horse-chestnut."]
  }
]
